[
  {
    "description": "A man wearing nothing but his undergarments and a gas mask careens his RV down a desolate highway in the New Mexico desert. In the passenger seat, another man is passed out, also wearing a gas mask, his head on the dashboard. Two bodies slide across the RV floor until the vehicle veers into a ditch. The hyperventilating driver, Walter White, climbs out, dons the shirt still hanging off the side view mirror (his pants are long since gone), then re-enters the van to retrieve a video camera, his wallet, and a gun. He records a cryptic, handheld farewell to his wife and son as sirens can be heard in the distance. He then places the camera alongside his wallet, walks onto the road, and awaits the approach of the emergency services, gun in hand.",
    "title": "Pilot",
    "episode": "E01",
    "season": "S01",
    "date": "January 20, 2008"
  },
  {
    "description": "Walter White finishes having sex with his wife (starting off from where the last episode ends) and gets up to wash up in the bathroom. He looks at himself in the mirror.<br><br>Twelve hours before, a Native American man tows their RV from a ditch, a pants-less Walt and a black-eyed Jesse Pinkman thank him profusely and hand him a wad of cash. As Walt attempts to get the RV started, they argue, with Jesse's reluctance, to park the RV at Jesse's house and part ways for the time being. We see that Walt's gas mask is being forgotten, still behind a rock at the crash site. They agree that this partnership will end as soon as they deal with the bodies of Emilio Koyama and Krazy 8 lying in the back. As Walt turns the key in the ignition, finally getting the engine to turn over, a sound alerts them to the fact that one of the \"dead\" men isn't dead.",
    "title": "Cats in the Bag",
    "episode": "E02",
    "season": "",
    "date": "January 27, 2008"
  },
  {
    "description": "Walter White and Jesse Pinkman, barely able to refrain from vomiting, scrub up the hydrofluoric acid-dissolved remains of Emilio Koyama. The grisly scene at Jesse's house takes Walt back to his younger days. In a flashback, he is seen in a laboratory with a female lab partner and they are analyzing the human body's chemical composition. After discovering that only 99 percent of the body's makeup is accounted for chemically, Walt muses that there has to be more to a human being than that. Back in the present Walt's older self flushes another bloody bucketful down the toilet.",
    "title": "and the Bags in the River",
    "episode": "E03",
    "season": "",
    "date": "February 10, 2008"
  },
  {
    "description": "Hank Schrader puts his DEA team on notice that \"new players in town\" are making super-pure meth. Operation \"Icebreaker\" turns into operation TBD (To Be Determined) when Steven Gomez jokes that \"Icebreaker\" is the name of a breath mint. Hank describes the \"new players\" as being of a high skill set. We then cut to Walter White, standing at his bathroom mirror in his underwear, messily brushing his teeth.",
    "title": "Cancer Man",
    "episode": "E04",
    "season": "",
    "date": "February 17, 2008"
  },
  {
    "description": "Jesse Pinkman, wearing jacket and tie, interviews for a job at Arroyo Realty but bails upon discovering that the job would require him to wear a full-body costume advertising the same realty company. He comes across an old friend, Badger, wearing the costume, and they smoke a joint together in an alley. Jesse says he's thinking of retiring from the crystal business. Badger offers to partner up if he ever gets back in.",
    "title": "Gray Matter",
    "episode": "E05",
    "season": "",
    "date": "February 24, 2008"
  },
  {
    "description": "Walter White, back in business with Jesse Pinkman, enters the RV and surveys the damage. He sternly gives Jesse a lecture, telling how things will be from now on. He tells him that he wants to be the \"silent partner,\" his \"realm\" is only the chemistry and Jesse's is the street. As far as customers, Walt wants nothing to do with them \"No more bloodshed.\" This scene is intercut with shots of a bald man calmly walking through a group of bikers on a street littered with smoldering debris, various car alarms blaring. He is holding a white bag with a red stain on it. As we pan up and his face is revealed, we see that this bald man is actually Walt and we are in a flashforward.",
    "title": "Crazy Handful of Nothin",
    "episode": "E06",
    "season": "",
    "date": "March 2, 2008"
  },
  {
    "description": "At JP Wynne High School, Walter White and Skyler White attend a meeting to update faculty and parents on the chem-lab thefts. Seated next to each other, Walt begins to stroke Skyler's thigh under the table. She resists at first but then revels in the erotic moment, which is cut short when Walt is called upon. However, later in the parking lot, the two have sex in Walt's car.<br><br>\"Where did that come from?\" she asks. \"And why was it so damn good?\"<br><br>\"Because it was illegal,\" Walt replies.",
    "title": "A No-Rough-Stuff-Type Deal",
    "episode": "E07",
    "season": "",
    "date": "March 9, 2008"
  },
  {
    "description": "We open on black & white shots of a backyard. We pan over to reveal what appears to be a bobber in a pool of water. The bobber is then sucked into the drain of the pool as we go under the water to find a floating pink teddy bear. As the face of bear slowly turns to face us, we see that half of its body is burned, and what we thought was a bobber was actually the doll's left eye.",
    "title": "Seven Thirty-Seven",
    "episode": "E01",
    "season": "S02",
    "date": "March 8, 2009"
  },
  {
    "description": "Out in the desert, a red lowrider riddled with bullet holes bounces wildly on its hydraulic suspension system. Shards of glass, spent casings and drops of blood litter the ground. As the license plate reading \"THECAPN\" is finally revealed, we realize this is Jesse Pinkman's car.",
    "title": "Grilled",
    "episode": "E02",
    "season": "",
    "date": "March 15, 2009"
  },
  {
    "description": "Walter White and Jesse Pinkman bury Tuco Salamanca's gun in the desert, then split up, hatching a plan to explain away their days of absence. Walt hitches a ride back to civilization in a pickup truck. Shortly, in a supermarket, a clerk follows a trail of clothes littering the floor to find Walt, weak and confused, walking naked down an aisle.",
    "title": "Bit by a Dead Bee",
    "episode": "E03",
    "season": "",
    "date": "March 22, 2009"
  },
  {
    "description": "We return to the eerie scene as first depicted in the season premiere. The same charred, pink teddy bear floats around an empty swimming pool. A figure in a hazmat suit leans over into the pool and spots the teddy bear, then retrieves it with a pool skimmer. Placing it into an evidence bag, they lay the teddy bear on the ground next to other collected objects, also wrapped in evidence bags, carefully organized along the side of the pool. The line of random objects ends with a pair of eyeglasses, very reminiscent of Walter White's.",
    "title": "Down",
    "episode": "E04",
    "season": "",
    "date": "March 29, 2009"
  },
  {
    "description": "Two men carrying small bundles swim across a muddy river. Once ashore, one of them stumbles and turns to find he's tripped over a dental grill encased in a Lucite cube: Hank Schrader's souvenir from his encounter with Tuco Salamanca.",
    "title": "Breakage",
    "episode": "E05",
    "season": "",
    "date": "April 5, 2009"
  },
  {
    "description": "Jesse Pinkman stands alone on a sidewalk, he crouches down and cautiously examines a large beetle as it wanders the pavement. Skinny Pete approaches, notices the same beetle and immediately crushes it underfoot without a second thought. Jesse shoots him a baffled frown, but says nothing. Skinny Pete, oblivious, hands Jesse the name and address of the junkie that robbed him.<br><br>\"So let me get this straight,\" Jesse says. \"You got jacked by a guy named Spooge.\" Pete doesn't know the name of Spooge's accomplice, \"She's just his woman,\" he says, but he tells Jesse that these two \"need to get got.\"",
    "title": "Peekaboo",
    "episode": "E06",
    "season": "",
    "date": "April 12, 2009"
  },
  {
    "description": "A narcocorrido band performs \"Negro y Azul\" (Black and Blue), in which \"a gringo boss\" named Heisenberg disrespects the Mexican drug cartel by cornering the Albuquerque market with high-quality blue crystal. \"That homie's already dead,\" goes the refrain, \"he just doesn't know it yet.\"",
    "title": "Negro y Azul",
    "episode": "E07",
    "season": "",
    "date": "April 19, 2009"
  },
  {
    "description": "The episode opens with Badger siting at a bus stop. A nerdy guy sits down on the bench and asks him if he's selling. Badger almost immediately laughs him off, convinced that the guy has to be an undercover cop: he even points out the multiple vans \"inconspicuously\" parked nearby and guesses that they're surveillance vehicles. The customer, somewhat annoyed with Badger's behavior, lifts his shirt to show that he's not wearing a wire as Badger suspects, and almost starts to walk away before Badger apologizes. Still, Badger explains that he can't sell to the guy, because there's no way to be sure that he isn't a cop. So the customer explains that a cop can't deny that he's a cop if you ask him directly, saying \"it's in the Constitution\". Delighted, Badger asks him if he's a cop. The customer says \"no\", the two make a deal for some blue meth, and the customer starts to walk away. A split second later, the customer suddenly turns around and pulls out a gun and badge, arresting Badger on the spot.",
    "title": "Better Call Saul",
    "episode": "E08",
    "season": "",
    "date": "April 26, 2009"
  },
  {
    "description": "Walter White undergoes tests to see if the chemo and radiation therapies have reduced the size of his tumor. His doctor won't share the results for another four days, but glimpsing the scan’s image Walt notices a large white spot on top of his lung.",
    "title": "4 Days Out",
    "episode": "E09",
    "season": "",
    "date": "May 3, 2009"
  },
  {
    "description": "The episode opens on the pink teddy bear previously seen in other episodes (\"Seven Thirty-Seven\") (\"Down\"). The bear is placed into a container along with the other retrieved items as people in hazmat suits continue to clean the area. From behind a broken windshield, we see two of them carrying out the container, teddy bear sitting on top. Another person in a hazmat suit takes a photograph of the windshield, which we suddenly see is of Walt's Aztek. As it becomes clear that this is a flashforward, we pan up higher to reveal two body bags (with remains inside) lying in the driveway in front of the White Residence.",
    "title": "Over",
    "episode": "E10",
    "season": "",
    "date": "May 10, 2009"
  },
  {
    "description": "Combo, casually sipping a fountain drink, is standing on a street corner. It becomes clear that he is selling, presumably on new territory. Near by, a young boy, Tomás Cantillo, is riding his bike. A car pulls up and Combo crosses the street to meet the two men inside.<br><br>When the two men don't respond, Combo raises his shirt and shows them the silver pistol in his waistband. The two men pull off. Combo returns back to the corner as the two men in the car then circle the block. They begin watching him as they sit at the intersection. Nervous, Combo calls Skinny Pete, telling him that he's \"gettin' eyeballed hard\" and may need backup. While he talks, Tomas circles him while riding his bike. Moments later, the driver honks the horn to his car. A split second later, Tomas produces a pistol and shoots Combo in the chest. The two of them both share terrified expressions. Tomas hesitates for a second, but then shoots Combo again. Combo drops his drink and tries to run away, yet he only makes it to the middle of the street before Tomas finishes him off. Tomas and the two dealers then flee the scene as Combo bleeds to death.",
    "title": "Mandala",
    "episode": "E11",
    "season": "",
    "date": "May 17, 2009"
  },
  {
    "description": "Having successfully delivered the meth to Gus, Walter White races into the parking lot of an abandoned motel where he calls the hospital and learns that Skyler White has given birth. He ditches his spare tire and stashes a duffel bag in the tire well.<br><br>At the hospital, Walt greets Skyler and tenderly holds his daughter before noticing Ted Beneke standing behind him, who had driven Skyler to the hospital. \"I just wish you had been here,\" Skyler tells Walt after Ted leaves. Later, Walt runs home to retrieve Skyler's overnight bag and unload his duffel, which is packed with his million-plus of cash.",
    "title": "Phoenix",
    "episode": "E12",
    "season": "",
    "date": "May 24, 2009"
  },
  {
    "description": "We return to the flashforward from previous episodes (\"Seven Thirty-Seven\") (\"Down\") (\"Over\"). Workers from the NTSB load the items collected from Walter White's pool (including the singed, one-eyed, pink teddy bear) into the back of a van. We watch as the van pulls out, panning up over Walter's house to reveal the city, with two giant pillars of black smoke rising in the distance and helicopters hovering overhead.",
    "title": "ABQ",
    "episode": "E13",
    "season": "",
    "date": "May 31, 2009"
  },
  {
    "description": "Men and women crawl on their bellies up a dusty, adobe-lined desert road. A Mercedes stops alongside the crawling sacrificial procession. Two men exit the car; both wear well-cut suits and cowboy boots tipped with silver skulls. They look so alike, they might be brothers, even twins, but we will come to know them as \"the Cousins.\"     <br><br>They too begin to crawl with the others. The procession winds to a candlelit shrine to Santa Muerte, a skulled Mexican deity representing death. The two men rise to their feet. One makes an offering; the other pins something to the shrine: a crude sketch of Heisenberg.",
    "title": "No Más",
    "episode": "E01",
    "season": "S03",
    "date": "March 21, 2010"
  },
  {
    "description": "Walter White drives to work, singing along to the song \"A Horse with No Name.\" He's pulled over by a policeman, who writes Walt a ticket for driving with a cracked windshield. Walt tries to explain that the car was damaged by debris raining down from the Wayfarer 515 collision, but to no avail. \"Hellfire rained down on my house!\" Walt screams, \"there were body parts strewn everywhere\", ignoring the officer's instructions to calm down. Moments later, a pepper-sprayed Walt is thrust into the patrol car, eyes bulging red and streaming.",
    "title": "Caballo Sin Nombre",
    "episode": "E02",
    "season": "",
    "date": "March 28, 2010"
  },
  {
    "description": "In a flashback sequence, Hank Schrader's DEA informant, the late Tortuga, holds court at a seedy Mexican cantina. Tortuga receives a birthday present — a large tortoise — from \"El Jefe,\" his boss. \"It's perfect!\" says Tortuga, delighted until the boss writes \"HOLA DEA\" (translation : 'Hello/Hey/Hi DEA') on the reptile's back. The Cousins step out of a back room. One holds Tortuga down as the other cuts off his head with a machete.",
    "title": "IFT",
    "episode": "E03",
    "season": "",
    "date": "April 4, 2010"
  },
  {
    "description": "At a desert gas station, Jesse Pinkman fills The RV's tank. Realizing that he's short on cash, he charms the cashier girl into taking some freshly manufactured blue meth as payment instead. She's reluctant, admitting only having smoked pot before, but intrigued nonetheless. Just then, a police officer enters the store, Jesse plies on the pressure for her to take the deal. As the officer gets to the counter behind Jesse, she finally relents and takes it.",
    "title": "Green Light",
    "episode": "E04",
    "season": "",
    "date": "April 11, 2010"
  },
  {
    "description": "In a flashback to the pilot episode, Walter White hands Jesse Pinkman all his remaining life's savings to purchase an RV. Instead, Jesse heads to a strip club with Skinny Pete and Combo and spends the cash on a night-long bender filled with lap dances and champagne. Come morning, only $1,400 remains, and a panicked Jesse sobering to the fact he's F'd up again, might have to leave town. But Combo comes to his rescue, in what he describes as \"a no paperwork-type deal,\" offers to supply Jesse with a white & brown RV for just that price. (Which he seems to be stealing from someone else and pocketing the money.)",
    "title": "Más",
    "episode": "E05",
    "season": "",
    "date": "April 18, 2010"
  },
  {
    "description": "A tribal police officer is dispatched to investigate the possible disappearance of an elderly woman that resides on a reservation outside of Albuquerque. At her property, out behind the outhouse, he finds her body and evidence that someone else has taken up residence - two black men's shirts, hanging out to dry. \"Whoever's in there, show yourself!\" the officer shouts. One of the Cousins, Leonel, steps out of the house, distracting the cop while the other sneaks up behind the officer and attacks him with an axe, dispatching him with a number of blows.",
    "title": "Sunset",
    "episode": "E06",
    "season": "",
    "date": "April 25, 2010"
  },
  {
    "description": "In Mexico, two young boys fight over a toy until one breaks it. We realize we are in a flashback when nearby, a much younger, spryer Hector Salamanca talks on his 1980s-era 'brick' cell phone, disparaging the \"chicken man\" as a 'dirty Sudaca'.<br><br>The call finished, one young boy, Leonel, complains to his Tio Hector about the broken toy, claiming that he wishes his brother was dead. Tio calls the brother, Marco, over and shoves his head in a tub of icy water where he's keeping his beers. \"This is what you wanted? Your brother dead, right?\" asks Tio as he's drowning Marco. Leonel starts hitting Tio, who only finally releases Marco when he's struck harder in the face. Standing up, looming over them... \"Family is all,\" declares a bloody-nosed Tio.<br><br>In the present, the Cousins light candles at a makeshift Santa Muerte shrine. In the center, they place a photo of Hank Schrader.",
    "title": "One Minute",
    "episode": "E07",
    "season": "",
    "date": "May 2, 2010"
  },
  {
    "description": "Jesse Pinkman, still weak and bruised, is wheeled out of the hospital by an orderly. As he waits outside for his ride, avidly lighting up a cigarette, an ambulance arrives from the scene of the parking lot shooting carrying a critically wounded Hank Schrader and comes to a stop outside the loading dock. Two emergency room doctors come out and work with paramedics to unload Hank. Intrigued, Jesse wheels himself over to see what's going on. He is shocked when he recognizes Hank as the patient on the stretcher. Jesse can hardly believe his eyes, and follows the doctors as they wheel Hank to the operating room for immediate surgery. Jesse then returns outside and waits, and is eventually picked up by Skinny Pete. When Jesse enters the car, Pete is shocked at Jesse's injuries and asks if he's okay with Jesse replying with a satisfied smile, \"Actually, I'm great.\"",
    "title": "I See You",
    "episode": "E08",
    "season": "",
    "date": "May 9, 2010"
  },
  {
    "description": "A Los Pollos Hermanos commercial extols the chain's (apocryphal) history and the secret to its signature chicken. The commercial transitions (via a never-ending trail of sparkling blue crystals) to Walt and Jesse Pinkman at the superlab, handing off a shipment of blue sky, which ends up at Gustavo Fring's chicken farm. Victor supervises workers as they submerge plastic bags of the blue meth into specially UV-marked tubs of fry batter for shipment across the Southwest. As the trucks[1][2] are loaded up and begin heading exiting the facility, Gus' silhouette can be seen as he oversees the entire operation.",
    "title": "Kafkaesque",
    "episode": "E09",
    "season": "",
    "date": "May 16, 2010"
  },
  {
    "description": "Over disjointed, extreme closeups of a common house fly, we hear Skyler White softly singing a lullaby to baby Holly White.",
    "title": "Fly",
    "episode": "E10",
    "season": "",
    "date": "May 23, 2010"
  },
  {
    "description": "In a flashback, we find Jesse Pinkman and Jane Margolis taking in Georgia O'Keeffe's painting, \"My Last Door.\" Unimpressed, Jesse argues that O'Keeffe painted the same door over and over attempting to achieve perfection, and doesn't understand why she'd bother. To Jane, the repetition was about making a good feeling last. Her point made, Jane extinguishes her cigarette, marked with an impression of her pink lipstick, in the ashtray. (The same butt seen noticed by Jesse in the previous episode.)",
    "title": "Abiquiú",
    "episode": "E11",
    "season": "",
    "date": "May 30, 2010"
  },
  {
    "description": "We open to a musical montage sequence of Wendy turning tricks outside \"The Crystal Palace\" - and how it's become a repeat daily grind, day after day. Her finances replenished, she exchanges cash and burgers for blue meth with the rival dealers. Jesse Pinkman, nearby in his car, watches the deal go down... and ponders.",
    "title": "Half Measures",
    "episode": "E12",
    "season": "",
    "date": "June 6, 2010"
  },
  {
    "description": "In a flashback to roughly 16 years ago, a real estate agent shows a younger Walter White and Skyler White (pregnant with Walter White Jr.) the house where they'll eventually live. Walt, then working at the prestigious Sandia Laboratory and envisioning a bright future with three children, worries they aren't setting their sights high enough with this house. \"We've got nowhere to go but up,\" he says.",
    "title": "Full Measure",
    "episode": "E13",
    "season": "",
    "date": "June 13, 2010"
  },
  {
    "description": "In a flashback, Gale Boetticher excitedly unpacks sterling new high-tech lab equipment, making notes in a distinctive journal labeled \"Lab Notes\" - he is setting up the superlab. Gustavo Fring visits Gale in the lab to check on his proccess. Gale then praises the blue meth Gus gave him to analyze — it's beyond the purity that he, or anyone else he knows of, could produce - a 96% to 99% purity difference, which doesn't seem much but is in fact quite major. Gus politely demurs, saying the chemist responsible wouldn't make a suitable partner due to other considerations. Gale insists on the superiority of this blue meth — he says that they \"have their work cut out for them\" if that is their competition, and he knows the value Gus puts on perfection. Gus reconsiders; it seems Gale has just talked Gus into hiring Walter White.",
    "title": "Box Cutter",
    "episode": "E01",
    "season": "S04",
    "date": "July 17, 2011"
  },
  {
    "description": "In a motel room, Walter White purchases a thirty-eight snub with a filed off serial number from Lawson, an illicit gun dealer procured by Saul. Watching Walt awkwardly draw the weapon, Lawson advises Walt to practice. He tells Walt that as long as this gun is for defense, there is little sense in him carrying an illegal firearm. But Walt says he wants it this way \"just in case\" — from the look on his face it's clear 'legal' isn't what he's looking for.",
    "title": "Thirty-Eight Snub",
    "episode": "E02",
    "season": "",
    "date": "July 24, 2011"
  },
  {
    "description": "Walter White arrives at the superlab and hears the whirring sound of a surveillance camera tracking his every move: Gustavo Fring is watching him. Furious, he flips the bird to the camera.",
    "title": "Open House",
    "episode": "E03",
    "season": "",
    "date": "July 31, 2011"
  },
  {
    "description": "Mike Ehrmantraut huddles inside a Los Pollos Hermanos refrigerated truck driving down a rural highway. The peace is suddenly interrupted by the sound of screeching tires as the truck is forced off the road by armed cartel gunmen. Recognizing that they're being attacked, Mike pulls out his pistol and cautiously listens as the gunmen pull the driver out of the cab and shoot him in the head. Mike hunkers down and draws a pistol as the two gunmen raise MP5K submachine guns and open fire on the truck, riddling it with bullets. Thinking that they've killed anyone inside, the gunmen break open the back doors. The moment they step up, Mike pops up from behind some boxes and shoots both of them, killing them instantly. Mike holsters his pistol and climbs out of the truck. As he assesses the damage, he finds that a bullet has torn off a small piece of his right ear. He pokes at it, rolls his eyes, and swears under his breath...",
    "title": "Bullet Points",
    "episode": "E04",
    "season": "",
    "date": "August 7, 2011"
  },
  {
    "description": "Walter White races through busy Albuquerque streets, dodging traffic while shouting instructions to Saul Goodman on his cell phone. If Walt doesn't return within 24 hours, Saul is to deliver all of Walt's money to Skyler White. Walt then calls Skyler and leaves a hurried message but trying not to sound desperate, telling her he loves her: evidently, Walt is heading into some kind of showdown and is aware he might not come out of it alive. He places his gun on the front passenger seat next to him in anticipation...",
    "title": "Shotgun",
    "episode": "E05",
    "season": "",
    "date": "August 14, 2011"
  },
  {
    "description": "Reminiscent of the teaser of \"Bullet Points,\" Cartel thugs (led by cartel buttonman Gaff) ambush a Los Pollos Hermanos refrigerated truck. Like before, they shoot and kill the driver. But rather than shoot up the truck like before, they proceed to bar the back doors to lock the guards in. They then hook up a tube to the exhaust pipe to redirect the exhaust into the truck's ventilation system and floor on the gas pedal. Gaff and his crew then eat the driver's lunch as the guards suffocate to death from carbon monoxide fumes. Once the guards die, the thugs break into the truck and take a single marked container of fry batter.",
    "title": "Cornered",
    "episode": "E06",
    "season": "",
    "date": "August 21, 2011"
  },
  {
    "description": "At home, on a massive TV screen, playing the first-person shooter video game Rage, Jesse Pinkman fires a gun at the mutants attacking him. Images of Gale Boetticher's dead body/murder blend in with the action as Jesse replays the real-life gunshot and Gale falling dead in his mind's eye. Distracted and disturbed, Jesse dies in the game. He catches his breath. The memory fades, and he restarts.",
    "title": "Problem Dog",
    "episode": "E07",
    "season": "",
    "date": "August 28, 2011"
  },
  {
    "description": "In a flashback to the same previously seen hospital scene just after Hank Schrader's shooting (\"I See You\"), where Walter White confronts Gustavo Fring about who was behind the attempt on his life. And as Mike Ehrmantraut slips away, unnoticed, after murdering the Cousin who survived the ambush. Later, still in flashback, Hector \"Tio\" Salamanca seethes silently in a nursing home as he watches news coverage of the shootings. Gus drops by for a visit, switches off the TV set, props himself on a chair opposite Hector and offers to better recount the events for him personally. Almost victoriously Gus describes his nephews' - the Cousins' - deaths, and the cryptic warning Hank received before the attack. Which, he relishes in pointing out, caused them to lose the upper hand and thereby their lives. Cartel boss Juan Bolsa is also dead, Gus reports with more sadistic glee. \"This is what comes,\" says Gus, quoting Bolsa's own phrase, \"of 'blood for blood'.\" \"Sangre por sangre,\" he repeats in Spanish, be it for emphasis or Tio's clear understanding; who is by now beside himself with rage, his red faced temper desperate to push through his paralysis, as Gus leaves him with a patronising pat on the knee. <br><br>As Tio rages, we cut to water that grows tinged with blood.",
    "title": "Hermanos",
    "episode": "E08",
    "season": "",
    "date": "September 4, 2011"
  },
  {
    "description": "In a flash-forward, we hear heavy breathing and see a broken pair of eyeglasses on the floor. Blood drips onto the floor and on to a familiar pair of Wallabee shoes. A man's hand struggles to pick up the glasses. Upon retrieving them, he slowly stumbles away.",
    "title": "Bug",
    "episode": "E09",
    "season": "",
    "date": "September 11, 2011"
  },
  {
    "description": "Jesse Pinkman, Mike Ehrmantraut, and Gustavo Fring stand together out in the desert. After a long period of silence, the sound of a single-engine plane can be heard. It lands nearby and they board the plane. Jesse's anxiety during the Mexico-bound flight is palpable. \"You can do this,\" Gus, who is holding a conspicuous giftbox, reassures him.",
    "title": "Salud",
    "episode": "E10",
    "season": "",
    "date": "September 18, 2011"
  },
  {
    "description": "Doctors and nurses hastily prepare medical equipment until a phone call prompts them to wheel a stretcher out of the room. Upon their exit it's revealed that they are working in a fully equipped tent inside an abandoned warehouse. A car comes racing toward them, frantically honking its horn until it comes to a halt and its driver, Jesse Pinkman, jumps out. The medical staff put the unconscious Gustavo Fring onto the stretcher and rush him into the tent, leaving behind the severely injured Mike Ehrmantraut, despite Jesse's desperate calls of \"what about him, huh!?\"<br><br>In the tent, the doctors and nurses focus intently on saving Gus from his self-induced poisoning. Jesse stumbles in carrying Mike, who is bleeding profusely, and shouts angrily, \"This man needs help!\" The head doctor, Dr. Barry Goodman, shoots back, \"This man pays my salary\" in reference to Gus, and continue ignoring Mike... ",
    "title": "Crawl Space",
    "episode": "E11",
    "season": "",
    "date": "September 25, 2011"
  },
  {
    "description": "Walter White and Skyler White frantically pack their luggage in their bedroom and discuss preparing Walter White Jr.'s belongings. As DEA agents arrive at the White Residence to take them into protective custody at Hank and Marie Schrader's, Walt tells Skyler that the hitman is after him, not Hank and that his presence will only make the situation more dangerous. Skyler frantically asks Walt, \"How long till you're safe. 'Till you''ve worked it out?\"  Walt can only answer, \"There was a way out. But not any longer.\" She very reluctantly leaves him behind as she takes the baby to her sister's.",
    "title": "End Times",
    "episode": "E12",
    "season": "",
    "date": "October 2, 2011"
  },
  {
    "description": "After Gustavo Fring turns from his car and leaves the parking garage, Walter White rushes to disarm the bomb and remove it from the vehicle. He then enters the hospital and talks with Jesse Pinkman, asking if he can think of any other place to catch Gus off guard. As they talk, two detectives approach Jesse and take him to interrogate him about the ricin hint.",
    "title": "Face Off",
    "episode": "E13",
    "season": "",
    "date": "October 9, 2011"
  },
  {
    "description": "The episode opens in a Denny's restaurant, across the street from the University of New Mexico in Albuquerque. A man, sitting alone at the counter, is served his breakfast: bacon, two eggs sunnyside up and hashbrowns. The man breaks his bacon bits in half, then arranges the pieces into the number 52, referencing a White family birthday tradition (\"Pilot\"). This man is revealed to be Walter White, in deteriorating health, sporting a different pair of glasses, full head of hair, an unkempt beard and no wedding band. We are a year into the future.<br><br>A waitress tries to make conversation with him, but Walt is not very compliant and begrudgingly answers her benign questions, giving her a fake name (Lambert, which is Skyler White's and Marie Schrader's maiden name) and shows her a false ID from New Hampshire he pulls out his wallet. Excusing himself to the bathroom, Walt then trades an envelope of cash for a set of keys in the bathroom with Lawson, his previous gun dealer (\"Thirty-Eight Snub\"). Lawson asks Walt for his word that \"it\" won't be crossing the border. Walt assures him that \"it\" won't be leaving further than town. Before exiting the bathroom, Walt lets out a slight cough. He pops a pill.<br><br>Leaving a generous $100 tip under his breakfast plate for the waitress, Walt exits the diner and locates the car that the keys belong to. Opening the trunk, \"it\" is revealed to be an M60 machine gun with ammunition. Walt looks around cautiously, then puts his bag in with the gun and slams the trunk shut.",
    "title": "Live Free or Die",
    "episode": "E01",
    "season": "S05",
    "date": "July 15, 2012"
  },
  {
    "description": "At a test kitchen in Germany, Madrigal Electromotive executive Peter Schuler glumly tastes a variety of dipping sauces. His secretary interrupts to inform him the police have arrived. On his way to face his fate, Schuler grabs an automatic defibrillator and locks himself in the bathroom. As the authorities pound on the door, Schuler places one of the AED contacts in his mouth and electrocutes himself.",
    "title": "Madrigal",
    "episode": "E02",
    "season": "",
    "date": "July 22, 2012"
  },
  {
    "description": "Posing as a paralegal, Mike Ehrmantraut visits Dennis Markowski, the manager of Gustavo Fring's industrial laundry, in jail. During the meeting, Dennis's lawyer, Dan Wachsberger, tunes out and listens to music: he doesn't want to hear what Mike has to say to Dennis about their ongoing collusion. Mike reassures Dennis that the deal he had with Gus is still in place and he should stay quiet.<br><br>Dennis swears he's loyal to Mike but since the feds took his hazard pay, and everyone else's, \"Sooner or later someone's gonna flip.\" Mike guarantees everyone will get compensated for what the feds took as he's setting up anew, or does he need more than his word on it. Dennis agrees to stick to the deal and they shake on it.<br><br>In the hallway, Mike and Dan go through the list of Mike's guys and where they're being held. It's going to be a long, tiring day, but the two of them are going to see all of them.",
    "title": "Hazard Pay",
    "episode": "E03",
    "season": "",
    "date": "July 29, 2012"
  },
  {
    "description": "At an auto shop, a mechanic goes over some recent fixes to Walter White's Aztek, including cleaning some residue blood off the grill (\"Half Measures\") from that deer he had hit (which of course was not exactly a \"deer\"). He jokes that at least the windshield didn't need to be replaced again. Walt looks inside and finds his pork pie hat in the back seat, which he greets with a smile. Just then he has a thought, he offers to trade his Aztek to the mechanic for $100 and immediately lowers it to $50. The mechanic thinks he's joking, as he's just replaced upwards of $1,900 worth of insurance paid parts. Walter White Jr. too asks his dad to slow down but Walt shrugs it off and trades in the car.<br><br>Back at the White Residence, Walt drives home in a brand new shiny pitch black Chrysler 300. Walt Jr., in front of his Chrysler 2006 Chrysler PT Cruiser gives him an uncertain look, politely smiling but clearly not feeling too excited, so Walt trades the PT Cruiser in for his previous new red and black striped 2012 Dodge Challenger. They both beam at each other as they grip their respective steering wheels, elated with their new 'toys'.",
    "title": "Fifty-One",
    "episode": "E04",
    "season": "",
    "date": "August 5, 2012"
  },
  {
    "description": "A young boy, Drew Sharp, rides through the desert on a dirtbike. He stops to play with a tarantula, which he then enthusiastically places into a jar. When he gets back on his bike, he hears a freight train in the distance and drives off to follow it...",
    "title": "Dead Freight",
    "episode": "E05",
    "season": "",
    "date": "August 12, 2012"
  },
  {
    "description": "At the Vamonos Pest Control headquarters, Mike Ehrmantraut, Walter White, and Todd Alquist unload equipment from their train heist. They then, all still in shocked silence, unload and dismantle Drew Sharp's motorbike and dispose it into plastic barrels. They also prepare a barrel to dispose of Drew's body. Outside, after the grim deed, Jesse Pinkman lights up a cigarette and smokes in deep thought, anger etched in his face. When Todd joins him and tries to make conversation with Jesse by remarking that \"shit happens,\" Jesse turns to him without a word and punches him hard in the eye.",
    "title": "Buyout",
    "episode": "E06",
    "season": "",
    "date": "August 19, 2012"
  },
  {
    "description": "In the middle of the desert, Walter White addresses Declan and his bodyguards about the methylamine deal Mike and Jesse Pinkman had previously arranged. Declan is not pleased to hear there's no methyl amine and that Walt is keeping it all for himself. Walt offers to continue cooking his 99.1% pure Blue Sky (which he points out is infinitely better than his weak ±70% pure stuff) and have Declan's organization buy out Mike Ehrmantraut's 33.3% share and be Walt's distribution channel, so everybody can make money. To further prove his point, Walt demands that Declan \"say his name,\" to which Declan feigns ignorance. But after a little more convincing and at Walt's insistence, he resignedly agrees and acknowledges Walt as Heisenberg. \"You're God-damned right!\" Walt replies, all puffed up like a rooster.",
    "title": "Say My Name",
    "episode": "E07",
    "season": "",
    "date": "August 26, 2012"
  },
  {
    "description": "Walter White, frowning and in deep thought, sits alone in the office observing a fly when Todd Alquist enters and confirms that he has disposed of Mike Ehrmantraut's car. He and Walt go to the garage where they open Walt's trunk, uncovering Mike's corpse. Walter says that he doesn't want to talk about it when suddenly the garage door opens. Todd closes the trunk. Jesse Pinkman enters, asking if Walt met with Mike, and if Mike got the money and got away. Walt evades the question, saying only that \"Mike is gone.\" Jesse questions what should be done about Mike's \"legacy\" men, suggesting a vote. Walt tells Jesse that now that he has quit, he no longer has a vote and that he will handle it himself. He then quickly ushers Jesse out of the garage with a stern glare. The door descends between them.",
    "title": "Gliding Over All",
    "episode": "E08",
    "season": "",
    "date": "September 2, 2012"
  },
  {
    "description": "Following the purchase of the M60 (\"Live Free or Die\"), Walter White drives up to the White residence, which is now fenced-in and derelict. He grabs a tire iron from the trunk of his car and enters the house. Trash and graffiti are everywhere; a group of teenagers skateboard in the empty backyard pool. Something catches Walt's eye as he walks through the wrecked skeletal remains of his living room. It's a single word, spray-painted in giant yellow letters on the wall: \"HEISENBERG.\" In the bedroom, he retrieves the vial of ricin from its hiding spot behind a wall outlet plate. After retrieving the ricin, Walt leaves the house. Back outside, his neighbor Carol catches sight of Walt. \"Hello, Carol,\" he says cordially, causing her to drop her groceries in shock.",
    "title": "Blood Money",
    "episode": "E09",
    "season": "",
    "date": "August 11, 2013"
  },
  {
    "description": "An elderly man leaves his house in the still dark early hours of the morning and starts his pickup truck, parked in his driveway. He notices something in front of his car and investigates, discovering that the unknown object is actually a stack of cash. After inspecting the money in his headlight, he inspects further and notices there are more stacks scattered across his neighbors' yards. He follows the trail of money, collecting wads of cash as he goes, and finds an abandoned car, driver's door wide open, and a duffle bag in the passenger seat half filled with bundles of cash. Bewildered, half salivating and growing suspicious, he then hears an odd squeaking sound; which he follows and leads him to find Jesse Pinkman, listlessly spinning on a playground merry-go-round, lying on his back, staring up to the stars.",
    "title": "Buried",
    "episode": "E10",
    "season": "",
    "date": "August 18, 2013"
  },
  {
    "description": "Outside a diner in Arizona, Todd Alquist leaves Walter White a voice message about the recent change of management from Declan and requesting Walt return his call. Inside, he brags to his uncle Jack and his partner Kenny about his train heist of methylamine (\"Dead Freight\"), naming Mr.White, and leaving out his role in shooting Drew Sharp. Afterward, Jack and Kenny visit the bathroom, where Jack notices and nonchalantly wipes considerable blood off his shoe with a paper towel then flushes it down the toilet. The three then leave the diner and haul the methylamine back into New Mexico.",
    "title": "Confessions",
    "episode": "E11",
    "season": "",
    "date": "August 25, 2013"
  },
  {
    "description": "Walter White parks his car down the street from his house just after collecting his revolver from the car wash (\"Confessions\"). Saul Goodman's car is parked in his driveway and the house door is open.<br><br>Walt jumps the wall to the backyard and enters the house from the back entrance, the living room smells like gasoline and there's a gas can lying on the floor. He notices that the carpet is soaked in gasoline, but there are no signs of Jesse Pinkman's presence. Walter checks every single room in the house to make sure, he then walks outside and investigates the interior of Saul's car. There is used meth on top of a CD. It appears that Jesse's been using, but has mysteriously changed his mind before torching the house.",
    "title": "Rabid Dog",
    "episode": "E12",
    "season": "",
    "date": "September 1, 2013"
  },
  {
    "description": "Jack, Kenny and Lydia Rodarte-Quayle observe the final stage of Todd Alquist's cook in their compound. Jack and Kenny remove their masks, Todd tells them that \"Mr. White\" told him that it's not good to breathe the smoke, but Jack just orders him to hurry up so he can go grab a smoke. Todd measures the meth at 76% purity, but Lydia still unimpressed questions if the blue color is going to appear anytime soon, complaining that it is not the signature color her European customers expect from Blue Sky. Jack makes fun of Lydia, \"it looks blue to me.\" Kenny assures that if the quality is better than what \"that guy who looked like Wolverine\" made, then there is nothing to complain about.<br><br>Later, Todd brings Lydia some tea and tells her he can get better with practice. She thanks him for all the effort he is making before realizing that Todd is uncomfortably close to her. She says that she needs to leave because she has a flight to catch. As Lydia walks away, Todd checks the lipstick mark she left on the mug and rubs his finger along it's edge and looks at the lipstick smear on his finger longingly. Just then he receives the phone call from Walter - from the previous episode (\"Rabid Dog\") - requesting he needs his uncle to do \"another job\". Todd says that he is going to set the meeting and asks how many people and in which prison, but Walt tells him that the target is \"currently\" not in prison and is only a single person: Jesse Pinkman. Todd drinks from Lydia's teacup as he watches her drive off.",
    "title": "Tohajiilee",
    "episode": "E13",
    "season": "",
    "date": "September 8, 2013"
  },
  {
    "description": "In a flashback from Walter White and Jesse Pinkman's first cook inside the RV in To'hajiilee (\"Pilot\"), Walt is explaining to Jesse about the reactions during the cooking process as they wait for the batch to cool. Jesse buffs him off and nearly lights a cigarette before Walt warns him to do it on the outside. They exit the RV and Jesse jokes at Walt removing his lab apron, since he is wearing only his underwear beneath it. Walt takes a few steps away from the cook site while Jesse is smoking and calls his wife, Skyler. He deceives her with the excuse that Bogdan Wolynetz is delaying him at the car wash due to problems with some documents, and unaware of his deception, she accepts this but requests that Walt brings pizza for dinner on his way home. Skyler suggests the name \"Holly\" for their baby, and Walt tries the name on for size a few times before they say their goodbyes. Walt thinks about his unborn daughter and smiles as he powers down his cell phone. Walt, Jesse and the RV images fade to the deserted setting of To'hajiilee.",
    "title": "Ozymandias",
    "episode": "E14",
    "season": "",
    "date": "September 15, 2013"
  },
  {
    "description": "Just as seen at the end of the previous episode, the extractor's red van drives off from the side of the road after picking up its passenger. Shortly afterward, it arrives at a vacuum repair shop. The extractor, a man named Ed, drives the van into the shop and we see that instead of Walter White, Ed tells Saul Goodman to get out. Saul is amused to learn that Ed's cover story about being a vacuum cleaner repairman is real. Ed takes a photo of Saul and starts working on Saul's new Nebraska ID. He says that Saul will have to wait at least two days to be extracted out of the state, since his face is well known in Albuquerque, and that in the meantime Saul will be staying in a downstairs bunker with another person awaiting extraction. Knowing the person is Walter White, Saul asks Ed how Walt is doing. Ed shows him a monitor screen with live footage of an impatient Walt angrily pacing around the bunker and slapping a ceiling lamp.",
    "title": "Granite State",
    "episode": "E15",
    "season": "",
    "date": "September 22, 2013"
  },
  {
    "description": "With police searching for him in New Hampshire, Walter White finds an unlocked car, its windows covered in snow, and gets inside. Suffering from the cold weather, he searches for something to start the engine. In the glove compartment, he finds a Marty Robbins music tape and a screwdriver. He tries to use the screwdriver to start the car, but fails after several attempts. The flickering lights of a police car appear, though Walt can't be seen from outside because of the icy snow covering all the windows. As a flashlight passes over the car, Walt quietly pleads, \"Just get me home. I'll do the rest.\" The police car leaves without further inspection, and after a moment of intuition, the car keys drop from the visor into his lap. He starts the car, knocks the snow off the windows, and begins his drive back to Albuquerque.",
    "title": "Felina",
    "episode": "E16",
    "season": "",
    "date": "September 29, 2013"
  }
]