[
  {
    "description": "Malcolm Reynolds is a veteran and the captain of Serenity. He and his crew are smuggling goods, but they need to pick up some passengers for extra money. However, not all the passengers are what they seem.",
    "title": "Serenity",
    "date": "December 20, 2002 (2002-12-20)",
    "directed_by": "Joss Whedon",
    "season": "S01",
    "episode": "E01"
  },
  {
    "description": "The crew of Serenity takes on a train heist commissioned by a crime lord. They steal the goods, only to find it is medicine that is desperately needed by the town.",
    "title": "The Train Job",
    "date": "September 20, 2002 (2002-09-20)",
    "directed_by": "Joss Whedon",
    "season": "",
    "episode": "E02"
  },
  {
    "description": "Serenity is pulled in by an Alliance cruiser while investigating a spaceship that was attacked by Reavers. Simon and River must hide to prevent capture, while something is wrong with the lone survivor of the attacked spaceship.",
    "title": "Bushwhacked",
    "date": "September 27, 2002 (2002-09-27)",
    "directed_by": "Tim Minear",
    "season": "",
    "episode": "E03"
  },
  {
    "description": "Inara attends a formal society dance, only to find Malcolm there as well, attempting to set up a smuggling job. Mal comes to blows with Inara's conceited date and finds himself facing a duel with a renowned swordsman, and only one night to learn how to fence.",
    "title": "Shindig",
    "date": "November 1, 2002 (2002-11-01)",
    "directed_by": "Vern Gillum",
    "season": "",
    "episode": "E04"
  },
  {
    "description": "Mal must choose which crew members to save when one is gravely wounded and two others are kidnapped. Simon finds an uneasy haven in a remote village, but River's uncanny perceptions jeopardize the Tams' temporary safety.",
    "title": "Safe",
    "date": "November 8, 2002 (2002-11-08)",
    "directed_by": "Michael Grossman",
    "season": "",
    "episode": "E05"
  },
  {
    "description": "As an unexpected reward for an unpaid job, Mal finds himself married to a naïve, subservient young woman named Saffron. The crew are amused at his discomfort and Book lectures him on propriety, but things are not as smoothly straightforward as they thought them to be.",
    "title": "Our Mrs. Reynolds",
    "date": "October 4, 2002 (2002-10-04)",
    "directed_by": "Vondie Curtis Hall",
    "season": "",
    "episode": "E06"
  },
  {
    "description": "Returning to a planet where he ran into some serious trouble years ago, Jayne discovers that he has become a local folk legend. Mal decides to use this entertaining distraction to complete a job, but some unfinished business may derail his plans.",
    "title": "Jaynestown",
    "date": "October 18, 2002 (2002-10-18)",
    "directed_by": "Marita Grabiak",
    "season": "",
    "episode": "E07"
  },
  {
    "description": "After Serenity suffers a catastrophe that leaves her crew with only hours of oxygen, flashbacks show how Mal and Zoe acquired Serenity and assembled their motley crew.",
    "title": "Out of Gas",
    "date": "October 25, 2002 (2002-10-25)",
    "directed_by": "David Solomon",
    "season": "",
    "episode": "E08"
  },
  {
    "description": "Hard up for cash, Serenity takes on a job from Simon: help him get a thorough diagnostic of River in return for the opportunity to loot the vast medical stores of an Alliance hospital on central world Ariel. But River's pursuers are hot on their trail, and they receive some unexpected inside help.",
    "title": "Ariel",
    "date": "November 15, 2002 (2002-11-15)",
    "directed_by": "Allan Kroeker",
    "season": "",
    "episode": "E09"
  },
  {
    "description": "Angered at Zoe's unshakable war connection to Mal, Wash demands a shot at a field assignment. Unfortunately, crime lord Niska chooses this moment to exact a brutal vengeance for Mal's failure to complete an earlier job.",
    "title": "War Stories",
    "date": "December 6, 2002 (2002-12-06)",
    "directed_by": "James Contner",
    "season": "",
    "episode": "E10"
  },
  {
    "description": "Saffron returns to plague Serenity with a scheme to steal a rare antique weapon from a wealthy landowner. Unfortunately for Mal, she neglects to mention just how she came across the information needed to break into the landowner's home.",
    "title": "Trash",
    "date": "July 21, 2003 (2003-07-21)",
    "directed_by": "Vern Gillum",
    "season": "",
    "episode": "E11"
  },
  {
    "description": "A former Independence soldier who had served with Mal and Zoe returns in a dramatic manner, with a vicious Alliance officer chasing after him for some unusual smuggled goods.",
    "title": "The Message",
    "date": "July 28, 2003 (2003-07-28)",
    "directed_by": "Tim Minear",
    "season": "",
    "episode": "E12"
  },
  {
    "description": "A Companion-trained friend of Inara's who runs a brothel on a remote planet calls for help from Serenity when a local bigwig reveals his intentions to take the baby from a woman he impregnated.",
    "title": "Heart of Gold",
    "date": "August 4, 2003 (2003-08-04)",
    "directed_by": "Thomas J. Wright",
    "season": "",
    "episode": "E13"
  },
  {
    "description": "Serenity encounters a ruthlessly professional bounty hunter, Jubal Early, who will stop at nothing to retrieve River. But River, feeling unwelcome on the ship, takes a novel approach to escaping from the long arm of the Alliance.",
    "title": "Objects in Space",
    "date": "December 13, 2002 (2002-12-13)",
    "directed_by": "Joss Whedon",
    "season": "",
    "episode": "E14"
  }
]