[
  {
    "description": "\nCaptain Malcolm \"Mal\" Reynolds and his crew aboard Serenity illegally salvage goods from a derelict ship. However, because the goods are marked by the Alliance, and an Alliance ship spotted an out-dated Firefly-class freighter leaving the scene, Mal's fence Badger refuses to handle the goods. Mal has to sell elsewhere. To make extra money, the crew picks up passengers: Shepherd Book, Dr. Simon Tam and Lawrence Dobson. En route to the new buyer, Patience, Dobson turns out to be an Alliance federal agent tracking Simon. Dobson attempts to arrest Simon, but is himself taken prisoner. Simon reveals that his genius sister River Tam, hidden in his luggage, was experimented on by the Alliance and that he is trying to smuggle her to safety. Patience attempts to rob Mal, but Mal takes the payment after a shootout. Lawrence escapes and holds River hostage, but Mal shoots him. Mal offers Simon and River safe haven aboard Serenity.",
    "title": "Serenity",
    "date": "December 20, 2002 (2002-12-20)",
    "directed_by": "Joss Whedon",
    "season": "S01",
    "episode": "E01"
  },
  {
    "description": "\nCrime lord Adelai Niska hires the crew to rob a train of unspecified goods. The crew is able to transfer the goods to Serenity flying above, but Mal and Zoe Washburne are forced to stay behind on the train. They learn that they have stolen medicine desperately needed by the locals. The crew argue whether they should deliver the goods to Niska. Ultimately, they decide to rescue Mal and Zoe first through subterfuge. Mal decides to return the medicine. However, Niska's thugs track them down. After killing some of them and capturing the rest, Mal and Zoe take the medicine to those in need of it and refund Niska's money.",
    "title": "The Train Job",
    "date": "September 20, 2002 (2002-09-20)",
    "directed_by": "Joss Whedon",
    "season": "",
    "episode": "E02"
  },
  {
    "description": "\nThe crew discover a derelict ship that was attacked by Reavers and takes aboard the sole survivor (Branden R. Morgan). Shortly after, an Alliance cruiser orders Serenity to dock to it. Simon and River hide to avoid capture. The rest of the crew are interrogated. Refusing to believe in the existence of Reavers, the Alliance's Commander Harken (Doug Savant) decides that the crew will be charged with attacking the ship and murdering its settler passengers. However, the survivor kills some of the Alliance crew and escapes back to Serenity. Mal convinces Harken to let him help find the survivor. Mal kills the survivor, saving Harken's life in the process, and the crew is released.",
    "title": "Bushwhacked",
    "date": "September 27, 2002 (2002-09-27)",
    "directed_by": "Tim Minear",
    "season": "",
    "episode": "E03"
  },
  {
    "description": "\nInara Serra is hired by Atherton Wing, one of her regular clients, and accompanies him to a formal dance. Badger hires Mal to meet a contact at the same dance and try to set up a smuggling job. When Mal hits Atherton for the way he treats Inara, Mal finds he has unknowingly challenged Atherton to a duel with swords. Atherton is a skilled swordsman and duelist. Inara tries to teach Mal how to use a sword overnight. Despite all expectations, Mal wins the duel. The contact, who personally dislikes Atherton, agrees to hire the crew to smuggle cattle to the Rim.",
    "title": "Shindig",
    "date": "November 1, 2002 (2002-11-01)",
    "directed_by": "Vern Gillum",
    "season": "",
    "episode": "E04"
  },
  {
    "description": "\nThe crew delivers cattle to the Rim, but Book is gravely injured when they are stuck in the middle of a shootout. At the same time, Simon and River Tam are kidnapped by locals while sightseeing in town. Mal chooses to leave the Tams behind to seek help for Book. Desperate, they turn to an Alliance ship. At first hostile, the Alliance officer they speak to provides medical aid after seeing Book's ID. Meanwhile, the kidnappers belong to a community in desperate need of a real doctor, and Simon tentatively hopes he has found a haven for himself and River. However, the religious residents come to believe River is a witch and attempt to burn her at the stake. Serenity returns just in time to rescue the siblings. When Simon asks Mal why he came back, the captain tells Simon that he and River are part of the crew.",
    "title": "Safe",
    "date": "November 8, 2002 (2002-11-08)",
    "directed_by": "Michael Grossman",
    "season": "",
    "episode": "E05"
  },
  {
    "description": "\nAfter completing a job for a small settlement, during the ensuing celebration, Mal learns that he inadvertently married a young woman called Saffron, part of the payment. Although Mal insists they are not married, Saffron is determined to fulfill the role of a subservient wife. Saffron is not what she appears to be, however. She later knocks Mal out, locks the ship into a course for murderous ship scrappers, and flees in a shuttle. The crew barely escapes.",
    "title": "Our Mrs. Reynolds",
    "date": "October 4, 2002 (2002-10-04)",
    "directed_by": "Vondie Curtis Hall",
    "season": "",
    "episode": "E06"
  },
  {
    "description": "\nThe crew lands on a planet to meet a contact. Although Jayne Cobb insists he is wanted there, they are dumbfounded to learn that he is revered by the locals as a folk hero. Mal attempts to use Jayne's status as a distraction to move smuggled goods across town. However, Magistrate Higgins releases Jayne's former accomplice Stitch Hessian, whom Jayne abandoned years ago during a botched robbery and now seeks revenge. Stitch publicly confronts Jayne, revealing what the townspeople believe happened to be false. Stitch shoots, but a villager jumps in front of Jayne and dies. Jayne kills Stitch and urges the townspeople to stop viewing him as a hero. Serenity is \"land-locked\" at Higgins' order to try to capture Jayne. Higgins' 26-year-old son Fess (Zachary Kranzler), encouraged by Inara to stand up for himself after he loses his virginity to her, as paid for by Higgins, orders the unlocking of the ship, and Serenity departs.",
    "title": "Jaynestown",
    "date": "October 18, 2002 (2002-10-18)",
    "directed_by": "Marita Grabiak",
    "season": "",
    "episode": "E07"
  },
  {
    "description": "\nAn explosion in the engine room leaves Serenity with the engine and the life support system and its backup all out of commission. With only a few hours of oxygen left, Mal has the crew leave in the two shuttles while he remains aboard and hopes to contact a passing ship. In a series of flashbacks, Mal convinces Zoe, Jayne, Inara, Hoban Washburne, and Kaylee Frye to join his crew. Back in the present, Mal is able to hail a ship and secure the part needed to fix the engine, though he is shot by another crew when they prove to have less than pure motives. Mal's crew returns to Serenity in time to save his life.",
    "title": "Out of Gas",
    "date": "October 25, 2002 (2002-10-25)",
    "directed_by": "David Solomon",
    "season": "",
    "episode": "E08"
  },
  {
    "description": "\nWhile waiting on the Core planet Ariel, Simon hires the crew to help him smuggle River into a local hospital for a thorough diagnostic. In return, he will tell them how to loot the hospital for valuable medicine. Once inside, Jayne attempts to turn in Simon and River for the reward. However, the Alliance officer arrests Jayne as well in order to keep the bounty for himself. The crew escapes, but Mal realizes that Jayne betrayed Simon and River. Mal arranges for Jayne to suffocate when Serenity leaves the planet's atmosphere, but then lets him live.",
    "title": "Ariel",
    "date": "November 15, 2002 (2002-11-15)",
    "directed_by": "Allan Kroeker",
    "season": "",
    "episode": "E09"
  },
  {
    "description": "\nAngry that Zoe and Mal have an unshakeable bond as war veterans, her husband Wash demands to take her place on a seemingly routine mission. Mal begrudgingly allows Wash to go along. They are captured by Niska, out to restore his reputation after they failed to complete the robbery he commissioned in \"The Train Job\". Zoe has only enough money to ransom one of them. She unhesitatingly chooses Wash. The crew band together to rescue Mal.",
    "title": "War Stories",
    "date": "December 6, 2002 (2002-12-06)",
    "directed_by": "James Contner",
    "season": "",
    "episode": "E10"
  },
  {
    "description": "\nWhen Saffron crosses paths with Mal again, she asks him to help her rob an extremely valuable antique weapon from a wealthy man. Once Mal and Saffron are inside, they are discovered, and it is revealed that the man is married to Saffron. Although the man seems initially oblivious, he is aware of Saffron's true nature and called the authorities. Mal and Saffron escape, but Saffron betrays Mal, stranding him naked in the desert, and tries to pick up the weapon.  However, Inara gets there first. She leaves Saffron locked up in a storage container for the authorities, and the crew escapes with the weapon.",
    "title": "Trash",
    "date": "July 21, 2003 (2003-07-21)",
    "directed_by": "Vern Gillum",
    "season": "",
    "episode": "E11"
  },
  {
    "description": "\nMal and Zoe receive in the mail the body of Tracey, a comrade-in-arms who fought with them at the Battle of Serenity Valley, and they attempt to honor his recorded wish to be returned home. However, a corrupt Alliance officer demands they turn over the body and the goods the soldier was smuggling. While searching the body for clues, they learn that Tracey is still alive and is smuggling organs. Tracey had double crossed his employers, but they killed his new buyer. Mal is ultimately forced to kill him to protect the crew, and Book blackmails the officer into leaving. Mal and Zoe take Tracey's body home to his family.",
    "title": "The Message",
    "date": "July 28, 2003 (2003-07-28)",
    "directed_by": "Tim Minear",
    "season": "",
    "episode": "E12"
  },
  {
    "description": "\nNandi, Inara's friend and a former Companion, asks her for help: she needs to defend her brothel from Ranse Burgess, a powerful man who impregnated Petaline, one of her employees. He is determined to take the baby once it is born. Mal and Nandi have sex the night before the battle; when Inara finds out, she is deeply hurt. The crew successfully defends the brothel, but Burgess kills Nandi before being captured. Petaline shows Burgess his newborn son, then shoots him. Afterward, Inara tells Mal that she has decided to leave the ship.",
    "title": "Heart of Gold",
    "date": "August 4, 2003 (2003-08-04)",
    "directed_by": "Thomas J. Wright",
    "season": "",
    "episode": "E13"
  },
  {
    "description": "\nRiver picks up a gun she finds in the cargo bay (which she sees as a tree branch), frightening the crew into wondering if she is too dangerous to be let loose. Bounty hunter Jubal Early sneaks aboard the ship in flight, incapacitates some of the crew and captures Simon. River agrees to go with Early in exchange for leaving her brother and the ship in peace. However, she orchestrates a plan to dispose of Early. Mal confirms her place as a member of the crew.",
    "title": "Objects in Space",
    "date": "December 13, 2002 (2002-12-13)",
    "directed_by": "Joss Whedon",
    "season": "",
    "episode": "E14"
  }
]