[
  {
    "description": "Rachel moves in with Monica, finding newfound independence after leaving her fiancé at the altar. Chandler and Joey console Ross after his divorce from Carol, his lesbian wife. Monica falls for a colleague and is crushed to learn their moment of passion was only a one night stand.",
    "title": "The Pilot",
    "date": "September 22, 1994 ",
    "episode": "E01",
    "season": "S01"
  },
  {
    "description": "Carol, Ross' lesbian ex-wife, tells him at work that she is pregnant with his child and, when he attends the sonogram, is stunned to learn that she wants to give the baby her and her lesbian lover's last names. Monica nearly has a breakdown from stressing when her and Ross' parents come for dinner. Ross and Rachel console each other, as she has to return her engagement ring to Barry and finds out that he and her maid of honor Mindy, went on her honeymoon.",
    "title": "The One with the Sonogram at the End",
    "date": "September 29, 1994 ",
    "episode": "E02",
    "season": ""
  },
  {
    "description": "Monica becomes irritated when everyone likes her new boyfriend Alan, more than she does. Chandler starts smoking again, and when the group complains, he diverts their attention to their own faults. Phoebe gets money put into her bank account that isn't hers, and when she complains, she gets more so she gives it to her homeless friend who buys her a can of soda, only to find a thumb in the can of soda. Phoebe uses the money from the soda company to pay Chandler to quit smoking.",
    "title": "The One with the Thumb",
    "date": "October 6, 1994 ",
    "episode": "E03",
    "season": ""
  },
  {
    "description": "Ross, upset about it being the anniversary of his first time sleeping with Carol, goes to a Rangers game with Chandler and Joey and gets hit in the face by a puck, and is taken to the hospital. There, Ross reveals Carol is the only woman he's ever slept with. Rachel gets her first paycheck but is angry that most of her money went to FICA, and also gets a visit from her old friends, which depresses her further about her new life. To cheer her up, Monica and Phoebe have a slumber party which isn't very fun due to Rachel's depressed state, until the girls spy on George Stephanopoulos, whose pizza was delivered to them by mistake, across the street.",
    "title": "The One with George Stephanopoulos",
    "date": "October 13, 1994 ",
    "episode": "E04",
    "season": ""
  },
  {
    "description": "Chandler and Phoebe decide to break up with Janice (Maggie Wheeler) and Tony at the same time, and Phoebe's goes well, but Chandler has a harder time requiring Phoebe's help. Ross arranges to do laundry with Monica and Rachel but Monica cancels, leaving just the two of them. Rachel reveals she's never done laundry before but Ross helps her stand up to a woman, and Ross gets his first kiss with Rachel. Joey wants to go out with his ex-girlfriend (Angela) who now has a boyfriend (Bob), so he arranges for Monica and him to double-date with them by leading Monica to believe that Angela and Bob are siblings and therefore Angela's actual boyfriend is Monica's date. This creates much confusion when Monica sees Angela and her \"brother\" being 'inappropriate,' but it eventually works out for Joey.",
    "title": "The One with the East German Laundry Detergent",
    "date": "October 20, 1994 ",
    "episode": "E05",
    "season": ""
  },
  {
    "description": "Everyone attends Joey's new musical where Chandler meets a beautiful and exotic Italian woman, Aurora (Sofia Milos), and asks her out. He finds out she is married and already has another boyfriend and is thrilled at the prospect of having \"all the fun and none of the responsibility\" in this polyamorous relationship. However, when she picks up another, he learns that it's not all it's cracked up to be and can't take it. Joey gets picked up at the musical by the 'Estelle Leonard Talent Agency,' which finally gets him a film role as a stand-in for Al Pacino's butt double. However, he loses the job because he overacts. Rachel cleans the apartment by herself for the first time, but she triggers Monica's obsessive tendencies when she moves furniture around.",
    "title": "The One with the Butt",
    "date": "October 27, 1994 ",
    "episode": "E06",
    "season": ""
  },
  {
    "description": "During a New York City-wide power outage, while the gang is hanging at Monica and Rachel's apartment, Ross tries to share his loving feelings with Rachel but is attacked by a cat. Rachel and Phoebe begin searching for the cat's owner, but when Mr. Heckles tries to claim the cat, he spooks it. The cat turns out to belong to Paolo, a dark, attractive Italian hunk who lives in the building and doesn't speak much English and Rachel falls for him immediately. Meanwhile, Chandler is trapped in an ATM vestibule with 'Victoria's Secret' model Jill Goodacre, and he desperately tries to impress her. (This episode was tied to the Mad About You season 3 episode Pandora's Box which depicted the cause of the city-wide blackout.)",
    "title": "The One with the Blackout",
    "date": "November 3, 1994 ",
    "episode": "E07",
    "season": ""
  },
  {
    "description": "Ross and Monica go to the bedside of their passed grandmother, who momentarily returns to life. Meanwhile, one of Chandler's colleagues tries to fix him up on a date with a man and Chandler finds out that a lot of people think he's gay when they first meet him, and he tries to find out why. The gang goes to Ross and Monica's Nana's funeral, where Monica confronts her mother about her critical attitude. Ross falls into an open grave and hurts his back, resulting in him getting a bit loopy on muscle relaxers.",
    "title": "The One Where Nana Dies Twice",
    "date": "November 10, 1994 ",
    "episode": "E08",
    "season": ""
  },
  {
    "description": "Ross finds out Susan talks to the unborn baby and decides he must too. Monica plans a lovely, quiet Thanksgiving feast for the gang in her apartment because Ross and Monica's parents are away, but her plans go awry. Phoebe joins them because she celebrates Thanksgiving with her grandmother in December. Joey poses for a health poster but later finds out he's become the V.D. poster boy, and so his family thinks he has V.D. and he joins them too. Chandler plans to boycott Thanksgiving because his parents announced their divorce on Thanksgiving when he was younger. The 'Underdog' balloon breaks free during the parade, and everyone goes to the roof to watch and get locked out of Monica's apartment meaning the dinner gets burned. Rachel had planned to go skiing in Vail with her family, but misses her flight home and joins them too. Everyone ends up eating Chandler's cheese sandwiches for dinner.",
    "title": "The One Where Underdog Gets Away",
    "date": "November 17, 1994 ",
    "episode": "E09",
    "season": ""
  },
  {
    "description": "Everyone makes a pact not to bring dates to their New Year's Eve party, but everyone breaks the no-date pact except Ross. While performing at Central Perk, Phoebe confronts some noisy scientist guys and ends up dating one of them, David (Hank Azaria), whom she brings to the party. Their relationship develops well until he gets offered a grant to go to Minsk and has to choose whether to stay with her or go for career making research. Monica invites 'Fun' Bobby, but he just lost his grandfather and cries all evening. Joey's date is a single mom, Sandy, whom he met whilst working as an elf in a department store and brings her children to the party, but ends up with David's friend. Rachel plans to bring Paulo who was supposed to fly in earlier than expected, but he misses his flight and Rachel gets into a fight at the airport. Chandler snaps and asks Janice to be his date, but he breaks up with her again. Ross arrives at the party bringing his new companion, a monkey named Marcel, who seems to take no interest in Ross at all. In the end, everyone ends up without a date and fulfilling the pact anyway. When Chandler complains he has no-one to kiss at midnight; Joey does the honors.",
    "title": "The One with the Monkey",
    "date": "December 15, 1994 ",
    "episode": "E10",
    "season": ""
  },
  {
    "description": "Chandler's flamboyant romance-novelist mother (Morgan Fairchild) comes to New York for a visit, and Joey catches Ross making the mistake of kissing her in a restaurant, after getting himself drunk when he sees Rachel bring Paolo. Monica and Phoebe see a guy they like in the street; when Monica shouts after him, the guy turns and is hit by a car. They fight for him while he is in a coma.",
    "title": "The One with Mrs. Bing",
    "date": "January 5, 1995 ",
    "episode": "E11",
    "season": ""
  },
  {
    "description": "Everyone knows the sex of Ross' baby except for Ross, who does not want to find out until it's born. Rachel's relationship with Paolo hits a snag when he makes a pass at Phoebe. Monica makes a dozen lasagnas for her aunt, only to discover that her aunt does not eat meat.",
    "title": "The One with the Dozen Lasagnas",
    "date": "January 12, 1995 ",
    "episode": "E12",
    "season": ""
  },
  {
    "description": "After Chandler accidentally sees Rachel wandering around topless after her shower, a chain reaction of nudity ensues when she tries to even the score by seeing him naked. She sees Joey naked, who then sees Monica naked, who then sees Joey's father naked. Joey finds himself playing parent when he has to decide whether to hide his father's affair from his mom. And no one can stand Phoebe's new boyfriend, an irritating psychologist named Roger (Fisher Stevens).",
    "title": "The One with the Boobies",
    "date": "January 19, 1995 ",
    "episode": "E13",
    "season": ""
  },
  {
    "description": "Ross' first date in nine years is on Valentine's Day with a beautiful neighbor. Carol and Susan, also out on a romantic date, end up at the same restaurant where Ross ends up kissing Carol. Joey sets Chandler up on a blind date with Janice, and they end up sleeping together. Chandler ends up breaking up with Janice on Valentine's Day. And Phoebe, Monica, and Rachel decide to spend the holiday burning mementos of their past boyfriends which cause a fire.",
    "title": "The One with the Candy Hearts",
    "date": "February 9, 1995 ",
    "episode": "E14",
    "season": ""
  },
  {
    "description": "Monica cooks a gourmet meal for a restaurateur named Steve (Jon Lovitz), who is looking for a new chef. Unfortunately, he's stoned and would just as well eat taco shells as her haute cuisine. After working as a data processing permanent temp for five years, Chandler gets promoted to data processing supervisor, then quits. He takes his job back when he is offered more money. Ross has a date with a beautiful colleague named Celia (Melora Hardin) and gives new meaning to the term \"spanking the monkey,\" when he brings her back to his place to meet Marcel. Celia is willing to have sex with him, but only if he talks dirty to her which he cannot do so, he asks Joey for help.",
    "title": "The One with the Stoned Guy",
    "date": "February 16, 1995 ",
    "episode": "E15",
    "season": ""
  },
  {
    "description": "\nJoey falls for Phoebe's twin sister, Ursula, making Phoebe feel neglected. Meanwhile, Chandler finds himself between a rock and a hard place, when he is told to fire an employee he is attracted to. Ross has doubts about parenthood when he attends Lamaze classes with Carol and Susan. Meanwhile, Monica tries to fix her TV after Marcel puts the TV on \"SAP\" function to Spanish, which she cannot turn off. After weeks of procrastinating, Rachel finally takes down the Christmas lights on their balcony, only to fall off the balcony and sprain her ankle.\n\nIn addition to Lisa Kudrow appearing as Ursula, Leila Kenzle and Helen Hunt guest star as Fran Devanow and Jamie Buchman from Mad About You.\n\n",
    "title": "The One with Two Parts: Part 1",
    "date": "February 23, 1995 ",
    "episode": "E16",
    "season": ""
  },
  {
    "description": "\nAt the hospital, Rachel, who has no health insurance, convinces Monica into trading identities with her so she can use Monica's coverage. The girls end up trying to date two cute doctors (George Clooney & Noah Wyle). Ursula dumps Joey but plans not to tell him, so Phoebe disguises herself as her twin sister to dump Joey and make sure he does not get hurt. Ross doubts that he will ever feel like a father. Marcel swallows Scrabble tiles, and Ross takes care of him making him feel like he would be a good father after that.\n\nA repeat of Seinfeld originally aired between both parts of this two-part episode.\n\n",
    "title": "The One with Two Parts: Part 2",
    "date": "February 23, 1995 ",
    "episode": "E17",
    "season": ""
  },
  {
    "description": "Tired of being referred to by customers as \"Excuse me,\" Rachel interviews for a job as an assistant buyer at Saks Fifth Avenue. She also sees another side of the usually docile Ross when the girls face the boys during a not-so-friendly game of poker after some help from Monica's aunt.",
    "title": "The One with All the Poker",
    "date": "March 2, 1995 ",
    "episode": "E18",
    "season": ""
  },
  {
    "description": "The gang searches frantically for Marcel, who slipped out of the apartment while Rachel was babysitting him. Rachel, who does not know that Marcel is an illegal pet, ends up calling Animal Safety. This annoys Ross. The woman who comes to take away Marcel turns out to be an old classmate of Rachel & Monica. After Marcel is found and safe, Ross finally gets up the courage to try to woo Rachel. But just when it looks like the two might actually spend a romantic evening alone together, Barry, Rachel's ex-fiance, barges into the apartment declaring his love for her.",
    "title": "The One Where the Monkey Gets Away",
    "date": "March 9, 1995 ",
    "episode": "E19",
    "season": ""
  },
  {
    "description": "Rachel and Barry start dating again, which is slightly awkward because he's now engaged to Mindy, who wants Rachel to be her maid of honor. But when Rachel finds out that Mindy and Barry had an affair while she was engaged to Barry, the two women decide to call Barry out on it. Meanwhile, Chandler goes nuts when a woman he likes won't return his phone calls. The friends become annoyed after they discover someone is spying on them from the building across the street.",
    "title": "The One with the Evil Orthodontist",
    "date": "April 6, 1995 ",
    "episode": "E20",
    "season": ""
  },
  {
    "description": "When Monica's credit card is stolen, she, along with Phoebe and Rachel, decide to catch the thief, but Monica begins a friendship with her. Joey enlists his friends to help him come up with a less ethnic-sounding stage name. And when Ross finds out that Marcel has reached sexual maturity and needs to be with other monkeys, he tries to get him accepted into the \"Harvard of zoos\". Joey and Chandler convey to Ross that San Diego zoo has accepted Marcel. Joey, Chandler, Phoebe, Rachel and Ross bid Marcel an emotional goodbye.",
    "title": "The One with the Fake Monica",
    "date": "April 27, 1995 ",
    "episode": "E21",
    "season": ""
  },
  {
    "description": "After losing his virginity to her, Monica's boyfriend Ethan reveals that he's a high school senior, not a college senior. Rachel has erotic dreams about Joey and Chandler, making Ross both disgusted and envious. And when Phoebe temps as Chandler's secretary, she finds out that no one at work likes him anymore.",
    "title": "The One with the Ick Factor",
    "date": "May 4, 1995 ",
    "episode": "E22",
    "season": ""
  },
  {
    "description": "Carol goes into labor, prompting Monica to begin thinking about having a baby of her own. Carol is about to give birth to the baby. As Ross and Susan cannot stop bickering over who gets to help Carol more, Phoebe drags both of them into a small room to settle their differences – but all three end up getting locked in. Rachel flirts with an OB/GYN who has a love-hate relationship with women's private parts due to seeing them every day at work. Joey ends up assisting birth for a single mother (played by Leah Remini). The newborn baby is named Ben, derived from the janitor's shirt in the small room in which Ross, Susan, and Phoebe were locked in.",
    "title": "The One with the Birth",
    "date": "May 11, 1995 ",
    "episode": "E23",
    "season": ""
  },
  {
    "description": "Ross has to go to China for a fossil dig before Rachel's birthday. Chandler tells Ross to find another girl and get over Rachel. Ross tells Chandler to give Rachel his present, and then leaves. Joey's new girlfriend, Melanie (Corinne Bohrer) wants to go to bed with him, but Joey's participation in a fertility study is preventing this. During Rachel's birthday party, Chandler accidentally lets it slip that Ross is in love with her, and a big decision presents itself.",
    "title": "The One Where Rachel Finds Out",
    "date": "May 18, 1995 ",
    "episode": "E24",
    "season": ""
  },
  {
    "description": "Rachel decides to tell Ross that she loves him and waits for him at the airport, not knowing he is returning with a new girlfriend named Julie (Lauren Tom) thanks to Chandler's advice. Chandler feels guilty because he told Rachel that Ross loves her after he had advised Ross to get over his feelings for her. Joey and Chandler get their hair cut by Phoebe, and Monica wants her hair cut too, but Phoebe gives her an awful haircut. Chandler needs a suit, so Joey takes him to his tailor, who touches Chandler inappropriately. Chandler tells Joey of this, but Joey insists that is how pants are measured. Ross annoys everyone by talking about Julie, and Rachel becomes so desperate and upset that she spends the night with her old lover, Paolo.",
    "title": "The One with Ross's New Girlfriend",
    "date": "September 21, 1995 ",
    "episode": "E01",
    "season": "S02"
  },
  {
    "description": "The guys are uncomfortable with Carol breastfeeding Ben, and the situation is made worse by Joey and Phoebe tasting it. Rachel is uncomfortable with Monica's growing friendship with Julie. At his day job, Joey competes with a fellow cologne spritzer for the affection of a beautiful colleague (Emily Procter).",
    "title": "The One with the Breast Milk",
    "date": "September 28, 1995 ",
    "episode": "E02",
    "season": ""
  },
  {
    "description": "Chandler refuses a date with a woman from work, claiming that it is because her nostrils are too big, but truthfully he is trying to escape a potentially serious relationship. Rachel and Monica's downstairs neighbour Mr. Heckles dies. Mr. Heckles leaves all his belongings to Monica and Rachel, addressing them as the noisy neighbours. Chandler discovers eerie similarities between his life and the life of Mr.Heckles. Ross and Phoebe argue with each other over the legitimacy of the theory of evolution. Chandler does not want to end up alone like Mr. Heckles, and thus he makes a phone call to Janice in hopes of rekindling their relationship, only to learn that she is married with a baby on the way.",
    "title": "The One Where Heckles Dies",
    "date": "October 5, 1995 ",
    "episode": "E03",
    "season": ""
  },
  {
    "description": "The gang is amazed to learn that Phoebe married a gay Canadian ice dancer Duncan (Steve Zahn) to help him get his green card. Phoebe thinks that she still cares for him, but then he shows up asking for a divorce as he lied to himself about being gay and wants to marry someone else. Interesting facts are revealed about the others, too: Joey starred in a porn film and Chandler has a third nipple. Ross seeks relationship advice from Rachel after revealing that he and Julie have yet to consummate their relationship. Rachel, because she still loves Ross, gives him bad advice, hoping that he and Julie will break up as a result. Unfortunately for Rachel, Joey also gives Ross advice.",
    "title": "The One with Phoebe's Husband",
    "date": "October 12, 1995 ",
    "episode": "E04",
    "season": ""
  },
  {
    "description": "When a sexy woman calls the wrong number, Chandler seeks to make the most of the situation. Income issues divide the friends: the well-off Ross, Chandler and Monica versus the not-so-well-off Phoebe, Rachel and Joey. Monica loses her job after accepting \"gifts\" from her restaurant's meat supplier.",
    "title": "The One with Five Steaks and an Eggplant",
    "date": "October 19, 1995 ",
    "episode": "E05",
    "season": ""
  },
  {
    "description": "When Ross has an allergic reaction to Monica's kiwi-lime pie, Chandler and Joey are asked to baby-sit Ross's son, Ben. While using Ben to help them try to pick up girls, they accidentally leave him on a bus. Although they later locate him, they are not sure the baby is really Ben. Phoebe loses her Central Perk singing gig to a professional singer (Chrissie Hynde), and she becomes a street singer in front of the café.\nLea Thompson from Caroline in the City makes an appearance, not as her character Caroline but as a woman with a gay brother interested in where Joey and Chandler adopted Ben. Also, Giovanni Ribisi, who in later episodes portrays Frank Buffay Jr., appears in this episode as a stranger who dropped a condom in Phoebe's guitar case and comes back to get it for \"an emergency.\" The personality of this character is rather similar to Frank Jr's; though not confirmed, they are possibly the same person. Catherine Bell also appears as Robin, one of the girls in the bus.",
    "title": "The One with the Baby on the Bus",
    "date": "November 2, 1995 ",
    "episode": "E06",
    "season": ""
  },
  {
    "description": "A drunken Rachel is persuaded to call Ross and reveals her feelings for him on his answering machine. When he finds out, he must make the choice between her and Julie. Meanwhile, Monica finds work as Chandler's personal trainer and Phoebe has a hard time trying to get her boyfriend to have sex with her. She seeks Joey's advice. Ross and Rachel argue, and Ross says that he is not leaving Julie. At the end of the episode Ross and Rachel kiss.",
    "title": "The One Where Ross Finds Out",
    "date": "November 9, 1995 ",
    "episode": "E07",
    "season": ""
  },
  {
    "description": "Ross is still compelled to make a choice between his childhood crush Rachel and his current lover Julie, and enlists Joey and Chandler's help in making a list of the pros and cons of each. He chooses Rachel, but she finds the list and gets angry with Ross. Meanwhile, Monica gets a job making food with a disgusting synthetic chocolate substitute called Mockolate.",
    "title": "The One with the List",
    "date": "November 16, 1995 ",
    "episode": "E08",
    "season": ""
  },
  {
    "description": "It's Christmas time and Monica tries tipping with cookies, rather than cash, with mixed results. Phoebe learns that the guy in the pictures her grandmother keeps around is not her father but the Macy's photo frame model. She tries to track down her real father, but in the end she feels that she is not ready to meet him. Chandler and Joey wait too late to shop for presents, and are forced to buy gifts from a gas station. Ross asks Rachel to make a list about him, but he is offended when she calls him obsessive.",
    "title": "The One with Phoebe's Dad",
    "date": "December 14, 1995 ",
    "episode": "E09",
    "season": ""
  },
  {
    "description": "Monica gets back together with Fun Bobby, who has a drinking problem. She successfully helps him give up drinking, but then he is unhappy and not fun anymore. Joey gets chosen to play the role of Dr. Drake Ramoray, a neurosurgeon on Days of Our Lives after he sleeps with the casting lady. Rachel begins dating a guy named Russ, who bears an uncanny resemblance to Ross (both roles were played by David Schwimmer, yet Russ is credited as being played by \"Snaro\", a pseudonym of Schwimmer's and a tribute to a friend). Eventually, Rachel dumps Russ, telling him he reminds her of someone, though she doesn't tell him about his resemblance to Ross. In the end, Russ and Julie (Lauren Tom) fall in love at first sight.",
    "title": "The One with Russ",
    "date": "January 4, 1996 ",
    "episode": "E10",
    "season": ""
  },
  {
    "description": "Carol and Susan get married, providing Monica with a job: catering the wedding. Phoebe is possessed by the spirit of an eighty-two-year-old massage client who dies in the middle of a session. Rachel's mother (Marlo Thomas) comes to visit and announces that she has decided to divorce Rachel's father.",
    "title": "The One with the Lesbian Wedding",
    "date": "January 18, 1996 ",
    "episode": "E11",
    "season": ""
  },
  {
    "description": "Ross goes to visit Marcel while on a trip to California, and finds that the monkey is working in commercials. Joey gets his first fan letter and ends up dating the woman (Brooke Shields) who sent it. She turns out to be a mentally ill stalker who thinks that the happenings on Days of Our Lives are real. Phoebe is asked by a man (Chris Isaak) to sing for the children at a library, but their parents are horrified by her morbid lyrics. However, the kids like the songs and come to the café to listen to her.\n\nRachel and Monica compete for the affections of Jean-Claude Van Damme after meeting him on a movie set. Chandler meets a former schoolmate (Julia Roberts), a makeup artist, who seems to be attracted to him but it turns out that Chandler once embarrassed her and she just wants to get revenge. An excited Joey gets a role as an extra in the movie, and Ross and Marcel go on a whirlwind tour of the city.",
    "title": "The One After the Superbowl",
    "date": "January 28, 1996 ",
    "episode": "E12",
    "season": ""
  },
  {
    "description": "\nAfter getting his big break with Days of Our Lives, Joey pays Chandler back with $812 and an extremely tacky engraved gold bracelet. Also, an unemployed Monica is hard up for money. A home video from Monica and Rachel's prom night reveals that Monica was previously overweight, and that Rachel had a large nose. Rachel seemed to have been stood up by her prom date, so Ross puts on his father's tuxedo to take her to prom himself, but Rachel's date shows up and they leave before she learns of Ross's plans. The video then shows a speechless and devastated Ross standing at the top of the stairs. The candor of Ross's heartbreak compels Rachel to kiss Ross.\nIn 1997, TV Guide ranked this episode at #100 of its list of the 100 Greatest Episodes.",
    "title": "The One with the Prom Video",
    "date": "February 1, 1996 ",
    "episode": "E13",
    "season": ""
  },
  {
    "description": "\nJoey buys a big screen TV and two leather recliners with his newfound money, resulting in him and Chandler spending two days watching TV and never getting out of the chairs. Monica has a catering job for an ophthalmologist and a friend of her parents, the attractive Dr. Richard Burke (Tom Selleck), and later they go on a date. Ross and Rachel attempt to have their first real date, but it's difficult for Rachel to overcome their long friendship. As they tried to schedule another date, Ross has an emergency at the museum and ends up having sex with Rachel for the first time.\nThe episode introduces Tom Selleck in a recurring guest role that led to an Emmy Award nomination for Outstanding Guest Actor in a Comedy Series in 2000.",
    "title": "The One Where Ross and Rachel ... You Know",
    "date": "February 8, 1996 ",
    "episode": "E14",
    "season": ""
  },
  {
    "description": "Joey thinks he needs to move out of Chandler's apartment and wants to get a new one to 'give him time to think'. Monica struggles to tell her parents about her relationship with Richard. Rachel and Phoebe want to get a tattoo. Phoebe chickens out and Rachel gets a heart.",
    "title": "The One Where Joey Moves Out",
    "date": "February 15, 1996 ",
    "episode": "E15",
    "season": ""
  },
  {
    "description": "Phoebe is discovered by a record producer who wants to make her song \"Smelly Cat\" a video, but who secretly dubs in the voice of a more talented (but less attractive) woman. Ross's new relationship with Rachel makes Monica feel like she's living with her brother again... and she hates it. Joey is finding living alone is not really for him, and wants to move back in with Chandler. However Chandler, having been led to believe Joey wouldn't want to come back, already has a new roommate Eddie. However Chandler finds that he doesn't really click with Eddie (who won't play foosball and doesn't like Baywatch) as well as he did with Joey, and quickly begins to miss Joey too.",
    "title": "The One Where Eddie Moves In",
    "date": "February 22, 1996 ",
    "episode": "E16",
    "season": ""
  },
  {
    "description": "Joey's good fortune comes crashing down when he foolishly claims in an interview that he writes his own lines, leading to his character falling down an elevator shaft. Phoebe helps Chandler bond with his new roommate...to Chandler's horror. And sexual history dominates the discussion between two couples—Monica and Richard, and Ross and Rachel.",
    "title": "The One Where Dr. Ramoray Dies",
    "date": "March 21, 1996 ",
    "episode": "E17",
    "season": ""
  },
  {
    "description": "Creeped out by his bizarre new roommate, Eddie, Chandler demands that he move out. Eddie agrees, but doesn't move out — nor does he even remember the conversation, as he is obviously mentally ill, imagining he and Chandler took a trip to Las Vegas and believing it to have really happened. Joey has trouble coming to grips with the death of Dr. Ramoray and the accompanying change in his lifestyle. And a new book on empowerment for women inspires the female friends to have a \"goddess meeting.\" Joey moves back in with Chandler, they kick out Eddie (by convincing him he never lived there in the first place) and they make up with each other.",
    "title": "The One Where Eddie Won't Go",
    "date": "March 28, 1996 ",
    "episode": "E18",
    "season": ""
  },
  {
    "description": "Phoebe's world view is shattered when she learns how Old Yeller really ends. She watches all the films her mother didn't let her watch and becomes depressed. Monica becomes jealous when Richard begins hanging out with other people: namely, Joey and Chandler. However, this is short lived as Joey and Chandler confess to thinking of Richard as a fatherly figure, when Richard was under the impression that they were just buddies. Rachel becomes stressed out when she learns that Ross has planned their whole life together.",
    "title": "The One Where Old Yeller Dies",
    "date": "April 4, 1996 ",
    "episode": "E19",
    "season": ""
  },
  {
    "description": "Chandler and Ross run into two bullies at the coffee shop, one of whom steals Chandler's hat. Monica, down to her last few dollars of savings, plays the stock market based solely on the ticker symbols to avoid taking a job at a tacky 1950s themed diner. Phoebe makes multiple attempts to visit her birth father, but instead she meets her half-brother, Frank Buffay Jr., and learns that her father hasn't been home for four years. Monica eventually loses her savings due to her unwise investments, and is forced to work at the Moondance Diner, dressed in a ridiculous costume and dancing on the counter to songs by The Village People.",
    "title": "The One with the Bullies",
    "date": "April 25, 1996 ",
    "episode": "E20",
    "season": ""
  },
  {
    "description": "Rachel's birthday is coming up, and Monica is planning a classy party for her and it is decided not to invite her father as her mother Sandra is already coming and the two are at a point in their divorce when they can't stand to be in the same room as each other. However, when Rachel's dad turns up unexpectedly, another impromptu party is set up at Chandler and Joey's for Dr. Green to attend to keep him away from his estranged wife. Things quickly start to go wrong when Sandra worries after seeing Ross fetching things for Dr. Green and believes her daughter is dating a man who reminds her of her father, while the guests at Monica's party quickly tire of the host sucking the fun out of the event with her dull games and strict rules and begin fleeing to Joey and Chandler's more laidback party instead. In the end, despite a few close calls, the six successfully manage to get the couple out of both parties without bumping into each other.",
    "title": "The One with the Two Parties",
    "date": "May 2, 1996 ",
    "episode": "E21",
    "season": ""
  },
  {
    "description": "Phoebe catches chicken pox just as her old flame Ryan (Charlie Sheen) arrives in town on leave from the Navy. Even though he hasn't yet had chicken pox, he can't stand to be apart and they both spend the rest of the time sick and trying to not scratch at the sores. Joey gets a job at Chandler's office but decides to play it as a role. The character he creates, Joseph, has a wife and kids and ultimately blames Chandler for his own screw ups. Monica is upset that Richard doesn't have a \"thing\": an unexplainable quirk. He eventually comes up with one to ease her mind.",
    "title": "The One with the Chicken Pox",
    "date": "May 9, 1996 ",
    "episode": "E22",
    "season": ""
  },
  {
    "description": "Rachel agrees to be maid of honor at her ex-fiancé's wedding, but a fashion faux pas focuses attention away from the bride. To get a role in Warren Beatty's new movie, Joey needs to practice kissing guys. Monica ponders her future with Richard and Chandler falls for a mystery woman on the Internet who turns out to be his ex-girlfriend, Janice. Richard doesn't want to have children, but Monica does, so she breaks up with him.",
    "title": "The One with Barry and Mindy's Wedding",
    "date": "May 16, 1996 ",
    "episode": "E23",
    "season": ""
  },
  {
    "description": "Ross reveals his sexual fantasy to Rachel, which involves her being dressed up in Princess Leia's bikini from Star Wars. Monica suffers from insomnia after her breakup with Richard. And Chandler, willingly back together with Janice, wants Joey to bond with her.",
    "title": "The One with the Princess Leia Fantasy",
    "date": "September 19, 1996 ",
    "episode": "E01",
    "season": "S03"
  },
  {
    "description": "Ross is in a hurry to get everyone dressed for an important banquet at the museum but everyone keeps delaying. Monica freaks when she hears an answer phone message from Richard, and Joey and Chandler fight over a chair.",
    "title": "The One Where No One's Ready",
    "date": "September 26, 1996 ",
    "episode": "E02",
    "season": ""
  },
  {
    "description": "\nPhoebe is stalked by a man who mistakes her for her twin sister. Ross and Rachel give Chandler \"boyfriend\" lessons. Monica uses her free time after breaking up with Richard to make jam and considers artificial insemination through a sperm bank.\nGuest star: David Arquette",
    "title": "The One with the Jam",
    "date": "October 3, 1996 ",
    "episode": "E03",
    "season": ""
  },
  {
    "description": "Phoebe pretends to be Joey's agent and has some success in getting him auditions, however the initial rush soon wears off when she is forced to tell him why he isn't getting any parts. Ross is upset when Ben brings a Barbie doll on his weekend visit. Chandler is advancing in his relationship with Janice and, realizing that he has a fear of commitment, goes to the girls for advice.",
    "title": "The One with the Metaphorical Tunnel",
    "date": "October 10, 1996 ",
    "episode": "E04",
    "season": ""
  },
  {
    "description": "Phoebe's half-brother visits and she offers to give him a massage, but they have trouble bonding. Joey attempts to build an entertainment center. Ross is challenged to name the five celebrities he'd like to sleep with most. Guest star Isabella Rossellini.",
    "title": "The One with Frank Jr.",
    "date": "October 17, 1996 ",
    "episode": "E05",
    "season": ""
  },
  {
    "description": "When Janice asks the gang if any of them have ever slept together, the friends flash back to a time three years before, where some dark secrets are revealed among each other, that Ross kissed Phoebe, Joey got naked in front of Monica, and Chandler and Rachel both wanted to have sex with each other (but didn't).",
    "title": "The One with the Flashback",
    "date": "October 31, 1996 ",
    "episode": "E06",
    "season": ""
  },
  {
    "description": "When Monica buys a new bed from Janice's soon-to-be-ex-husband, \"The Mattress King\", the wrong one is delivered. When she and Joey try to take it back, Joey sees Janice and The Mattress King in his office, kissing. Rachel tries to have her father and Ross bond by going to dinner but when Rachel's abrasive father tips only 4%, Ross adds 20 dollars to it and Rachel's father thinks that Ross thinks he is cheap. Rachel sets up a brunch the day after but things go wrong when both men bond by criticizing her. Joey gets a job teaching a soap opera acting class when a student gets the same audition as Joey, forcing Joey to make a desperate decision.",
    "title": "The One with the Race Car Bed",
    "date": "November 7, 1996 ",
    "episode": "E07",
    "season": ""
  },
  {
    "description": "When Chandler is about to buy Janice an expensive gift, Joey tells him that he saw Janice kissing her ex-husband. Meanwhile, Monica accidentally bumps Ben's head into a post. Phoebe is convinced that she is cursed because every time she goes to the dentist, someone around her dies, and a toothache is forcing her to make another visit. After returning, she frantically tries to figure out who must have died. Everyone is accounted for until Joey notices that Ugly Naked Guy isn't moving. In an attempt to see if he's dead or just sleeping, they tape together chopsticks to make a long stick with which they poke him through his window from the balcony and they confirm he's still alive.",
    "title": "The One with the Giant Poking Device",
    "date": "November 14, 1996 ",
    "episode": "E08",
    "season": ""
  },
  {
    "description": "Emotions become the feast of the day when the gang plays a game of touch football on Thanksgiving when Ross and Monica's competitive streaks flare up while Joey and Chandler argue over who gets to date a Dutch model that is watching the game.",
    "title": "The One with the Football",
    "date": "November 21, 1996 ",
    "episode": "E09",
    "season": ""
  },
  {
    "description": "Rachel is tired of serving coffee and wants a career in fashion, but isn't sure what to do about it. Chandler advises her that she needs \"the fear\" of being unemployed to focus her on finding a new career. With that, Rachel promptly quits Central Perk but soon discovers that finding a new job is easier said than done and is left without any leads on her last day. Phoebe tries to help Joey when he gets a job selling Christmas trees. Ross accidentally breaks a girl's leg, and attempts to make it up to her by helping her sell cookies to win a trip to Space Camp.",
    "title": "The One Where Rachel Quits",
    "date": "December 12, 1996 ",
    "episode": "E10",
    "season": ""
  },
  {
    "description": "Rachel is angry that her new job at Fortunata Fashions involves nothing more than serving coffee, which she had hoped to never do again. While venting her frustration to Monica she bumps into Mark, an employee of Bloomingdale's who knows of a vacancy in his department. He gets her an interview and coaches her through it, however Ross is suspicious of Mark's motives and is left unhappy when Rachel lands the job since she'll be working directly alongside him. A drunken Chandler fools around with one of Joey's sisters, but can't remember which one.",
    "title": "The One Where Chandler Can't Remember Which Sister",
    "date": "January 9, 1997 ",
    "episode": "E11",
    "season": ""
  },
  {
    "description": "Ross is jealous of Mark, thinking he is trying to steal Rachel away causing him to shower Rachel with romantic gifts at her workplace. Joey's numerous lies on his resume catch up to him, as he is forced to teach a very hard dance to an entire Broadway cast. Monica dates Julio, a busboy from the diner who writes a poem for her called 'The Empty Vase'. Touched, Monica sleeps with him but is then told by Phoebe that the poem is referring to her, and uses an a capella group to get revenge.",
    "title": "The One with All the Jealousy",
    "date": "January 16, 1997 ",
    "episode": "E12",
    "season": ""
  },
  {
    "description": "Monica's will power is tested when she runs into Richard at the video store. The two decide to be just 'friends', but quickly start sleeping together again. Joey agrees to read Little Women while Rachel agrees to read The Shining. Phoebe's athletic date has a problem with short shorts—he is \"coming out\" and \"hanging brain\".",
    "title": "The One Where Monica and Richard are Just Friends",
    "date": "January 30, 1997 ",
    "episode": "E13",
    "season": ""
  },
  {
    "description": "Phoebe is reunited with her former singing partner (Elizabeth Daily), who thinks \"Smelly Cat\" has hit potential. Chandler dates a woman with a prosthetic leg (Sherilyn Fenn). Ross, who is getting sick of Rachel's long work hours, is happy to learn that Mark is leaving Bloomingdale's, just to discover Rachel is still friends with him and are planning to attend a fashion seminar together. In order to make sure Mark can't go, Ross accompanies her instead but then quickly falls asleep which causes a fresh argument and leaves the relationship on very rocky ground.",
    "title": "The One with Phoebe's Ex-Partner",
    "date": "February 6, 1997 ",
    "episode": "E14",
    "season": ""
  },
  {
    "description": "Chandler and Joey ponder a possible threesome with Chloe (Angela Featherstone), \"the hot girl from the copy place, with the belly button ring\". Phoebe, after giving free massages \"to promote world peace\" in front of the UN building, dates an eastern Europe diplomat who needs an interpreter to communicate with her. Ross and Rachel's relationship continues to deteriorate when she is forced to work on their one-year anniversary, and Ross' attempt to bring the celebration to her only to find she hasn't the time or the patience to deal with him, leads to a bitter argument and Rachel deciding the two need to go on a 'break'. Upset, Ross goes drinking with Joey, Chandler and Chloe where he decides to make up with Rachel and calls her. When he hears Mark's voice in the background, Ross assumes the worst and ends up in the arms of Chloe.",
    "title": "The One Where Ross and Rachel Take a Break",
    "date": "February 13, 1997 ",
    "episode": "E15",
    "season": ""
  },
  {
    "description": "Ross wakes up the next morning full of regret after sleeping with Chloe, and is forced to hide her when Rachel visits him hoping to make up. Although he is initially successful at keeping his actions secret, he is exposed when the information makes its way to Gunther who tells Rachel the whole story. The two go back to her apartment and have a huge fight, as the other four friends are trapped in Monica's bedroom, forced to listen in. The argument lasts for hours, and although Ross is desperate for forgiveness Rachel refuses and ends the relationship completely, with both Ross and Rachel both devastated and completely heartbroken.",
    "title": "The One with the Morning After",
    "date": "February 20, 1997 ",
    "episode": "E16",
    "season": ""
  },
  {
    "description": "Ross and Rachel can no longer be in the same room as each other without arguing over who is to blame for their relationship ending, forcing the rest of the group to divide their time between them. When a lonely Ross is excluded from Rachel's ski trip with her pals, he visits Carol desperate for sympathy and tells her an embellished version of the break-up. The group's car breaks down and they end up calling Ross for help, and when he and Rachel begin fighting again Phoebe lays down the law: they have to be civil to each other or it's the end of everyone's shared friendships. They agree, and Ross politely declines going skiing and drives back to the city by himself. Meanwhile Chandler, reminded of his parents breaking-up, starts smoking again.",
    "title": "The One Without the Ski Trip",
    "date": "March 6, 1997 ",
    "episode": "E17",
    "season": ""
  },
  {
    "description": "A desperate Monica agrees to a date with one of her restaurant customers, who turns out to be very well off (Pete, played by Jon Favreau). Phoebe freaks when she finds out that her 18-year-old brother is planning to wed a woman more than twice his age (Debra Jo Rupp). Chandler uses a hypnosis tape to quit smoking, but it is meant for women, which causes Chandler to act feminine.",
    "title": "The One with the Hypnosis Tape",
    "date": "March 13, 1997 ",
    "episode": "E18",
    "season": ""
  },
  {
    "description": "Rachel goes on her first date after splitting from Ross, with Mark from her office. Joey develops a crush on Kate (Dina Meyer), his costar in his new play. Monica continues to date Pete, even though she is still not attracted to him.",
    "title": "The One with the Tiny T-Shirt",
    "date": "March 27, 1997 ",
    "episode": "E19",
    "season": ""
  },
  {
    "description": "Rachel regrets making a date for Chandler and her boss, Joanna. Joey's interest in Kate intensifies after they sleep together. Monica's aunt dies, leaving her a beautiful antique dollhouse, but it's too elaborate to play with, so Phoebe makes her own dollhouse, but it meets a sad end.",
    "title": "The One with the Dollhouse",
    "date": "April 3, 1997 ",
    "episode": "E20",
    "season": ""
  },
  {
    "description": "Monica considers a dream job in Pete's new restaurant, but Phoebe senses there is more to the deal. Joey and Chandler adopt a baby chick and a duck. Ross misses a panel for the Discovery Channel to help Rachel, who may have a broken rib, and she is amazed (and impressed) when she learns what he gave up to help her.",
    "title": "The One with a Chick and a Duck",
    "date": "April 17, 1997 ",
    "episode": "E21",
    "season": ""
  },
  {
    "description": "Rachel dates a man (Ben Stiller) who turns out to be an aggressive, testosterone-fuelled bully who frightens and intimidates anyone who irritates him by viciously screaming at them, but for a long time the only one who is subjected to this is Ross and everyone thinks he's just jealous because the guy's dating Rachel. Joey and Kate break up when she gets a big job in Los Angeles and takes it. Phoebe is on hold for days with a company she needs to talk to before her phone warranty expires.",
    "title": "The One with the Screamer",
    "date": "April 24, 1997 ",
    "episode": "E22",
    "season": ""
  },
  {
    "description": "Afflicted with a mysterious skin condition on his back, Ross seeks advice from Phoebe's herbalist (Kevin McDonald). Phoebe can't choose between dating a fireman or a Kindergarten teacher and attempts to date both, which is a problem when the fireman turns out to also be smart and the teacher turns out to be a hunk. Monica can't decide what to do about Pete when she thinks he is going to break up with her because Pete says when he gets back from Atlanta they \"need to talk\". To Monica's mix of relief and shock, Pete wants to tell her that he's now going to pursue full-time his dream of being an Ultimate Fighting champion.",
    "title": "The One with Ross's Thing",
    "date": "May 1, 1997 ",
    "episode": "E23",
    "season": ""
  },
  {
    "description": "Monica tries to be supportive of Pete's UFC dreams, but the brutal losing beatings he sustains leads her to tell him she can't stay with him if he keeps going because he's going to end up crippled or dead. Chandler has a problem when his new boss keeps slapping him on the butt. Phoebe sets Ross up on a date with a gorgeous woman who used to be bald. This episode features a cameo skit by Billy Crystal and Robin Williams because their 1997 flop film \"Father's Day\" was released in theatres the day after it aired.",
    "title": "The One with the Ultimate Fighting Champion",
    "date": "May 8, 1997 ",
    "episode": "E24",
    "season": ""
  },
  {
    "description": "The gang goes to the beach. In search of a woman who was friends with her mom, Phoebe meets the woman (who is also named Phoebe) with links to her family's past, who may know more than she's letting on. Ross discovers that Rachel still loves him, and must choose between sex-crazy, but newly bald (thanks to some subversive advice from Rachel) Bonnie (Christine Taylor), and Rachel, the love of his life.",
    "title": "The One at the Beach",
    "date": "May 15, 1997 ",
    "episode": "E25",
    "season": ""
  },
  {
    "description": "During a trip to the beach, Monica, accompanied by Joey and Chandler, is stung by a jellyfish; the only remedy they can think of is for someone to pee on the sting. Chandler complies. Ross and Rachel get back together until Ross cannot stand Rachel thinking he has taken full responsibility for the flaws in their relationship. Phoebe gets to know her birth mother.",
    "title": "The One with the Jellyfish",
    "date": "September 25, 1997 ",
    "episode": "E01",
    "season": "S04"
  },
  {
    "description": "A cat enters the coffee house and sniffs around Phoebe's guitar case. When Phoebe picks the cat up, she believes that her dead mother's spirit is inside it. Joey tries to sell his entertainment unit and when showing a customer that it is big enough to fit a grown man, the customer puts a hockey stick through the handles, locking Joey in and steals everything in his and Chandler's apartment. Monica dates Chip Matthews (Rachel's ex-boyfriend), the most popular boy from her high school, but dumps him after she realizes he is an immature loser who still lives with his parents.",
    "title": "The One with the Cat",
    "date": "October 2, 1997 ",
    "episode": "E02",
    "season": ""
  },
  {
    "description": "Chandler dates Rachel's boss, Joanna, again and finally breaks up with her after she handcuffs him to her office chair. Rachel then comes to Chandler's rescue, with doubts as she realizes she could get fired for going into her boss's office. Monica caters a party for her mother, but while preparing the food she loses a fake finger nail in the quiche, ruining her plans to impress her critical mother. A salesman (Penn Jillette) comes to Chandler and Joey's apartment selling Encyclopedias and starts teaching Joey things from the books.",
    "title": "The One with the Cuffs",
    "date": "October 9, 1997 ",
    "episode": "E03",
    "season": ""
  },
  {
    "description": "Joey helps the apartment supervisor Treeger with his ballroom dancing skills in order to help Monica and Rachel keep their illegal apartment. Chandler wants to quit the gym, but can't because of the attractive staff. Ross, originally to help Chandler quit, ends up with a gym membership when they leave. Their later plan is to cut the gym from their financial source, so they attempt to quit their bank but because of the attractive female staff there, they end up with a joint-checking account. Phoebe, on the other hand, has a crush on her client but is forbidden to do so because he is her client. This led to her being fired.",
    "title": "The One with the Ballroom Dancing",
    "date": "October 16, 1997 ",
    "episode": "E04",
    "season": ""
  },
  {
    "description": "Chandler starts to fall in love with Joey's new girlfriend, Kathy, after he flirted with her in the coffee house, unaware Joey was dating her. Rachel becomes jealous of Ross's relationship and ends up dating a college student, who turns out to be stealing from her. Phoebe's voice becomes stuffy after she catches a cold, which gives her a new sexy voice for singing and finds that she likes her \"new\" singing voice better.",
    "title": "The One with Joey's New Girlfriend",
    "date": "October 30, 1997 ",
    "episode": "E05",
    "season": ""
  },
  {
    "description": "Ross' new girlfriend (Rebecca Romijn) seems nearly perfect until he discovers that her apartment is incredibly dirty. Chandler buys Kathy a first edition of her favorite children's book for her birthday. He tries to help Joey (then dating Kathy) buy a present that is comparable to his own, but Joey only ends up purchasing something very meaningless and inexpensive. Phoebe and Monica decide to become partners in a catering business.",
    "title": "The One with the Dirty Girl",
    "date": "November 6, 1997 ",
    "episode": "E06",
    "season": ""
  },
  {
    "description": "Chandler must decide between the girl of his dreams, Kathy, and his best friend Joey when he and Kathy share a secret and secluded passionate kiss. Chandler, feeling guilty about his kiss with Kathy, buys new furniture and appliances for his and Joey's apartment to fill in the empty spaces left after the robbery. When Joey finds out about the kiss, he attempts to punish Chandler for five years. Ross starts playing the keyboard again for the first time since college and reinvents his musical art (or as Ross calls them, \"wordless sound poems\").",
    "title": "The One Where Chandler Crosses the Line",
    "date": "November 13, 1997 ",
    "episode": "E07",
    "season": ""
  },
  {
    "description": "Chandler agrees to spend Thanksgiving in a shipping crate as a punishment from Joey for kissing Kathy. After Monica accidentally gets ice in her eye, she visits her new eye doctor, who turns out to be out of town, and is seen by Richard's son (Michael Vartan). She then invites him over for Thanksgiving, which the others do not approve of. After Kathy visits and breaks up with Chandler due to not wanting to break up a friendship, Joey forgives Chandler and tells him to go after her before she leaves.",
    "title": "The One with Chandler in a Box",
    "date": "November 20, 1997 ",
    "episode": "E08",
    "season": ""
  },
  {
    "description": "Chandler and Ross's friend \"Gandalf\" is planning to come to town. They are very excited until he cancels. When they're forced to try to have a fun time on their own, they're forced to realize that they're becoming older and no longer enjoy the party scene. Monica has to choose between a head chef job and catering with Phoebe, and helps Phoebe with ideas for a business of her own. Rachel gets \"hired\" as the assistant buyer at Bloomingdale's but doesn't get the promotion because her supervisor dies before she turns in the HR paperwork.",
    "title": "The One Where They're Going to Party!",
    "date": "December 11, 1997 ",
    "episode": "E09",
    "season": ""
  },
  {
    "description": "Ross must decide whether to continue dating a girl he must travel two-and-a-half hours to see or a girl much closer to home but much less fun. He eventually decides to see the girl from Poughkeepsie, but he falls asleep on the train and ends up in Montreal. Chandler tries to set Rachel up with a guy from his office, but couldn't succeed. Phoebe tries to write the perfect Christmas song about her friends. Monica starts her new job as head chef at a restaurant, but since her unflattering newspaper review resulted in the previous head chef being fired, the kitchen staff hate her and torment her constantly. On Chandler's suggestion, she hires Joey as a waiter with the purpose of firing him to intimidate the other staff into obeying her; the plan falls through initially after Joey receives good tips from patrons, and he is reluctant to lose his job. However, after the constant bullying almost reduces Monica to tears, Joey steps up and allows her to fire him, frightening the staff.",
    "title": "The One with the Girl from Poughkeepsie",
    "date": "December 18, 1997 ",
    "episode": "E10",
    "season": ""
  },
  {
    "description": "\nPhoebe doesn't know what to do when Frank Jr. visits with his new wife and asks her to carry their child. She visits her birth mother who tells her it isn't a good idea. To support this, she gives Phoebe a puppy, but only for three days to prove it will be hard to give it up. Phoebe decides she will carry their baby because when it's over, they will be so happy, making Phoebe feel good. Meanwhile, Monica teaches Chandler the secrets of a woman's seven erogenous zones, for which Kathy is extremely grateful.\nNote: In \"The One Where Chandler Doesn't Like Dogs,\" Chandler doesn't like dogs. However, he is seen in this episode with a dog.",
    "title": "The One with Phoebe's Uterus",
    "date": "January 8, 1998 ",
    "episode": "E11",
    "season": ""
  },
  {
    "description": "\nPhoebe's uterus is examined for implantation of the embryos. A seemingly harmless game between the guys and the girls escalates into a full-blown contest to see which pair knows more personal data about the other. The guys end up betting the chick and the duck, and the girls end up betting their apartment. When the guys win, Rachel tells them that it was just a game but the guys continue to move in. At the end, Phoebe tells everyone she's pregnant.\nIn 2009, TV Guide ranked this episode #21 on its list of the 100 Greatest Episodes.",
    "title": "The One with the Embryos",
    "date": "January 15, 1998 ",
    "episode": "E12",
    "season": ""
  },
  {
    "description": "As the guys and the girls switched apartments, Monica told the guys they have to be the hosts only for her to want to become the hostess again. Chandler breaks up with Kathy after seeing her having simulated sex on stage with another man. Kathy tells Chandler that it is just her job, and tells Chandler to call her when he can grow up. It is later revealed that Kathy wasn't sleeping with him, but starts to after her and Chandler's dispute, causing Chandler to say, that their \"second fight ... is going to be A BIG ONE!\" Rachel has a crush on Joshua, a handsome customer and even ponders asking him out.",
    "title": "The One with Rachel's Crush",
    "date": "January 29, 1998 ",
    "episode": "E13",
    "season": ""
  },
  {
    "description": "Joey has to go to Charlton Heston's new movie but smells awful because of a three-day fishing trip with his father previously and never had time to shower. He breaks into Heston's dressing room and uses his shower. Rachel sets Ross up with her boss's niece, Emily (Helen Baxendale) so that she can go to Joshua's invested nightclub. Chandler can't get over Kathy, and remains in his barcalounger, in his sweat pants.",
    "title": "The One with Joey's Dirty Day",
    "date": "February 5, 1998 ",
    "episode": "E14",
    "season": ""
  },
  {
    "description": "Ross plays rugby with some of Emily's English friends and ends up in a lot of pain afterward. Chandler runs into Janice and tells her that his company is transferring him to Yemen in an effort to escape reuniting with her. Monica obsesses over a light switch that doesn't seem to control anything, and even cuts the wall open herself to follow the wire after an electrician, the super and the electrical plans to the building prove unfruitful. It is revealed that it controls the television in Joey and Chandler's apartment.",
    "title": "The One with All the Rugby",
    "date": "February 26, 1998 ",
    "episode": "E15",
    "season": ""
  },
  {
    "description": "Rachel throws a fake party for Emily, who's returning to London, just so she can see Joshua outside of work. The baby in Phoebe's womb is craving meat, which is putting a strain on Phoebe's vegetarianism. Just as Rachel is about to kiss Joshua, Phoebe's baby kicks. After several failed and embarrassing attempts to seduce Joshua, Rachel finally admits the truth.",
    "title": "The One with the Fake Party",
    "date": "March 19, 1998 ",
    "episode": "E16",
    "season": ""
  },
  {
    "description": "Chandler and Joey discover that they're getting a free porn channel on their TV. Ross tells Emily how he really feels about her. After she has left for England, he flies to London to see her, unaware that she's already on her way back to New York to see him. The doctor tells Phoebe that she is going to have triplets.",
    "title": "The One with the Free Porn",
    "date": "March 26, 1998 ",
    "episode": "E17",
    "season": ""
  },
  {
    "description": "Joshua invites Rachel to his parents' house, who are said to be out of town. She changes into a more revealing dress and Joshua and his parents walk in, much to her embarrassment. Phoebe is offered the chance to name one of the triplets and chooses 'Chandler' over 'Joey'. Chandler realizes he has a horrible name and wants to change it, much to Phoebe's disapproval. When Phoebe leaves, it is revealed that it was just a plan by Chandler to get her to choose his name. Ross suspects Emily of having an affair with Carol's wife Susan.",
    "title": "The One with Rachel's New Dress",
    "date": "April 2, 1998 ",
    "episode": "E18",
    "season": ""
  },
  {
    "description": "Monica and Rachel have Knicks season tickets and offer them to the guys if they give them their apartment back. Chandler doesn't trade but Joey wants to. They play a game with Phoebe as the judge on picking the highest card out of a deck of cards and the winner takes it all. The guys win, so they set off to watch the game. While Chandler and Joey are at the Knicks game, Monica and Rachel switch the apartments back, despite the guys winning the tickets and the right to keep the apartment fair and square. But Rachel has a backup offer that she and Monica will kiss for one minute which the boys accept. Ross proposes to Emily and she accepts. Ross and Emily announce their engagement in front of his friends, which Rachel hears about. She, teary-eyed, congratulates the couple saying she is so happy for them.",
    "title": "The One with All the Haste",
    "date": "April 9, 1998 ",
    "episode": "E19",
    "season": ""
  },
  {
    "description": "Ross asks Monica to pick up Emily's wedding dress and instead Monica tries the dress on and keeps it. Phoebe then comes to Monica's in a wedding dress. Because of Ross's proposal to Emily, Rachel, feeling slightly jealous, tries to talk Joshua into marriage. He doesn't accept, and Rachel becomes dejected. Later when Rachel puts on a wedding dress at Monica's (with Phoebe), the three of them hear a knock on the door thinking it's Chandler. When Rachel opens it, she finds out it's actually Joshua, who gets freaked out and leaves, thereby ending the relationship. Chandler takes Joey to a sleep clinic because he starts snoring all the time and meets a girl named Marjorie (Christina Moore) who talks in her sleep. She later is in bed with Chandler and screams really loudly and wakes up Joey.",
    "title": "The One with All the Wedding Dresses",
    "date": "April 16, 1998 ",
    "episode": "E20",
    "season": ""
  },
  {
    "description": "Ross and Emily are sending their wedding invitations; Emily doesn't think it's a good idea to invite Rachel, as she believes it would be too \"awkward\" for him, but Ross invites her anyway. After scenes shown from previous episodes of her and Ross' relationship, Rachel decides not to go, and instead keeps Phoebe company in case she goes through labor.",
    "title": "The One with the Invitation",
    "date": "April 23, 1998 ",
    "episode": "E21",
    "season": ""
  },
  {
    "description": "Ross chooses Chandler as his best man, but picks Joey instead when Chandler says Ross won't be his best man. Joey then loses Ross's ring after a bachelor party and is convinced the stripper stole it after she slept with Joey. They later find out that the duck swallowed the ring. The duck is taken to a vet doctor who by a simple procedure ensures the safety of Joey's duck and the ring is also extracted and given back to Ross. The girls give Phoebe a baby shower during the height of her mood swings.",
    "title": "The One with the Worst Best Man Ever",
    "date": "April 30, 1998 ",
    "episode": "E22",
    "season": ""
  },
  {
    "description": "All the friends go to London, except for Phoebe, who's pregnant and Rachel, who thinks it will be too painful to see Ross get married, and tells Ross she has to work. The building where Ross and Emily schedule to get married has been torn down a few days early, but they decide to marry there anyway. Richard Branson cameos as a souvenir stand salesman and Sarah, Duchess of York appears in a video with Joey. Rachel decides to go to Ross's wedding after all, to say she still loves him, but stops when she sees how happy he is. Rachel tearfully congratulates Ross and they hug with her almost in tears. Emily's parents try to fool Ross's parents with the wedding bill, paying to remodel their house as well. Chandler and Monica sleep together after a drunk guy thinks she is Ross's mother. At the altar while Ross is saying his nuptials, he makes a big mistake and says Rachel's name instead of Emily's.",
    "title": "The One with Ross's Wedding",
    "date": "May 7, 1998 ",
    "episode": "E23",
    "season": ""
  },
  {
    "description": "After having said the wrong name at the altar, Ross tries to patch up things with Emily. Monica and Chandler try to find some alone time in London but can't seem to get any. Upon returning to New York, the couple attempt to put their brief fling behind them only to find that some feelings can't be ignored. A prank to Monica's and Chandler's utter dismay, the film My Giant has kept them from having sex, in London as well as on the plane to the USA.",
    "title": "The One After Ross Says Rachel",
    "date": "September 24, 1998 ",
    "episode": "E01",
    "season": "S05"
  },
  {
    "description": "Monica and Chandler try to hide their relationship but kiss in front of the others, accidentally. Chandler then kisses Rachel and Phoebe, which Monica then explains as his 'European thing.' Eventually all three girls put a stop to it (this includes Monica). Monica is put in charge of Rachel's love life because Rachel believes that she makes bad decisions, and Phoebe's water breaks and is upset that her bond with the triplets is coming to an end but glad she no longer has to do \"pregnant stuff.\" Rachel tells Ross she is still in love with him, however once she does the two of them realize how ludicrous the situation is and decide not to do anything.",
    "title": "The One with All the Kissing",
    "date": "October 1, 1998 ",
    "episode": "E02",
    "season": ""
  },
  {
    "description": "Phoebe gives birth to her brother's triplets. Joey gets sick at the hospital, with kidney stones. Chandler tells Monica that he is just goofing around in their relationship and Monica threatens to date one of Phoebe's male nurses, but they kiss and make up at the end.",
    "title": "The One Hundredth\nThe One with the Triplets",
    "date": "October 8, 1998 ",
    "episode": "E03",
    "season": ""
  },
  {
    "description": "Joey gets a job at a PBS telethon which prompts Phoebe to reveal that she hates PBS. He tells her that there is no such thing as a selfless good deed and she tries to find one to prove him wrong. Emily finally contacts Ross and they decide to give their relationship another try and she agrees to come to New York – if Ross promises to stop being friends with Rachel. Ross doesn't immediately answer, but when Rachel (not knowing Emily's demand) tells him that he needs to do whatever he needs to in order to get his wife back Ross agrees. When Rachel reveals that Monica said her new \"secret boyfriend\" (who is Chandler) was the \"best sex she ever had\", Chandler begins to gloat, much to Monica's dismay.",
    "title": "The One Where Phoebe Hates PBS",
    "date": "October 15, 1998 ",
    "episode": "E04",
    "season": ""
  },
  {
    "description": "Chandler and Monica go away for the weekend but spend the entire time fighting after Monica insists on constantly changing rooms due to her high standards whilst Chandler tries to watch a car chase on TV. Ross tells Rachel about his agreement with Emily, and he and Rachel get into a fight. After Monica tells Rachel that she's lost her eyelash curler, Joey realizes that Monica and Chandler are in a relationship (as the manager of the hotel in which Chandler stayed in had informed Joey that there was an eyelash curler left in Chandler's room). He is happy for them but shocked, and begrudgingly agrees to keep the secret.",
    "title": "The One with the Kips",
    "date": "October 29, 1998 ",
    "episode": "E05",
    "season": ""
  },
  {
    "description": "Phoebe receives a fur coat from her mother. At first she wants to get it cremated, but then starts to get attached to it. Monica and Rachel look for a waffle maker in the basement, the light falters and they see a very hairy guy, whom they mistake for a yeti. He then turns out to be their new neighbor, Danny. Emily's demands start to get more and more unreasonable as Ross is forced to move out of the apartment and sell his furniture as Emily doesn't want him living anywhere near Rachel or own anything that's been touched by her. As he enjoys dinner with the gang, Emily calls Ross and her reaction upon learning Rachel is there makes him realize she doesn't trust him. In the end, the two agree that their marriage is over.",
    "title": "The One with the Yeti",
    "date": "November 5, 1998 ",
    "episode": "E06",
    "season": ""
  },
  {
    "description": "Having already given up his apartment and with Emily's cousin kicking him out, Ross is homeless. Chandler and Joey are more than happy to let him move in with them but when he starts to get on their nerves they start to show him unsuitable apartments in an attempt to get him out. Phoebe dates a health inspector who keeps shutting the restaurants they go to. At first she revels in his power, but begins to tire when he starts shutting down her favourite restaurants and when it appears Central Perk is going to suffer the same fate Phoebe decides enough is enough. Rachel and Monica are invited to their new neighbor Danny's party but Rachel is reluctant to go.",
    "title": "The One Where Ross Moves In",
    "date": "November 12, 1998 ",
    "episode": "E07",
    "season": ""
  },
  {
    "description": "It's Thanksgiving, and everybody has flashbacks of their worst thanksgiving. Phoebe recalls her Thanksgiving in 1862, which happened in one of her \"past lives\". Rachel reveals Monica's worst Thanksgiving, at which Monica accidentally cut off Chandler's little toe. When Monica tries to get Chandler to forgive her, he accidentally reveals that he's in love with her and quickly tries to retract it.",
    "title": "The One with All the Thanksgivings",
    "date": "November 19, 1998 ",
    "episode": "E08",
    "season": ""
  },
  {
    "description": "With his second marriage having failed before it began and currently homeless, Ross can feel the stress building up. When his boss eats (and throws away some of) his last Thanksgiving sandwich at work, he erupts and earns himself indefinite leave. Joey, still the only person aware of Monica and Chandler's secret relationship, finds himself constantly having to cover for them after Chandler's underwear is found in Monica's apartment and a nude picture of Monica is left in his kitchen but this starts to make him look like a sexual deviant. Joey soon tires of this and looks ready to spill the beans but can't go through with it, instead getting revenge by saying that Monica had slept with him in London and has been stalking him ever since. Phoebe attends literature classes which she wants to learn seriously but Rachel, who accompanies her, takes it as nothing more than some fun. The two soon agree that, as Phoebe is taking it seriously, Monica should go instead only for her to end up sucking all the fun out of it with her competitive nature.",
    "title": "The One with Ross's Sandwich",
    "date": "December 10, 1998 ",
    "episode": "E09",
    "season": ""
  },
  {
    "description": "Phoebe volunteers to help collect money for the poor during Christmas time but finds that many people take advantage of the tin either to get change or to dispose of trash, causing her to call upon 'Street Phoebe' to deal with them. Ross, with nothing to do now that he's not working, helps Joey write a screenplay. However, his constant pushing of Joey sparks up an argument with Chandler. Rachel starts dating Danny, but is put off by his very close relationship with his sister.",
    "title": "The One with the Inappropriate Sister",
    "date": "December 17, 1998 ",
    "episode": "E10",
    "season": ""
  },
  {
    "description": "The gang makes New Year's resolutions: Chandler cannot make fun of his friends, Rachel will gossip less, Ross will do something new daily, Joey will learn to play the guitar, Phoebe will pilot a commercial jet and Monica resolves to take more pictures of all the friends together. However Rachel's resolution is put to the test when she overhears Monica and Chandler talk and learns of their relationship. Soon she and Joey find out the other knows, much to their mutual relief, since they can now talk about it. Phoebe tries to teach Joey how to play the guitar, however her teaching method is so unorthodox (not even letting him hold the guitar) that he soon starts looking for another teacher. Ross decides to wear leather pants to a date, but this backfires as the pants shrink and he finds himself unable to put them back on during a date after he has gone to the bathroom.",
    "title": "The One with All the Resolutions",
    "date": "January 7, 1999 ",
    "episode": "E11",
    "season": ""
  },
  {
    "description": "Monica finds out that Chandler kisses up to his boss at work and starts to lose respect for him, but behind her back, Rachel is trying to get Monica to confess her secret. However, when she doesn't, Rachel feels hurt that Monica is apparently unwilling to confide in her. Ross learns Emily is engaged again, and has a one-night stand with someone the group is all too familiar with, Janice. Later, Janice breaks up with him though, as she ironically \"can't take another second of  whining.\"",
    "title": "The One with Chandler's Work Laugh",
    "date": "January 21, 1999 ",
    "episode": "E12",
    "season": ""
  },
  {
    "description": "Phoebe's grandmother dies, and she is shocked when her father turns up at the funeral (When he identifies himself as \"Frank Buffay,\" there is an audible gasp from the studio audience.). Wanting to know more about him, she decides to arrange an encounter without telling him her identity. With an audition coming up, Joey wants to look good, but doesn't feel he has a 'style'. Rachel steps in to help out and convinces Joey to start carrying a \"man's bag\" to help him get the part. Joey soon starts loving the bag, but to everyone else he just looks like a man carrying a purse. Monica is upset that Chandler doesn't like her massages, but her competitive nature is placated when Chandler says she gives the \"best bad massages.\"",
    "title": "The One with Joey's Bag",
    "date": "February 4, 1999 ",
    "episode": "E13",
    "season": ""
  },
  {
    "description": "It's a sad day as Ugly Naked Guy is moving out, and Ross decides to apply to sublet his apartment. Phoebe finds out about Monica and Chandler after seeing them through Ugly Naked Guy's window and although Joey is happy that now they can just confront them, Rachel and Phoebe instead decide to pretend Phoebe is romantically interested in Chandler, so as to make them confess. Monica and Chandler realize something's up so they play along. Ross finds out that quite a few people are interested in Ugly Naked Guy's apartment and goes to extremes to win him over. Eventually the competition between Monica, Chandler, Phoebe and Rachel comes to a head, and Chandler and Monica admit that they love each other. Despite this, they still wish to keep their relationship a secret from Ross ... but it isn't long before he finds out too.",
    "title": "The One Where Everybody Finds Out",
    "date": "February 11, 1999 ",
    "episode": "E14",
    "season": ""
  },
  {
    "description": "Ross is initially furious upon learning of Chandler and Monica's relationship, but quickly comes round when he learns it is serious. Joey dates a girl who likes to punch him (Soleil Moon Frye). Ross gets off on the wrong foot with his new neighbors when he, not unreasonably, refuses to contribute towards the retiring superintendent's collection. Chandler and Monica have problems with their relationship after everyone jokes around about marriage. Monica is upset that Chandler refuses to consider getting married one day, and he becomes so worried about losing her that he hastily proposes. Monica turns him down telling him that while she wants him to be open to the idea of getting married one day, they certainly aren't ready yet (much to Chandler's relief).",
    "title": "The One with the Girl Who Hits Joey",
    "date": "February 18, 1999 ",
    "episode": "E15",
    "season": ""
  },
  {
    "description": "Phoebe finds a police badge at the coffeehouse and has fun pretending she's a cop – until she pulls it on the owner, a cop named Gary, who later successfully asks her out for dinner. Ross buys a new couch, but refuses to pay the huge delivery fee. As a result, he and Rachel struggle to lift it up to his apartment and Ross soon wishes he'd just paid the money. Joey thinks he is in love with Monica, after having a romantic dream about her. However, Monica later reasons with him that this is not the case, and that Joey actually wants a serious relationship, similar to Monica and Chandlers'.",
    "title": "The One with the Cop",
    "date": "February 25, 1999 ",
    "episode": "E16",
    "season": ""
  },
  {
    "description": "Rachel interviews with Ralph Lauren and accidentally kisses her interviewer and prospective boss – Mr. Zelner. Monica wants to prove that she and Chandler are a hotter couple than Phoebe and her new boyfriend. Joey flirts with a girl across the street—in Ross's building, but when he goes to meet her, he instead ends up visiting Ross all the time, due to a miscalculation with the floor number.",
    "title": "The One with Rachel's Inadvertent Kiss",
    "date": "March 18, 1999 ",
    "episode": "E17",
    "season": ""
  },
  {
    "description": "Rachel tries to take up smoking so she'll feel more included at work with her boss and co-worker. Joey auditions for a soup commercial with Ben playing his son, however the director pairs Ben with another father and eventually Joey is left in the uncomfortable position of going up against his friend's son. Monica and Phoebe throw a birthday party for Rachel, and Phoebe gets upset about Monica taking charge, so when they agree to work together, Phoebe goes all out, when she is in charge of cups and ice.",
    "title": "The One Where Rachel Smokes",
    "date": "April 8, 1999 ",
    "episode": "E18",
    "season": ""
  },
  {
    "description": "Ross has trouble flirting with the pizza delivery girl. So he orders lots of pizzas to try to gain her attention. Joey invites his grandmother over to watch his role on Law & Order – but his part's been cut. So he films his own 2 min role while everybody is watching the show. Monica asks Phoebe for a pair of earrings that she lent her but Phoebe has lent them to Rachel who lost one.",
    "title": "The One Where Ross Can't Flirt",
    "date": "April 22, 1999 ",
    "episode": "E19",
    "season": ""
  },
  {
    "description": "Ross, Joey and Chandler go on a ride-along with Phoebe's cop boyfriend Gary, but in an attempt to save his sandwich from a car backfire, Joey unintentionally ends up saving Ross as well. Because of this, Chandler thinks that Joey cares more about Ross than Chandler — until he finds out Joey was only trying to save his sandwich. Meanwhile, stealing margarita ingredients from Ross's apartment, Rachel intercepts a message from Emily who is about to get married but is having second thoughts and is considering giving Ross another chance. When Rachel accidentally deletes it she agonises over if she should tell Ross.",
    "title": "The One with the Ride-Along",
    "date": "April 29, 1999 ",
    "episode": "E20",
    "season": ""
  },
  {
    "description": "Phoebe learns that Gary is planning to ask her to move in with him and freaks out. She asks Chandler, as a commitment-phobe, to put him off however he can't bring himself to do it after seeing the depth of Gary's feelings. Phoebe ends up warming to the idea and agrees to move in, however the relationship ends on their first morning together when Gary shoots a bird tweeting outside the bedroom window. Rachel buys a hairless Sphynx cat for $1,000 but quickly regrets her purchase when all her friends make fun of it and the cat itself doesn't like her. She eventually unloads the creature on Gunther, making a profit. Ross and Joey pass time by tossing a ball back and forth, and subsequently try to make a record of how long they can throw it, without dropping the ball. Their game is disrupted, however, when Monica feels the need to include herself. Chandler is called a 'Dropper' when he wants to join the game.",
    "title": "The One with the Ball",
    "date": "May 6, 1999 ",
    "episode": "E21",
    "season": ""
  },
  {
    "description": "Joey borrows Phoebe's taxicab to arrive on time at the production set of the upcoming film, located in Las Vegas. Chandler comes along with him, but then in the cab learns that Joey won't get paid unless the movie is successful and remarks that he doesn't think the movie will be the big break he is looking for. Furious at Chandler's apparent lack of faith, he kicks him out of the cab and leaves him stranded on the bridge. Feeling guilty, Chandler later phones Joey and apologizes, however Joey doesn't tell Chandler that he was right... production has been shut down due to lack of funds forcing him to get a job as a costumed Roman soldier at Caesars Palace. Meanwhile, Rachel has eye problems but is too resistant to receive eyedrops on her eyes; Phoebe is angry at Ross and can't remember why, but refuses to make up leaving it to Ross to find out how he upset her.",
    "title": "The One with Joey's Big Break",
    "date": "May 13, 1999 ",
    "episode": "E22",
    "season": ""
  },
  {
    "description": "Monica has lunch with Richard but doesn't want to tell Chandler. She and Chandler go to Las Vegas for their anniversary, but Phoebe tags along to make up for her missing out on the London trip. They find out that Joey is working as a gladiator in a casino while the recording for his movie has been postponed. Rachel takes Phoebe's advice and wanders around in her apartment naked, which Ross mistakes as an invitation to \"the physical act of love.\" To get back at Rachel for making fun of him, he attempts to embarrass her on the flight to Las Vegas; mishap ensues. When Ross and Rachel arrive in Vegas, they get drunk. Joey discovers his \"identical hand twin\" and decides that he can make money off him so he can fund his delayed movie. Phoebe feuds with a slots \"lurker\" and gets thrown out of the casino, though she returns, posing as \"Regina Phalange\". Chandler and Monica contemplate marriage, and almost go through with it – until they see Ross and Rachel drunkenly stumbling out of the chapel, with Ross throwing rice and Rachel with a white bouquet of flowers.",
    "title": "The One in Vegas",
    "date": "May 20, 1999 ",
    "episode": "E23",
    "season": ""
  },
  {
    "description": "\nRoss and Rachel deal with the aftermath of their drunken escapade. Phoebe and Joey take a road trip back to New York in Phoebe's grandmother's cab. Monica and Chandler ponder the idea of marriage and decide to take their relationship forward a step.\n\nOpening Credit Gag: Courteney Cox got married to David Arquette between seasons 5 and 6 and she changed her last name to Arquette. As a gag, the name Arquette was added to every cast member's last name in the opening credits.",
    "title": "The One After Vegas",
    "date": "September 23, 1999 ",
    "episode": "E01",
    "season": "S06"
  },
  {
    "description": "Monica and Chandler tell Rachel and Joey that they're moving in together. Joey takes the news badly, and Chandler reassures him that their friendship won't be affected. On the other hand, Rachel takes the news surprisingly well, but only because she doesn't realize that if Chandler is moving in, she will have to move out. Eventually when Monica explains the situation, Rachel is distraught and seeks comfort from Ross. Phoebe thinks Ross still loves Rachel because he didn't get the annulment, and her belief is strengthened when Ross hugs Rachel in an attempt to comfort her and smells Rachel's hair.",
    "title": "The One Where Ross Hugs Rachel",
    "date": "September 30, 1999 ",
    "episode": "E02",
    "season": ""
  },
  {
    "description": "Ross tries to deny he still has feelings for Rachel, yet invites her to move in with him. When Monica flatly dismisses Chandler's idea to turn the spare bedroom into a game room, the two get into a fight when Chandler worries that she'll still consider it to be her apartment. Meanwhile, Joey has trouble finding a new roommate.",
    "title": "The One with Ross's Denial",
    "date": "October 7, 1999 ",
    "episode": "E03",
    "season": ""
  },
  {
    "description": "Joey's health benefits lapse just as he develops a hernia. Unable to afford the treatment and not wanting to borrow the money from Chandler, he takes on an acting role to allow him to renew his insurance, during which the hernia helps out with an uncooperative child star. Ross is given a professorship at NYU and, eager to impress his students, he puts on a fake English accent. Rachel finds out that she and Ross are still married.",
    "title": "The One Where Joey Loses His Insurance",
    "date": "October 14, 1999 ",
    "episode": "E04",
    "season": ""
  },
  {
    "description": "Rachel forces Ross to get an annulment, but Ross is unwilling, as he doesn't want to get divorced for the third time. When Rachel finds out that Ross didn't get the annulment, in retribution she fills out the form saying Ross is gay, mentally unstable and addicted to intravenous drugs, resulting in the judge (Conchata Ferrell) disallowing an annulment, which leads to Ross and Rachel, both disgruntled, seeking a divorce. Ross is miserable about now having three failed marriages, but cheers up when Rachel confesses that getting married was her idea. Joey pretends to be the owner of a Porsche whose owner left its keys in Central Perk. Phoebe babysits the triplets and ropes in Monica and Chandler, but Chandler swallows a toy gun and has to be taken to the hospital, leaving Phoebe alone.",
    "title": "The One with Joey's Porsche",
    "date": "October 21, 1999 ",
    "episode": "E05",
    "season": ""
  },
  {
    "description": "It's the final night before Chandler moves in with Monica. When Chandler tries to give Joey money, and Joey refuses, Chandler makes up a fake game and 'loses' the money to Joey only for Joey to lose the money to Ross in the same game. Upon finding out Rachel hasn't packed, Monica and Phoebe agree to help her move, however, when the two start to get emotional, Phoebe suggests they think of the things they don't like about each other. But this plan backfires when the two then get into a massive argument.",
    "title": "The One on the Last Night",
    "date": "November 4, 1999 ",
    "episode": "E06",
    "season": ""
  },
  {
    "description": "Rachel and Phoebe start living together. However, Rachel is embarrassed by Phoebe's odd running style and attempts to avoid her during her morning jogs through Central Park. Joey takes in a new roommate: dancer Janine (played by Elle Macpherson). Chandler wants to impress Monica by cleaning the apartment but forgets how everything is supposed to look.",
    "title": "The One Where Phoebe Runs",
    "date": "November 11, 1999 ",
    "episode": "E07",
    "season": ""
  },
  {
    "description": "Ross goes too far while trying to impress a date by over-whitening his teeth. Phoebe may or may not have made out with Ralph Lauren, which gets Rachel into trouble with her boss.",
    "title": "The One with Ross's Teeth",
    "date": "November 18, 1999 ",
    "episode": "E08",
    "season": ""
  },
  {
    "description": "Ross is forced to tell Chandler why Jack and Judy don't like him. It turns out that in college, Ross experimented with pot, and blamed the smell on Chandler, who had supposedly jumped out of the window because he was stoned. Rachel tries to make dessert, but because the recipe book's pages were glued together, she makes half of an English trifle and half of a shepherd's pie. Phoebe develops a crush on Jack Geller after a sensual dream. Joey and Ross try to get out of Thanksgiving when they are invited to hang out with Janine and her dancer friends.",
    "title": "The One Where Ross Got High",
    "date": "November 25, 1999 ",
    "episode": "E09",
    "season": ""
  },
  {
    "description": "Janine gets a job dancing for Dick Clark's New Year's Rockin' Eve and invites Joey, Ross and Monica to come with her. While there, Joey tries to ensure he gets a kiss at midnight while Monica and Ross try to ensure they get on camera, leading them to pull out an old dance routine. Meanwhile, Phoebe, Chandler and Rachel look for Monica's Christmas presents so that they can buy her something suitable in return.",
    "title": "The One with the Routine",
    "date": "December 16, 1999 ",
    "episode": "E10",
    "season": ""
  },
  {
    "description": "Janine and Joey are finally dating, only for Janine to tell Joey she doesn't like Monica and Chandler, forcing him to choose between them. Meanwhile, Rachel buys an apothecary table from Pottery Barn, a store that Phoebe hates, and pretends she got it at a flea market. Her plan is then thrown into jeopardy when Phoebe sees the same table at Ross's apartment.",
    "title": "The One with the Apothecary Table",
    "date": "January 6, 2000 ",
    "episode": "E11",
    "season": ""
  },
  {
    "description": "Chandler is upset when Playboy prints Ross's joke; both he and Ross claim to have originated the joke. Meanwhile, Joey reluctantly takes a waiter job at Central Perk but is fired by Gunther when he closes the shop to go to an audition, causing Rachel to stand up for him. Phoebe says she would choose Rachel over Monica as a girlfriend because Monica is high-maintenance, but also that Rachel is a pushover, causing tension between the girls.",
    "title": "The One with the Joke",
    "date": "January 13, 2000 ",
    "episode": "E12",
    "season": ""
  },
  {
    "description": "Joey uses his position as waiter to give all the pretty female customers free things at the coffee house, but quickly gets in trouble with Gunther. Monica is sick and won't admit it. Rachel's sister Jill (Reese Witherspoon) shows up because she's been financially cut off and has to try to make it on her own.",
    "title": "The One with Rachel's Sister",
    "date": "February 3, 2000 ",
    "episode": "E13",
    "season": ""
  },
  {
    "description": "Chandler admits that not much makes him cry, resulting in his friends trying everything to get him to do so. Larry Joe Campbell makes an appearance as Phoebe's fan asking for her autograph and later tells Joey that he has watched all of her porn movies. Phoebe discovers that Ursula has been in pornographic movies under Phoebe's name, but Phoebe gets her back by having all of Ursula's paychecks sent to her own address. Ross and Jill continue their relationship, although it soon becomes clear Jill is only pursuing Ross because it irks Rachel.",
    "title": "The One Where Chandler Can't Cry",
    "date": "February 10, 2000 ",
    "episode": "E14",
    "season": ""
  },
  {
    "description": "The gang ponders what might have been if Ross and Carol had stayed married, Monica had still been fat, Chandler had become a struggling writer, Joey had still worked on Days of our Lives, Rachel had married Barry and Phoebe had become a stockbroker. Fat virgin Monica is dating Roger and considers having sex with him for the first time. Ross attempts to spice up his marriage with Carol and ends up suggesting a threesome. Rachel instantly falls for Joey after seeing him for the first time in Central Perk, while Chandler attempts to cope with being Joey's assistant, with mixed results. Phoebe ends up in the hospital because of a mishap at work and a heart attack. Rachel almost has an affair with Joey, and finds Barry cheating on her. Ross realizes Carol is a lesbian by partaking in a threesome with Susan only to find himself very much left out. Phoebe is very stressed because of her time away from work; she has a heart attack and is subsequently fired. Monica's attempts to sleep with Roger go awry, due to Roger's busy schedule, and when Chandler attempts to comfort her, they end up in bed together.",
    "title": "The One That Could Have Been",
    "date": "February 17, 2000 ",
    "episode": "E15",
    "season": ""
  },
  {
    "description": "Rachel and Phoebe take self-defense classes. Ross, who had previously practiced karate, tries to attack them by surprise and convince them that they lack unagi, supposedly a state of \"total awareness\". In reality, as pointed out by Phoebe and Rachel, unagi is just a Japanese dish (in karate, zanshin is the state of total awareness). Chandler and Monica celebrate Valentine's Day several days after the actual date because of their schedules, but they forget to make each other homemade gifts: Monica gives Chandler one of Phoebe's \"sock bunnies\", and Chandler gives Monica a mixtape, which was originally a present from Janice. Joey decides to get money through medical research, but learns that the only study available is for identical twins, which pays $2,000. As a result, Joey tries to find someone to play his twin.",
    "title": "The One with Unagi\nThe One with the Mix Tape",
    "date": "February 24, 2000 ",
    "episode": "E16",
    "season": ""
  },
  {
    "description": "Ross starts dating a student from one of his paleontology classes, much to his friends' amusement, although he has fears about how the relationship may jeopardize his career. Rachel's and Phoebe's apartment catches fire, causing them to move in with Monica and Joey. At first it appears that Rachel will get to live with Monica and Phoebe will be forced to live with Joey when it appears that Phoebe's candles caused the fire. However, when it emerges that the fire was actually Rachel's fault, the two switch and Rachel finds herself preferring Joey's easygoing nature while Phoebe chafes over Monica's desire to keep her apartment clean.",
    "title": "The One Where Ross Dates a Student",
    "date": "March 9, 2000 ",
    "episode": "E17",
    "season": ""
  },
  {
    "description": "Joey's refrigerator breaks, but he can't afford a new one so he tries desperately to get one of his friends to pay for it. Ross's student girlfriend prepares to head to Miami for spring break and Ross tries to contain his paranoia over what she might do there. Meanwhile, Rachel asks Phoebe, Chandler and Monica to find her a date to attend a Ralph Lauren ball, which sparks a competition between them so fierce that when Rachel finds her own date the three scare him off.",
    "title": "The One with Joey's Fridge",
    "date": "March 23, 2000 ",
    "episode": "E18",
    "season": ""
  },
  {
    "description": "Joey gets his hopes up over his first significant acting job since Dr. Drake Ramoray. He has the part of science fiction hero Mac Machiavelli, the crime-fighting partner of a cool robot, C.H.E.E.S.E., which stands for Computerised Humanoid Electronically Enhanced Secret Enforcer. Monica bursts into the apartment making Chandler forget to finish a note for Joey that his decisive second audition has been moved two hours earlier. The friends reminisce about other instances when they have messed up. By miracle Joey gets another chance, which Chandler writes down correctly.",
    "title": "The One with Mac and C.H.E.E.S.E.",
    "date": "April 13, 2000 ",
    "episode": "E19",
    "season": ""
  },
  {
    "description": "Ross is nervous when he meets Elizabeth's father Paul (Bruce Willis) for the first time; Paul shows interest in Rachel. Joey begins working on Mac and C.H.E.E.S.E. but is openly unimpressed with C.H.E.E.S.E. his robot sidekick, which is a clumsy, slow-moving machine which speaks in a thin, distorted voice piped through a mike. This angers the operator of the robot, who has the power to get Joey fired. Phoebe writes a book based on Monica and Chandler.",
    "title": "The One Where Ross Meets Elizabeth's Dad",
    "date": "April 27, 2000 ",
    "episode": "E20",
    "season": ""
  },
  {
    "description": "Paul tells Ross that he disapproves of Ross' relationship with Elizabeth and threatens to have him fired if they continue seeing each other. Deciding to continue their relationship, Ross and Elizabeth sneak away to her family's cabin, not knowing Paul and Rachel have the same idea. The girls put their names down on a wedding list that gets back to Chandler, who promptly bolts. Eventually Monica finds him and calms him down, little realizing that Chandler is actually planning to propose.",
    "title": "The One Where Paul's the Man",
    "date": "May 4, 2000 ",
    "episode": "E21",
    "season": ""
  },
  {
    "description": "Chandler and Phoebe go looking for an engagement ring, and Chandler finds the perfect one but does not have the money with him to purchase it. When he gets his hands on the cash and returns to the store, he is dismayed to find Phoebe allowed the ring to be sold, so he tries to track it down. Meanwhile, Rachel attempts to get Paul to open up emotionally but does too good a job when Paul starts crying and won't stop. Joey and Ross are upset that it appears that Chandler prefers to spend time with Phoebe, so they decide to close Chandler out.",
    "title": "The One with the Ring",
    "date": "May 11, 2000 ",
    "episode": "E22",
    "season": ""
  },
  {
    "description": "\nChandler takes Monica out to dinner where he plans to propose. However, as Chandler starts to broach the subject, Richard suddenly turns up at the same restaurant and the moment is lost. Returning to the apartment, Chandler starts to worry that Monica may be getting suspicious and, desperate to surprise her, pretends that he isn't interested in settling down. Ross finds himself rethinking his relationship with Elizabeth because of her immaturity, and when he finds himself in the middle of a water balloon fight, his fears are confirmed and he breaks up with her. Joey accidentally buys a boat at a silent auction, falls in love with the idea of being a sailor, and decides to keep the boat. Richard reveals he's still in love with Monica and is willing to give her the marriage and children she wants if she is willing to take him back. Chandler begins his attempts to make Monica believe he isn't interested in ever settling down, however this backfires and she begins to reconsider their relationship. Eventually, Chandler is led to believe that Monica has left him but then discovers that she has planned the perfect proposal for him, while she proposes to him, she cries and says \"there's a reason why girls don't do this!\". Chandler finally asks Monica to marry him and she accepts. The season ends with Chandler and Monica dancing to \"Wonderful Tonight\" by Eric Clapton and the screen fades to black.\nNote: This is Tom Selleck's last appearance as Richard.",
    "title": "The One with the Proposal",
    "date": "May 18, 2000 ",
    "episode": "E23",
    "season": ""
  },
  {
    "description": "The gang prepare to celebrate Monica and Chandler's engagement. However, when Monica opens the door to Ross kissing Rachel in the hall, Monica accuses them of stealing her thunder. Ross and Rachel had been planning \"bonus night\", where two exes have a one-night stand. Meanwhile, Chandler has bedroom-related problems, Joey auditions to play as a 19-year-old, and Phoebe is desperate to be asked to play her guitar at the wedding.",
    "title": "The One with Monica's Thunder",
    "date": "October 12, 2000 ",
    "episode": "E01",
    "season": "S07"
  },
  {
    "description": "Monica learns her parents have spent her wedding fund but soon perks up when she learns Chandler has saved enough money to pay for her dream wedding. However, Chandler isn't keen on spending all of the money on the wedding when he'd rather save it for their future. Joey finds an erotic novel Rachel's been reading and mocks her. Phoebe moves temporarily into Ross's apartment bringing her massage clients with her, leading Ross to end up massaging an old man in a failed pass at a woman.",
    "title": "The One with Rachel's Book",
    "date": "October 12, 2000 ",
    "episode": "E02",
    "season": ""
  },
  {
    "description": "Phoebe wants to give Monica her grandmother's secret cookie recipe – but the recipe was destroyed in the fire. Later, the two make many test cookies, only to realize the true recipe comes from Nestle Toll House. Rachel tries to teach Joey how to sail, but to no avail. Rachel's demanding manner on the boat makes her realize she can be like her father. Meanwhile, Chandler gets new glasses and a mishap in a steam room results in Chandler sitting on his future father-in-law's nude lap.",
    "title": "The One with Phoebe's Cookies",
    "date": "October 19, 2000 ",
    "episode": "E03",
    "season": ""
  },
  {
    "description": "Rachel must choose between a hunky young guy, Tag, or an experienced and well-qualified woman, for the job of executive assistant. Joey is offered the part of Dr. Stryker Ramoray, the twin of his old character Dr. Drake Ramoray, on Days of Our Lives but is offended when he is asked to audition. However, when Mac and C.H.E.E.S.E. is cancelled, Joey finds himself crawling back to the producers. Monica, Chandler and Ross (who wore leg warmers) all reveal secrets to each other. Monica tells Chandler about Phoebe's secret of an employee getting fired, and Chandler tells about his trip to Disney with Ross who ended up ill on a ride after eating tacos. Ross tells Monica about the Atlantic City trip in which Chandler's secret by accidentally kissed a guy. Monica ate her macaroni diorama. Ross ended up kissing a cleaning lady.",
    "title": "The One with Rachel's Assistant",
    "date": "October 26, 2000 ",
    "episode": "E04",
    "season": ""
  },
  {
    "description": "Chandler can't seem to photograph well. Joey teaches Tag to pick up women, much to Rachel's annoyance. Ross and Phoebe date a couple who are divorcing.",
    "title": "The One with the Engagement Picture",
    "date": "November 2, 2000 ",
    "episode": "E05",
    "season": ""
  },
  {
    "description": "Joey and Ross accidentally take a nap together and much to their dismay, find that they like it. Phoebe and Rachel compete to be Monica's maid of honor. Meanwhile, Chandler's breakup with a past girlfriend because of weight issues places Monica in doubt about him being committed to their relationship.",
    "title": "The One with the Nap Partners",
    "date": "November 9, 2000 ",
    "episode": "E06",
    "season": ""
  },
  {
    "description": "Ross is happy that his dissertation is in the school library until he finds out where it's located: the dead part of the library where people go to hook up. Rachel and Phoebe believe they've found the perfect girl (Kristin Davis) for Joey. Janice invites herself to Chandler and Monica's wedding, and they try to stop her by convincing her Chandler still has feelings for her. Ross, while trying to guard his dissertation from potential lovers, meets a woman who enjoyed his work, and they end up fooling around (and getting caught) in the library.",
    "title": "The One with Ross's Library Book",
    "date": "November 16, 2000 ",
    "episode": "E07",
    "season": ""
  },
  {
    "description": "Phoebe sneaks a dog into the apartment; Chandler reveals that he hates dogs. Ross becomes obsessed with naming all fifty U.S. states in order to earn his Thanksgiving dinner. After revealing Tag broke up with his girlfriend and has nowhere to go for Thanksgiving, Rachel invites him to Monica and Chandler's apartment, and is hesitant on whether to tell Tag her true feelings.",
    "title": "The One Where Chandler Doesn't Like Dogs",
    "date": "November 23, 2000 ",
    "episode": "E08",
    "season": ""
  },
  {
    "description": "Monica's plan to get to know her neighbors backfires when she is overworked. Phoebe finally gets her first bicycle, thanks to Ross, but is unable to ride it. Rachel and Tag's relationship is nearly discovered at Ralph Lauren.",
    "title": "The One with All the Candy",
    "date": "December 7, 2000 ",
    "episode": "E09",
    "season": ""
  },
  {
    "description": "Ross wants to introduce Ben to Hanukkah but Ben always loved Christmas. Phoebe learns that her and Rachel's apartment has been repaired; however she then fears that Rachel would rather continue to live with Joey instead of her. To prevent this problem she presents Joey with various gifts – a spider that scares Joey more than Rachel and a drum kit that annoys Monica. Ross dresses up as a \"Holiday Armadillo\" to make Ben excited about Hanukkah.",
    "title": "The One with the Holiday Armadillo",
    "date": "December 14, 2000 ",
    "episode": "E10",
    "season": ""
  },
  {
    "description": "Rachel and Chandler get hooked on cheesecakes meant for someone else. David (Hank Azaria), Phoebe's Scientist Guy, comes into town for just one night and wants to have dinner with Phoebe when she already has plans with Joey. Monica's cousin Frannie, with whom she was once best friends, is getting married, and she is not invited. As it turns out, her husband is Stuart, an old flame who slept with Monica once.",
    "title": "The One with All the Cheesecakes",
    "date": "January 4, 2001 ",
    "episode": "E11",
    "season": ""
  },
  {
    "description": "Everyone is awake for the whole night after they try to see a comet on the roof. Monica and Chandler can't seem to sleep, Rachel and Tag search for a business file, Joey and Ross try to get off the roof staying after the others and getting locked out, and Phoebe's smoke detector won't stop beeping, leading to a run-in with a firefighter.",
    "title": "The One Where They're Up All Night",
    "date": "January 11, 2001 ",
    "episode": "E12",
    "season": ""
  },
  {
    "description": "Rachel and Chandler both think they've broken Rosita, Joey's recliner, so Rachel goes out with Joey to buy the La-Z-Boy E-Cliner 3000, while Chandler secretly swaps his recliner with Joey's. Eventually, Joey takes Chandler's at Monica's request, and Rachel keeps the luxurious La-Z-Boy for herself (making Joey jealous). Meanwhile, Monica and Ross visit their childhood house, finding out their parents are selling it. However, an incident with the Porsche and a flood leads to Monica's childhood boxes being ruined while Ross's stay dry. Phoebe takes a telemarketing job selling toner and tries to save a man named Earl (Jason Alexander) from committing suicide.",
    "title": "The One Where Rosita Dies",
    "date": "February 1, 2001 ",
    "episode": "E13",
    "season": ""
  },
  {
    "description": "\nRachel frets over turning 30, prompting everyone else to remember what they did when they reached the same milestone. After realizing that Tag is too young and immature, she breaks up with him.\nNote: In episode 3.10 “The One Where Rachel Quits”, set in December 1996, Chandler says Rachel is 28 and so she should turn 33 in this episode, set in early 2001. Moreover, it is previously said (elsewhere in seasons 4 and 5) that Rachel was born on May 5th and not in the wintertime.",
    "title": "The One Where They All Turn Thirty",
    "date": "February 8, 2001 ",
    "episode": "E14",
    "season": ""
  },
  {
    "description": "\nJoey's Days of our Lives character has another character's brain transplanted into his body, and tells the actress by accident. Using his charm, Joey and the actress work to maintain the character's legacy, and they sleep together. Ross cooks up a special surprise for the wedding: dreadful bagpipe playing. Meanwhile, after finding a cute guy's phone, Phoebe and Rachel compete over who gets to keep the phone to start 'a fairytale for the digital age'. Later, an elderly gentleman claims the phone, and Phoebe happily goes to dinner with him, finding him more attractive than the young man whose phone they thought it was.\nNote: Matt LeBlanc was nervous about performing with Susan Sarandon. Similarly, Kevin Bright was cautious about directing, as Tim Robbins attended the studio recording.",
    "title": "The One with Joey's New Brain",
    "date": "February 15, 2001 ",
    "episode": "E15",
    "season": ""
  },
  {
    "description": "Rachel teaches Ben practical jokes, which angers Ross. However, Ross and Ben get back at Rachel with a prank of their own. Chandler learns that Monica was actually planning on sleeping with Joey the night they first got together, making Chandler paranoid that she would leave him for Joey. Joey becomes ordained over the Internet in preparation to officiate Monica and Chandler's wedding.",
    "title": "The One with the Truth About London",
    "date": "February 22, 2001 ",
    "episode": "E16",
    "season": ""
  },
  {
    "description": "Monica beats another bride-to-be in a fight over a wedding dress; however she is forced to reconsider her victory when the other bride-to-be books Chandler's favorite band on the same day as her wedding and holds them as ransom for the dress. Joey and Ross fight over the same girl (Gabrielle Union) they met and go to drastic measures to win.",
    "title": "The One with the Cheap Wedding Dress",
    "date": "March 15, 2001 ",
    "episode": "E17",
    "season": ""
  },
  {
    "description": "Joey is nominated for a \"Soapie\" but loses, much to his chagrin. But when he accepts a different award on behalf of a co-star, he finds himself unwilling to hand it over. One of Ross's male students claims he is in love with him to get a higher mark on a test. It is revealed by another student that he is straight and has fooled other professors in a similar manner. The student ends up with a C after some of Ross's colleagues overhear a conversation that made it seem that Ross and the student dated.",
    "title": "The One with Joey's Award",
    "date": "March 29, 2001 ",
    "episode": "E18",
    "season": ""
  },
  {
    "description": "\nRoss and Monica's gorgeous cousin, Cassie (Denise Richards) comes to visit, and Chandler, Ross, and Phoebe become attracted to her. Rachel and Phoebe quickly throw together a bridal shower for Monica. Joey auditions for a part which is perfect for him, apart from the fact it calls for an uncircumcised actor (which Joey is not). Upon finding out he lied about his 'downstairs' area, Monica tries to fix it so he can still get the part, using a variety of methods including Silly Putty and cold cuts.\nNote: The sub-plot where Joey auditions for the role of an uncircumcised man was originally written for The One with Barry and Mindy's Wedding but the story was changed on the advice of network censors, who thought it was tasteless.[page needed]",
    "title": "The One with Ross and Monica's Cousin",
    "date": "April 19, 2001 ",
    "episode": "E19",
    "season": ""
  },
  {
    "description": "Rachel runs into Melissa (Winona Ryder), a former sorority sister with whom she once had a passionate kiss. However, with Melissa denying it and Phoebe unable to believe Rachel is capable of something like that, Rachel decides to recreate the kiss with surprising results: Melissa was faking and has feelings for Rachel. Meanwhile Chandler is excited when he rents the same tuxedo that Pierce Brosnan wore as James Bond, but feels outdone when Ross claims to have tried the same tux Val Kilmer wore in Batman Forever.",
    "title": "The One with Rachel's Big Kiss",
    "date": "April 26, 2001 ",
    "episode": "E20",
    "season": ""
  },
  {
    "description": "\nChandler and Monica struggle to write their wedding vows. The group remember the journey Monica and Chandler have made the past few years via flashbacks.\nNote: This is the lowest rated episode in the series with only 15.65 million viewers.",
    "title": "The One with the Vows",
    "date": "May 3, 2001 ",
    "episode": "E21",
    "season": ""
  },
  {
    "description": "Chandler tries to reconcile with his estranged father (Kathleen Turner), per Monica's request. Monica and Chandler attend one of Mr. Bing's drag shows, where father and son reconcile and Mr. Bing agrees to attend. Rachel, an irresponsible driver, takes Monica's Porsche for a spin with Ross (much to his fear). Joey takes advice from Phoebe about his masculinity, resulting in him trying on women's underwear. Rachel gets caught driving the Porsche without a license and flirts with the officer to get out of being fined. Later, Ross is pulled over for driving too slow on the freeway, resulting in similar (but unsuccessful) flirtatious attempts.",
    "title": "The One with Chandler's Dad",
    "date": "May 10, 2001 ",
    "episode": "E22",
    "season": ""
  },
  {
    "description": "Joey gets a part in a movie and learns the art of enunciation (and therein spitting) from his famous co-star (Gary Oldman). He later finds out he is supposed to work on the day of Monica and Chandler's wedding. Chandler's fear of commitment catches up to him and he runs away from his wedding. Phoebe finds someone's positive pregnancy test in the bathroom trash, and assumes it is Monica's. Joey learns he is only supposed to shoot one scene before he can leave for the wedding, but when his co-star turns up drunk it seems Joey won't make it to the ceremony. Chandler is found but, upon overhearing Phoebe discuss Monica's assumed pregnancy, disappears again. Luckily he turns up again, used to the idea of becoming a father. Joey arrives just in time, still in costume from his war movie. Monica and Chandler become husband and wife, getting married to the tune of the song \"Everlong\" by Foo Fighters. In the end, it's revealed that the pregnancy test belonged to Rachel.",
    "title": "The One with Monica and Chandler's Wedding",
    "date": "May 17, 2001 ",
    "episode": "E23",
    "season": ""
  },
  {
    "description": "\nEverybody thinks Monica's pregnant, but her denial quickly shifts the focus to Phoebe, who takes the heat off of Rachel--who is actually pregnant. Chandler's shoes are slippery, rendering his dance lessons useless. Joey tries to impress a Broadway director. Ross dances with children to impress Monica's attractive, funny friend Mona, which leads to him getting injured quite a bit.\nNote: This episode is dedicated to \"The people of New York City\" to remember the September 11 attacks.",
    "title": "The One After 'I Do'",
    "date": "September 27, 2001 ",
    "episode": "E01",
    "season": "S08"
  },
  {
    "description": "Rachel won't tell anybody who the father of her baby is until she tells him. Joey tells Monica and Phoebe that a guy slept with Rachel a few weeks earlier, and left a red sweater behind. Phoebe thinks it's Tag Jones and arranges a meeting for Rachel with him. Ross and Chandler attempt to recreate the wedding pictures, after Chandler loses the disposable cameras. Monica opens all of her and Chandler's wedding presents. Monica, Joey and Phoebe find out that Tag is not the father of Rachel's baby. They're still pondering the mystery when the red sweater is spotted in front of them and retrieved by its owner: Ross.",
    "title": "The One with the Red Sweater",
    "date": "October 4, 2001 ",
    "episode": "E02",
    "season": ""
  },
  {
    "description": "\nChandler and Monica prepare to leave for their honeymoon as Rachel prepares to tell the father of her baby. Phoebe and Joey try to get into Monica and Chandler's apartment by telling Mr. Treeger there is a gas leak. However, not all goes to plan when Treeger, who could not find Monica and Chandler's key, orders firefighters to break down the door.\nNote: There was a subplot of Chandler and Monica's honeymoon that was completely shot and filmed but ultimately never aired. It involved Chandler playfully joking about bombs when preparing to board first-class. The airport security mistake Chandler's joke as a real threat then take him and Monica to interrogation. Towards the end of the episode they're determined not to be a threat to the aircraft, but shortly after their release Joey calls Monica and pretends that there is a gas leak in their apartment in an attempt to cover for the broken door. When Joey asked her whether they'll charge them for the damage of breaking down the door, she sarcastically replied, \"No, I want you to stand there and wait for the entire place to blow up!\", causing the authorities to re-interrogate the couple. Following 9/11, the writers felt the humor of this subplot was off color and quickly replaced it with a story about Chandler and Monica getting jealous over another newly married couple who got free perks by arriving just before they did. The cut scenes from this episode were later shown as a special feature on the 2004 UK version of the DVDs.",
    "title": "The One Where Rachel Tells...",
    "date": "October 11, 2001 ",
    "episode": "E03",
    "season": ""
  },
  {
    "description": "Ross and Rachel disagree over who came onto whom when they hooked up, with Rachel (and the group) sure that Ross was the initiator of their pregnancy-causing sex and Ross being sure that Rachel hit on him first. He wants to prove it and accidentally reveals that he has the encounter on videotape. Rachel goes from being disgusted to being intrigued, and everyone watches the tape where they find out that Ross was right because Rachel used Joey's patented \"story that leads to having sex\". Monica and Chandler meet another couple while on their honeymoon.",
    "title": "The One with the Videotape",
    "date": "October 18, 2001 ",
    "episode": "E04",
    "season": ""
  },
  {
    "description": "\nPhoebe begins dating a guy who works for Monica, causing a problem when Phoebe wants to dump him on the same day Monica plans to fire him. A guy at Chandler's work thinks that Chandler's name is Toby. Rachel goes on a date with Joey's costar, despite being pregnant, much to Ross' annoyance.\nNote: This episode is dedicated to the memory of Richard Cox, Sr., father of Courteney Cox.",
    "title": "The One with Rachel's Date",
    "date": "October 25, 2001 ",
    "episode": "E05",
    "season": ""
  },
  {
    "description": "Monica and Chandler are throwing a Halloween Party. At the party Phoebe runs into her sister's fiance, Eric (Sean Penn), and finds herself attracted to him as they bond over what a total liar Ursula is. Ross and Chandler arm wrestle ineffectually, as Ross laments that his goofy \"Spudnik\" outfit makes him look like feces. Rachel asks if she can be the person who hands out candy to the trick-or-treaters, as she says 'ever since I got pregnant, I have had the strongest maternal instincts', only to find out she isn't as maternal as she thought.",
    "title": "The One with the Halloween Party",
    "date": "November 1, 2001 ",
    "episode": "E06",
    "season": ""
  },
  {
    "description": "Chandler hires a maid to help Monica but she thinks the maid is stealing her clothes. Eric broke up with Ursula and wants to date Phoebe but she reminds him too much of her sister. Ross attempts to secure the apartment of a dying Dutch woman for Rachel, while Joey tries to convince Rachel to continue living with him.",
    "title": "The One with the Stain",
    "date": "November 8, 2001 ",
    "episode": "E07",
    "season": ""
  },
  {
    "description": "Rachel's having dinner with her dad to tell him that she's pregnant, and Rachel is intimidated and lies about Ross being unsupportive, leading to Mr. Green threatening Ross and nearly ruining his budding romance with Mona. Meanwhile Monica hires a stripper, who turns out to be a hooker, for Chandler because he never got to have a bachelor party.",
    "title": "The One with the Stripper",
    "date": "November 15, 2001 ",
    "episode": "E08",
    "season": ""
  },
  {
    "description": "Monica invites a high school friend, Will (Brad Pitt) to her Thanksgiving dinner. Rachel finds out that Will (who was a loser like Ross in high school and is now a gorgeous guy) and Ross started a rumor about Rachel having both male and female \"reproductive parts\" during their senior year of high school. Joey tries to eat an entire turkey because 'he's a Tribbiani'. Chandler and Phoebe avoid helping Monica by sitting on the couch and watching a game.",
    "title": "The One with the Rumor",
    "date": "November 22, 2001 ",
    "episode": "E09",
    "season": ""
  },
  {
    "description": "\nMonica buys very expensive boots and promises Chandler to wear them all the time. After a while they are killing Monica's feet but she doesn't dare to tell Chandler. Joey's youngest sister Dina (Marla Sokoloff) is pregnant and comes to Rachel for advice. Phoebe finds out that Sting's son is in Ben's class so she goes to see Sting's wife (real wife (Trudie Styler) pretending to want to talk about Ben and Jack in order to get tickets to Sting's concert.\nNote: In this episode, Ross tells Phoebe Ben is 7. However this episode is set in December 2001, and as Ben was born in May 1995, Ben would only be 6 at the time.",
    "title": "The One with Monica's Boots",
    "date": "December 6, 2001 ",
    "episode": "E10",
    "season": ""
  },
  {
    "description": "Ross freaks out when Mona wants to send out joint Christmas cards and wants to have \"the talk\". Chandler tries to get out of spending time with his boss. Rachel has hormonal problems as a result of pregnancy and becomes \"erotically charged\".",
    "title": "The One with Ross's Step Forward\nThe One with The Creepy Holiday Card",
    "date": "December 13, 2001 ",
    "episode": "E11",
    "season": ""
  },
  {
    "description": "Now that Rachel can't go on dates any more due to her pregnancy, Joey decides to take her on a date. But instantly, he begins to have a crush on Rachel, something that even he is scared about. Monica and Chandler get a Ms. Pac-Man arcade game from Phoebe as a late wedding present. After Phoebe hogs the game, Chandler becomes a pro by repeatedly playing and putting swear words as his initials, however Monica wants them to be removed as Ben would be coming over to play on it. After Ross gets to teach an advanced class, he struggles to get to the class on time.",
    "title": "The One Where Joey Dates Rachel",
    "date": "January 10, 2002 ",
    "episode": "E12",
    "season": ""
  },
  {
    "description": "Monica sways Chandler's dislike of baths but he soon becomes addicted to them. Phoebe, who thinks Joey has a crush on her, is shocked to discover that Joey actually likes Rachel; Ross and Rachel debate over potential names for their baby and find out the baby's sex.",
    "title": "The One Where Chandler Takes a Bath",
    "date": "January 17, 2002 ",
    "episode": "E13",
    "season": ""
  },
  {
    "description": "Chandler becomes obsessed with finding out what is behind the door of Monica's secret closet. Phoebe feels betrayed when she discovers Monica has been using a different massage therapist. Ross feels left out after missing the baby's first kick especially when Joey is mistaken for the father. Joey, feeling bad about the situation, suggests that Rachel should move in with Ross even though he wanted Rachel to live with him.",
    "title": "The One with the Secret Closet",
    "date": "January 31, 2002 ",
    "episode": "E14",
    "season": ""
  },
  {
    "description": "Phoebe gives a birthing video to Rachel. Chandler, mistaking the tape for porn, watches it and is horrified after watching it with Monica, which kills the mood for Valentine's Day. Ross struggles to tell Mona that Rachel is now living with him, and she breaks up with him over his dishonesty. Joey is depressed and in an effort to lighten his mood, Phoebe lends him a dog to cheer him up. However Joey ends up subduing the dog with his depression, and in the end tells Ross about his feelings for Rachel.",
    "title": "The One with the Birthing Video",
    "date": "February 7, 2002 ",
    "episode": "E15",
    "season": ""
  },
  {
    "description": "\nRoss, shocked at Joey's declaration, avoids him, but eventually convinces him to tell Rachel. Joey confesses his love for Rachel, but Rachel politely and lovingly turns him down. Phoebe is convinced that a British man called Don is Monica's soulmate.\nGuest starring Sam Pancake as the waiter.",
    "title": "The One Where Joey Tells Rachel",
    "date": "February 28, 2002 ",
    "episode": "E16",
    "season": ""
  },
  {
    "description": "Phoebe determines through tea leaves that she'll soon meet the man of her dreams, which leads her to a disastrous date and then a pleasant meeting with a charming man at the dry cleaners. Rachel invents a crazy work problem to reduce the awkwardness of hanging out with Joey, since he confessed his feelings for her. Ross tries to retrieve his 'faded salmon' shirt from Mona's apartment.",
    "title": "The One with the Tea Leaves",
    "date": "March 7, 2002 ",
    "episode": "E17",
    "season": ""
  },
  {
    "description": "Monica botches an attempt at giving a heartfelt speech for her parents' 35th anniversary party. Phoebe dates Parker (Alec Baldwin), who's very enthusiastic about everything and ultimately annoys the entire group including herself. Ross and Rachel have to pretend to be married and Ross' \"wedding toast\" stirs feelings in Rachel.",
    "title": "The One in Massapequa\nThe One with the Zesty Guy",
    "date": "March 28, 2002 ",
    "episode": "E18",
    "season": ""
  },
  {
    "description": "Joey prepares for an interview with Soap Opera Digest, although he's afraid of saying something stupid that may jeopardize his career. (In a previous episode, in an interview, he said he writes a lot of his own lines, which led to his firing from Days of Our Lives.) Joey enlists his friends to make sure things go well. This is the fourth of Friends' six clip shows.",
    "title": "The One with Joey's Interview",
    "date": "April 4, 2002 ",
    "episode": "E19",
    "season": ""
  },
  {
    "description": "Phoebe and Monica prepare for Rachel's baby shower and forget to invite Rachel's mother. During the shower Monica tries desperately to seek forgiveness from Sandra, but to no avail. Rachel realizes she has no idea how to look after the baby after the birth, so her mother insists on staying with her for eight weeks, much to her and Ross's annoyance. Monica eventually gives Rachel the confidence to be a mom and lets Sandra know she's pissed at her bitchiness. Joey auditions for a job as a host for a new game show called \"Bamboozled\" that makes absolutely no sense, and Chandler and Ross help him practice.",
    "title": "The One with the Baby Shower",
    "date": "April 25, 2002 ",
    "episode": "E20",
    "season": ""
  },
  {
    "description": "Monica's cooking skills get a bad review in The Post. After confronting the critic who wrote it, she decides to join a cooking class, with Joey in tow. Rachel gets jealous when Ross meets a girl who flirts with him at the baby department store. Phoebe helps Chandler prepare for an interview by stopping his natural instinct to make immature jokes.",
    "title": "The One with the Cooking Class",
    "date": "May 2, 2002 ",
    "episode": "E21",
    "season": ""
  },
  {
    "description": "Joey invites Chandler to his movie's premiere but Chandler falls asleep during it. Rachel is very frustrated with the fact that she's eight days late, and will try anything to induce labor, which leads to a bet between Monica and Phoebe.",
    "title": "The One Where Rachel is Late",
    "date": "May 9, 2002 ",
    "episode": "E22",
    "season": ""
  },
  {
    "description": "Ross and Rachel arrive at the hospital. Judy Geller gives Ross her mother's engagement ring to propose to Rachel with. Monica and Chandler decide to have a baby. After forty-seven hours of labor, Rachel has her and Ross's baby, Emma as \"River Of Tears\" by Eric Clapton plays in the background. Joey finds Ross's engagement ring. Rachel thinks he's proposing and says \"Okay\". Monica and Chandler try for a baby in the hospital.",
    "title": "The One Where Rachel Has a Baby",
    "date": "May 16, 2002 ",
    "episode": "E23",
    "season": ""
  },
  {
    "description": "After Joey accidentally proposes to Rachel, he tries to tell her it was an accident, but can never find an opportune moment. Meanwhile, Monica and Chandler continue trying for a baby, while Ross, not knowing that Joey has proposed to her, plans to start things up again with Rachel.",
    "title": "The One Where No One Proposes",
    "date": "September 26, 2002 ",
    "episode": "E01",
    "season": "S09"
  },
  {
    "description": "Rachel can't get Emma to stop crying after waking her. Chandler accidentally agrees to relocate to Tulsa due to him falling asleep in a meeting. Meanwhile Joey and Ross end up in the hospital, as Ross, still angry at Joey for proposing to Rachel, attempts to hit Joey after he asks him to but misses and hits a pole in the coffeehouse.",
    "title": "The One Where Emma Cries",
    "date": "October 3, 2002 ",
    "episode": "E02",
    "season": ""
  },
  {
    "description": "Monica is offered a great job in New York City, and as a result of Chandler not being able to get out of moving to Tulsa, he is forced to leave during the week and return on the weekends since the only alternative is quitting. Phoebe and Joey set each other up on blind dates, and Joey finds a complete stranger named Mike (Paul Rudd) for Phoebe's date. Rachel takes Emma to the pediatrician – and learns that Ross is still a patient.",
    "title": "The One with the Pediatrician",
    "date": "October 10, 2002 ",
    "episode": "E03",
    "season": ""
  },
  {
    "description": "Monica goes to visit Chandler in Tulsa as a surprise, however he's watching porn on the hotel television and when she arrives he, in a panic, switches on a shark documentary leading Monica to believe the sea creatures turn him on. Joey thinks he's already slept with the girl he's dating.",
    "title": "The One with the Sharks",
    "date": "October 17, 2002 ",
    "episode": "E04",
    "season": ""
  },
  {
    "description": "Phoebe plans a night out for her birthday, but only she and Joey are on time as all the other friends have issues which make them late.",
    "title": "The One with Phoebe's Birthday Dinner",
    "date": "October 31, 2002 ",
    "episode": "E05",
    "season": ""
  },
  {
    "description": "\nRoss and Rachel hire a male nanny (Freddie Prinze, Jr.). Chandler freaks when Monica tells him that she has met somebody else who is the funniest man she has ever met. Meanwhile, Phoebe's scientist ex David (Hank Azaria) resurfaces, and this time, he meets Mike.\nNote: This is the longest episode of Friends (apart from the two-part ones), running with 31:56. This is also the 200th episode.",
    "title": "The One with the Male Nanny",
    "date": "November 7, 2002 ",
    "episode": "E06",
    "season": ""
  },
  {
    "description": "Ross finds a way to make Emma laugh by singing \"Baby Got Back\". Phoebe meets Mike's parents and tries to impress them with a Katharine Hepburn accent. Chandler and Joey find a videotape in Richard's apartment with Monica's name on it.",
    "title": "The One with Ross's Inappropriate Song",
    "date": "November 14, 2002 ",
    "episode": "E07",
    "season": ""
  },
  {
    "description": "Rachel's sister Amy (Christina Applegate) shows up and stays for Thanksgiving Dinner. With her arrival a big fight starts over who will get Emma if, hypothetically, Rachel and Ross were to pass away. Meanwhile, Monica obsesses over her expensive china plates and Phoebe tries to teach Joey how to lie.",
    "title": "The One with Rachel's Other Sister",
    "date": "November 21, 2002 ",
    "episode": "E08",
    "season": ""
  },
  {
    "description": "On a girls night out with Phoebe, Rachel gives a guy her phone number, but instantly regrets it after realizing she would need to move on from Ross. Joey thinks Monica is having an affair when Chandler claims he needs to work, as he does not want to lie to Joey about wanting to spend time with Monica, rather than going to a game with him. While Phoebe and Rachel are out, Ross invites Mike to hang out, but as Mike doesn't want to talk about his divorce and Ross hasn't got his keyboards with him, they realize they have little in common.",
    "title": "The One with Rachel's Phone Number",
    "date": "December 5, 2002 ",
    "episode": "E09",
    "season": ""
  },
  {
    "description": "Chandler, stuck in Tulsa and forced to work on Christmas Eve, is alarmed when a female co-worker Wendy (Selma Blair, \"the second prettiest girl in Oklahoma\") makes a pass at him. Deciding enough is enough, he quits his job and makes it home to Monica and his friends for Christmas. This story serves as a framing device for the fifth of Friends' six clip shows.",
    "title": "The One with Christmas in Tulsa",
    "date": "December 12, 2002 ",
    "episode": "E10",
    "season": ""
  },
  {
    "description": "\nRachel returns from maternity leave early when she finds out Ralph Lauren has hired a temp as her replacement, and she fears he might have the job permanently. Meanwhile, Phoebe works as an extra on Days of our Lives.\nSpecial Guest: Phill Lewis & Dermot Mulroney",
    "title": "The One Where Rachel Goes Back to Work",
    "date": "January 9, 2003 ",
    "episode": "E11",
    "season": ""
  },
  {
    "description": "Phoebe adopts an orphaned rat family. Ross and Rachel hire a new nanny – Molly (Melissa George), but Ross becomes worried when Joey starts hitting on her. Rachel continues to quarrel with Gavin, but at her birthday party, kisses him on Monica and Chandler's balcony. Unbeknownst to her, Ross, while caring for Emma, sees this and is shocked. Guest Stars Dermot Mulroney as Gavin",
    "title": "The One with Phoebe's Rats",
    "date": "January 16, 2003 ",
    "episode": "E12",
    "season": ""
  },
  {
    "description": "Phoebe suggests that Monica sing at Mike's piano bar. After some doubt, Monica does. The audience loves her but only because when the light is on her they can see her breasts as she isn't wearing a bra. Meanwhile, an angry paranoid Ross is thinking Rachel is moving on 'without the courtesy of telling', tries desperately to find a date. Rachel, wanting to talk with Ross, realizes their situation isn't working and decides to move back in with Joey, taking Emma with her.",
    "title": "The One Where Monica Sings",
    "date": "January 30, 2003 ",
    "episode": "E13",
    "season": ""
  },
  {
    "description": "\nTo get Ross and Rachel to realize they're perfect for each other, Phoebe and Joey set them up on bad blind dates.\nGuest starring Sam Pancake as the waiter. Jon Lovitz as Steve.",
    "title": "The One with the Blind Dates",
    "date": "February 6, 2003 ",
    "episode": "E14",
    "season": ""
  },
  {
    "description": "\nPhoebe and Ross get mugged by one of Phoebe's old friends from the street (Kyle Gass), and Ross finds out that Phoebe was the person who had mugged him when he was a teenager. Meanwhile, Chandler gets a job in an advertising internship, but feels out of place due to his age. Joey auditions for a play starring Leonard Hayes (Jeff Goldblum), but must go to painful extremes to get the part.\nSpecial Guest: Phill Lewis",
    "title": "The One with the Mugging",
    "date": "February 13, 2003 ",
    "episode": "E15",
    "season": ""
  },
  {
    "description": "Chandler and Monica each ask Joey for a loan behind each others back. When Chandler learns Monica asked Joey for money, even though he said that Bings never borrow money, Joey claims Monica needed the money for a boob job. Rachel tries to baby-proof the apartment but realizes she can't. Mike tells Phoebe that he never wants to marry again, which leads Phoebe to question if they should live together.",
    "title": "The One with the Boob Job",
    "date": "February 20, 2003 ",
    "episode": "E16",
    "season": ""
  },
  {
    "description": "Ross and Chandler post false information about each other on their college's alumni website, resulting in Chandler posted as being gay while Ross is dead. Meanwhile Joey and Emma fight over Joey's 'bedtime penguin pal' Hugsy. Phoebe asks Monica to help her get over Mike.",
    "title": "The One with the Memorial Service",
    "date": "March 13, 2003 ",
    "episode": "E17",
    "season": ""
  },
  {
    "description": "\nThe gang buys lottery tickets and fight over how to divide them up. Chandler waits for a promotion, while Rachel and Ross anticipate Emma's first word.\nSpecial Guest: Phill Lewis",
    "title": "The One with the Lottery",
    "date": "April 3, 2003 ",
    "episode": "E18",
    "season": ""
  },
  {
    "description": "After seeing him practice a scene from Days of Our Lives and watching the filming of it, Rachel develops feelings for Joey. Phoebe performs at Monica's restaurant, much to Monica's dismay. Chandler plans a weekend away in Vermont with Monica, but has to take Ross instead.",
    "title": "The One with Rachel's Dream",
    "date": "April 17, 2003 ",
    "episode": "E19",
    "season": ""
  },
  {
    "description": "\nWhile Rachel is in the same position as Joey was a year ago, Joey holds a Days of our Lives party for the cast, but doesn't want any of his friends to come. Ross gets a crush on another professor, Charlie (Aisha Tyler), who has only ever dated \"Nobel Prize\" winners. He and Rachel catch her and Joey kissing at the party.\nGuest star: Alex Borstein",
    "title": "The One with the Soap Opera Party",
    "date": "April 24, 2003 ",
    "episode": "E20",
    "season": ""
  },
  {
    "description": "\nChandler and Monica undergo fertility testing and are surprised when they encounter Janice. Rachel makes an appointment at a massage place, Phoebe tells her the place is horrible and rips up Rachel's certificate. Rachel tapes the certificate back together and goes to the massage place against Phoebe's wishes, but she doesn't know that Phoebe actually works there. Joey needs help advancing in his relationship with Charlie, and turns to Ross for advice.\nGuest star: Maggie Wheeler",
    "title": "The One with the Fertility Test",
    "date": "May 1, 2003 ",
    "episode": "E21",
    "season": ""
  },
  {
    "description": "After finding out they're both infertile, Chandler and Monica search for a sperm donor, but, after interviewing a potential donor, even though he is suitable — Chandler describes him as 'Spermtastic!' — they realize they don't want a donor, so look to adoption. Phoebe finds out about Rachel's feelings for Joey when she and Rachel take Charlie shopping, and Rachel fears Charlie heard that she likes Joey. While getting ready to go to Mike's sister's party, Phoebe meets David, the scientist guy, again. Ross has an interview for a conference in Barbados. Hank Azaria and John Stamos guest star.",
    "title": "The One with the Donor",
    "date": "May 8, 2003 ",
    "episode": "E22",
    "season": ""
  },
  {
    "description": "The gang goes to Barbados for Ross's conference. David (Hank Azaria), Phoebe's Scientist Guy, almost proposes to her – but her ex-boyfriend Mike does so before he gets the chance. Ross and Charlie find they have a lot in common. Rachel and Joey get even closer. Monica's hair reacts to the humidity. Joey and Charlie break up when he realizes they have nothing in common. He later sees Charlie and Ross kissing, and so he kisses Rachel. Monica and Mike play ping-pong to the distaste of Chandler and Phoebe.",
    "title": "The One in Barbados",
    "date": "May 15, 2003 ",
    "episode": "E23",
    "season": ""
  },
  {
    "description": "\nRachel and Joey decide to talk to Ross about their relationship, while Ross tries to talk to Joey about his relationship with Charlie. Ross confesses his relationship to Joey but Joey chickens out. Ross later walks in on Rachel and Joey kissing. Monica has her hair done in cornrows to get rid of her frizzy hair but Chandler absolutely hates it. Monica finally comes around to Chandler's way of thinking when she gets her hair caught on the shower curtain. Phoebe finds out that Mike has been seeing a woman named Precious (Anne Dudek) for the past few months and now needs to break up with her. Phoebe waits for Mike to return from his break-up but finds herself breaking-up for him when Precious shows up at Mike's apartment.\nNote: Originally aired as a 48-minute episode.",
    "title": "The One After Joey and Rachel Kiss",
    "date": "September 25, 2003 ",
    "episode": "E01",
    "season": "S10"
  },
  {
    "description": "Monica and Chandler are having a lot of trouble figuring out the adoption process so Phoebe sends them to a couple who have adopted. Monica and Chandler meet them and Monica instantly gets along with the woman (Kellie Waymire), however later Chandler casually mentions to their son (Daryl Sabara) that he was adopted only to find out that he didn't know this fact. He then pays the child to not tell his parents but of course, he tells. Rachel and Joey think Ross might have problems with their new relationship but he assures them he's fine. Ross invites Rachel and Joey on a double-date with him and Charlie. They agree but Ross gets drunk at the awkward date. Joey stays with Ross overnight to make sure he's okay and they talk. Ross realizes that he has been apart from Rachel for so long that he shouldn't stop Joey and Rachel's relationship. He does give Joey his blessing even though it still hurts him because they should see where the relationship is going. Phoebe hangs out with Frank Jr. (Giovanni Ribisi) and the triplets. The kids are driving Frank Jr. crazy and he offers Phoebe one of them. He comes to the realization that he could not possibly give up any of the children so Phoebe offers to babysit so Frank Jr. and Alice will have more time to relax. The episode ends with Chandler accidentally revealing to the triplets that Phoebe gave birth to them.",
    "title": "The One Where Ross is Fine",
    "date": "October 2, 2003 ",
    "episode": "E02",
    "season": ""
  },
  {
    "description": "After Ross sees Monica's tan, he decides to get a spray-on tan. After hearing seemingly straight-forward instructions, he gets confused and accidentally gets a double dose on the front of his body and nothing on his back. Through a series of mishaps he gets more spray tan on his front until he is incredibly dark. Rachel and Joey attempt to take their relationship to the next level but Joey ends up injured in a manly way while Rachel can't seem to get out of her clothes. Joey and Rachel ultimately decide to stay friends. Monica and Phoebe try to \"cut out\" an old friend from the building when she visits from England (Jennifer Coolidge).",
    "title": "The One with Ross's Tan",
    "date": "October 9, 2003 ",
    "episode": "E03",
    "season": ""
  },
  {
    "description": "Ross and Rachel throw a birthday party for Emma and desperately want everyone to be there for it. Everyone has prior commitments: Chandler and Monica have a romantic weekend planned, Phoebe has a client, and Joey has an audition. Ross's parents show up and the group begins celebrating. Rachel soon realizes the cake is not a bunny, as planned, but an erotic image with her daughter's picture on it. She goes off to get it fixed but Ross needs to go get her. Phoebe, Joey, Chandler and Monica battle to see who can leave with Monica and Chandler being left behind. Luckily everyone gets back before Rachel and Ross and Emma's birthday is celebrated just as Rachel envisioned.",
    "title": "The One with the Cake",
    "date": "October 23, 2003 ",
    "episode": "E04",
    "season": ""
  },
  {
    "description": "\nRachel's sister Amy (Christina Applegate) shows up at Ross's looking for Rachel and Rachel quickly learns she plans to marry her ex-boyfriend's father. Rachel takes her in, much to Joey's chagrin, and tries to help her get her life together. Amy offers to baby-sit Emma, who she calls Ella, but messes up by getting Emma's ears pierced. Rachel is incredibly upset but eventually her and Amy come to an understanding when Rachel finds out her other sister, Jill, is now fat. Mike attempts to propose to Phoebe on the big screen but Phoebe tells him how lame that is when another couple gets engaged that way. Phoebe tries to fix it by proposing to him on the big screen but Mike gets laughed at. Mike finally proposes at a restaurant and Phoebe accepts. Monica and Chandler ask Rachel to write a letter of recommendation for them to their adoption agency but Joey feels left out. They ask Joey but he tries to write the letter using big words, only for Joey to use a thesaurus to a ridiculous degree (to the point that he refers to himself as a baby kangaroo). He finally re-drafts the letter but gives the handwritten letter to the agency before Monica and Chandler can approve it. The agency thinks a child has written the letter and love it.\nNote: Originally aired as a 43-minute episode.",
    "title": "The One Where Rachel's Sister Babysits",
    "date": "October 30, 2003 ",
    "episode": "E05",
    "season": ""
  },
  {
    "description": "Ross applies for a paleontology grant – and finds out Charlie's ex-boyfriend – Benjamin Hobart (Greg Kinnear) reviews the applications. Ross and Charlie have dinner with him and it becomes obvious, Benjamin still has feelings for her. During the interview, Benjamin sabotages Ross's application by not asking him any paleontological questions. Ross is upset so he informs Charlie and Charlie doesn't believe him. Benjamin confesses his feelings to Charlie and his ploy to get her back. Charlie reveals she still has feelings for Benjamin and breaks up with Ross. Phoebe is getting rid of things so Mike can move in but is sad to part with her artwork, Gladys. Monica pretends to like it but secretly hates it. Phoebe gives it to her but Monica and Rachel fight over who should have it since Phoebe thinks they both want it. She makes another artwork Glynis which Monica keeps while Rachel keeps Gladys. Joey wants Chandler to get him a job in a commercial Chandler is working on but Chandler doesn't think he's right for the part. Chandler lies to Joey but Joey catches him in the lie. Chandler makes it up to Joey by wearing blue lipstick from the Japanese commercial Joey did.",
    "title": "The One with Ross's Grant",
    "date": "November 6, 2003 ",
    "episode": "E06",
    "season": ""
  },
  {
    "description": "Monica and Chandler are worried about the adoption agency interviewer when they learn Joey slept with her and never called her back. They keep assuring her they are not friends with Joey. Joey climbs up the fire escape to check on Chandler and Monica when they won't open the door. Joey pretends he was heartbroken since the interviewer never called him and successfully convinces her of that idea. Phoebe and Mike are hesitant to spend such a large amount of money on their wedding and agree to marry at City Hall with the money donated to charity. They have a change of heart and take the money back but then are guilt-ridden. Eventually the charity rejects their donation and tells them to have a good wedding. Ross tries to help Rachel get over her fear of swings while she helps him get over his fear of spiders.",
    "title": "The One with the Home Study",
    "date": "November 13, 2003 ",
    "episode": "E07",
    "season": ""
  },
  {
    "description": "Monica and Chandler decide not to host Thanksgiving but Phoebe convinces them to by appealing to Monica's competitive nature. Chandler helps out for the first time by making Cranberry sauce and surprisingly, Monica lets him. Rachel and Phoebe enter Emma in a beauty pageant and win while Ross and Joey go to a Rangers game and as a result all four are nearly an hour late. Angry that nobody turned up on time when they didn't want to host the meal to begin with, Monica and Chandler lock the door and refuse to let anyone in. Everyone manages to get their heads in the door but no further due to the chain being bolted, and eventually Joey gets stuck and is sent flying into the food when the door breaks. However the argument is forgotten when Monica and Chandler get a call telling them a girl from Ohio has picked them to adopt her baby and everyone sits down for a belated Thanksgiving.",
    "title": "The One with the Late Thanksgiving",
    "date": "November 20, 2003 ",
    "episode": "E08",
    "season": ""
  },
  {
    "description": "Monica and Chandler fly to Ohio to meet the birth mother, Erica (Anna Faris), of their prospective child. It becomes clear very quickly their files have been mixed up since Erica thinks Chandler is a doctor and Monica is a minister. They go along with the lie but Chandler feels guilty. He soon convinces Monica to come clean which causes Erica to reject them. Chandler catches up to Erica and convinces her to still consider them. He tells her about their jobs and how much Monica wants this child and he feels horrible that he cannot give his wife this one thing. Erica decides they are the right couple and decides they can adopt her baby. Meanwhile, Joey is set up with one of Phoebe's friends (Annie Parisse) but has problems on the date when she keeps eating off of his plate. Rachel and Phoebe take Ross shopping for clothes but Rachel and Ross's bags get switched. Ross doesn't realize he's wearing a woman's sweater and is incredibly comfortable in it, only to go on a date with a woman which comes to a very quick end when she wears the same garment.",
    "title": "The One with the Birth Mother",
    "date": "January 8, 2004 ",
    "episode": "E09",
    "season": ""
  },
  {
    "description": "Rachel and Phoebe see Chandler getting into a car with another woman. He dodges their questions by pretending to be at work but they follow him to the suburbs and find them entering a house. They believe he is cheating on Monica and tell Ross and Joey. The four of them tell Monica but Monica doesn't react the way they thought she would. It soon comes out they are looking to buy a house in the suburbs to raise their family (the woman having been their realtor). The group tries to convince them to stay in the city while reminiscing about the past few years. In the end Monica and Chandler get the house and tell everyone they are moving right after giving them gifts.",
    "title": "The One Where Chandler Gets Caught",
    "date": "January 15, 2004 ",
    "episode": "E10",
    "season": ""
  },
  {
    "description": "\nMonica and Rachel throw Phoebe a bachelorette party but Phoebe is disappointed there is no stripper. Rachel and Monica hire a male stripper (Danny DeVito) at the last minute; but when he gets there, Phoebe insults him. He begins to cry. Ross and Chandler attend their college reunion and remember the girl they made a pact not to date. Ross makes his move but discovers Chandler used to make out with her all the time. Chandler informs Ross that he broke the pact as well but with a different girl (Kimberley Davies) at a party. At the same party, Monica and Rachel were visiting and Chandler made-out with Rachel to get back at Ross. Ross is upset because this is also the night of the first kiss between him and Rachel but later finds out he actually kissed Monica. Joey is a guest star on the television game show Pyramid and does horribly. Joey nearly redeems himself in the final round but messes up on the final question.\nNote: Originally aired as a 42-minute episode. Guest stars Ellen Pompeo and Donny Osmond",
    "title": "The One Where the Stripper Cries",
    "date": "February 5, 2004 ",
    "episode": "E11",
    "season": ""
  },
  {
    "description": "\nPhoebe's wedding to Mike is nearly upon the gang, and wedding planner Monica is going overboard much to everyone's irritation. Eventually it gets too much for Phoebe who fires her intending to do the job herself. Meanwhile Phoebe has also asked Joey to give her away, causing him to give Mike more than a few warnings about Phoebe's welfare. Ross and Chandler also find they're not part of the wedding party but compete when one of Mike's groomsmen drops out and he offers to let one of them fill the position. A freak blizzard hits New York and it becomes obvious the wedding will have to be postponed, but Phoebe and Mike decide to get married outside with a still-ordained Joey acting as minister and Phoebe rehires Monica knowing she can pull it all off in time. Mike tells Ross and Chandler that he's decided to allow his family dog to fill in the vacant groomsman position but still needs one of them to walk the dog down the aisle and Chandler's fear of dogs allows Ross to fill the role only while Chandler fills in for Joey giving Phoebe away. In the end, everything works out and Phoebe has the wedding of her dreams in the snow-filled street outside Central Perk.\nNote: Originally aired as a 42-minute episode.",
    "title": "The One with Phoebe's Wedding",
    "date": "February 12, 2004 ",
    "episode": "E12",
    "season": ""
  },
  {
    "description": "Phoebe tries to teach Joey how to speak French for a play. Rachel's dad has a heart attack, so she goes to Long Island, accompanied by Ross, to visit him, which leads Rachel to want sympathy sex with Ross, but he turns her down since he thinks it's not a good idea. Rachel, the next morning, becomes mad at Ross because of this and he says they should never have sex again, saying it's \"off the table\". Back in the city, Rachel again thanks Ross for coming with her and the two comment about their history of sleeping together. Rachel says for her and Ross, it's \"never off the table\", confusing him and he leaves. Meanwhile, Erica, the birth mother, comes for a visit and reveals that the father of her baby may be a shovel killer, which is not the case as the father is another guy she slept with.",
    "title": "The One Where Joey Speaks French",
    "date": "February 19, 2004 ",
    "episode": "E13",
    "season": ""
  },
  {
    "description": "Rachel has an interview in a restaurant for Gucci however her boss from Ralph Lauren catches her when he ends up at the next table and she ends up fired, with her erratic behaviour in front of the Gucci representative (Brent Spiner) causing her to not get that job either. By a twist of fate she bumps into her old colleague Mark from Bloomingdale's who arranges for her an interview which she passes, only for the job offer to be from Louis Vuitton in Paris. Newly married Phoebe tries to change her name to Phoebe Hannigan, but learning she can change her name to whatever she wants, she changes it to Princess Consuela Bananahammock, but insists her friends call her Valerie. Mike is angry and decides to make a point by changing his name to Crap Bag. Eventually Princess Consuela gets it and changes her name again to Phoebe Buffay-Hannigan. Meanwhile, Monica and Chandler plead with a depressed Joey to see their new prospective house, and he meets an eight-year-old girl (Dakota Fanning) who makes him realize he needs to let them go.",
    "title": "The One with Princess Consuela",
    "date": "February 26, 2004 ",
    "episode": "E14",
    "season": ""
  },
  {
    "description": "Joey's agent Estelle dies, but the group doesn't want to tell him as with all the changes within the group recently could cause this one to 'push him over the edge'. Phoebe impersonates Estelle's voice and pretends to still be alive to try to get Joey to fire her, but Joey ends up terrified when he gets a phone call from 'Estelle' after learning about her death. While being shown their new home by their realtor (Jane Lynch), Monica and Chandler are horrified to find that Janice (Maggie Wheeler) is considering buying the house next door to them, leading Chandler to take drastic measures to ensure she doesn't move in. Ross tries to get Rachel her old job back so she won't have to move to Paris. However when he succeeds, Rachel becomes upset that, although she won't have to leave her friends, she won't be able to visit the 'Fashion Capital of the World'. In the end, Ross persuades her to do what she wants to do.",
    "title": "The One Where Estelle Dies",
    "date": "April 22, 2004 ",
    "episode": "E15",
    "season": ""
  },
  {
    "description": "As Erica arrives in New York to prepare for the baby's birth, the gang hold Rachel's going away party, during which gives each of her friends an individual goodbye moving them all to tears, except Ross leaving him hurt and wondering why she doesn't say goodbye to him. Rachel later reveals to Ross that with their history, it would be too hard for her to say goodbye to him and the emotional argument leads to them sleeping together. Monica and Chandler start packing up their apartment and Chandler finds a pair of handcuffs and tries to find out who they belong to. Erica goes into labor, leading Chandler and Monica to rush her to the hospital.",
    "title": "The One with Rachel's Going Away Party",
    "date": "April 29, 2004 ",
    "episode": "E16",
    "season": ""
  },
  {
    "description": "\nAfter having sex with Ross, Rachel says it was 'the perfect way to say goodbye', and he realizes he is still in love with her. Phoebe and Joey pack Monica and Chandler's belongings as the couple accompany Erica to the hospital. Ross and Phoebe race to the airport to tell Rachel of his feelings – but she gets on the plane anyway. Meanwhile, Erica gives birth to twins which Chandler and Monica name Jack and Erica. Still on the plane, contemplating Ross' plea, Rachel has a change of heart. She leaves the plane and goes to Ross' apartment to tell him that she loves him. After years of separation, the two finally get back together for good, saying \"this is it\", hinting they will marry after the series (which is revealed to be true in the spin-off, Joey). Back in Monica's apartment, the friends turn in their keys and go out for their last cup of coffee together as a group. The series ends with the friends leaving and a camera panning the apartment and the city.\nRecording Date: January 23, 2004 (Part Two)",
    "title": "The Last One",
    "date": "May 6, 2004 ",
    "episode": "E17",
    "season": ""
  }
]