[
  {
    "description": "\nRookie detective James Gordon and his partner Harvey Bullock are assigned to the case of the murders of Thomas and Martha Wayne, witnessed by street petty criminal Selina Kyle. Their investigation leads them to a parolee named Mario Pepper, whom Bullock kills in Gordon's defense. They discover that Pepper had been framed, leading them to mobster Fish Mooney, an associate of Carmine Falcone, an organized crime boss. Mooney has them captured, but Falcone spares them upon his arrival, revealing that he intended to end the case so that the people of Gotham could feel safe, facilitating his illegal activities. In exchange, Falcone orders Gordon to kill Oswald Cobblepot, a low-level member of Mooney's gang and informant for Gotham Major Crimes Unit (MCU) investigators Renee Montoya and Crispus Allen. Gordon fakes Cobblepot's death, and tells him never to return to Gotham. Gordon promises the Waynes' son, Bruce, and his butler, Alfred Pennyworth, to find the real killer. Cobblepot kills a fisher. Selina is seen watching the Wayne Manor. Meanwhile, Montoya threatens Barbara, Gordon's fiancee, to tell him about Barbara's unknown past.",
    "title": "Pilot",
    "season": "S01",
    "episode": "E01"
  },
  {
    "description": "\nGordon and Bullock start investigating the abductions of street kids by Patti and Doug, operatives of Dr. Francis Dulmacher, A.K.A. the Dollmaker,[8][9][10] and have been posing as members of the Mayor's Homeless Outreach Program. Mayor Aubrey James announces plans to help Gotham's homeless kids, rounding them up and shipping them out of town. Patti and Doug hijack one of the buses of street kids, including Selina. After Bullock's extreme interrogation of an informant, Gordon obtains a clue. Gordon and Bullock arrive and catch Patti and Doug while encountering Kyle. While Bruce has plans to find a way to help the children, Gordon meets with Kyle who states that she has been watching him during his visits with Bruce and might have some information on the person who shot the Waynes. Meanwhile, Cobblepot kills two men after they mock his walking pattern. He takes refuge in a rented trailer after his faked death, plotting his return to Gotham City, having kidnapped a teenager for ransom. Falcone confronts Mooney for her plans to overthrow him, having heard from Cobblepot. The former warns her by having her lover beaten. Allen and Montoya investigate Cobblepot's mother.",
    "title": "Selina Kyle",
    "episode": "E02",
    "season": ""
  },
  {
    "description": "\nGordon and Bullock track a vigilante who targets corrupt Gotham officials and nicknamed \"Balloonman\" for strapping his victims to weather balloons, which eventually implode in the cold atmosphere, giving the victim a long fall. Montoya and Allen question Gordon about Cobblepot, who returns to Gotham to get revenge on Mooney. He gets a job at Don Sal Maroni's restaurant, and is befriended by Maroni himself. Mooney arranges for Falcone's lover Natalia to be disfigured in response to her own lover's beating. Gordon realizes that \"Balloonman\" is social worker Davis Lamond, who was driven to vigilantism because of corrupt officials refusing to aid children on the streets. After arrest, he warns Gordon that more vigilantes will follow in his path. Falcone tells Mooney that he will investigate what happened to Natalia, also telling about the Arkham Plan. At his apartment later, Gordon receives a surprise visit from Cobblepot. Meanwhile, Barbara is revealed to be an addict and Montoya's former girlfriend. Selina is given to Gordon for his investigation; but she uses the chance to escape.",
    "title": "The Balloonman",
    "episode": "E03",
    "season": ""
  },
  {
    "description": "\nCobblepot offers Gordon help in stopping the future war. The latter learns of the Arkham Plan from Alfred, who states that Falcone and Mayor James are backing the project that will improve the Arkham District, opposed by Maroni, who has another plan. An independent hitman starts targeting the city council members involved in both opposing sides of the Plan. After an armed robbery of Maroni's restaurant, Cobblepot is promoted to restaurant manager by Maroni, following the former's action of saving a bag of money and the death of the previous manager. Mooney pits two female singers against each other for her nightclub job opening, with the winner being Liza. In order to prevent the war, Mayor James holds a conference about a compromise on the Arkham Plan, that Falcone will handle small housing development projects and Maroni will be refurbishing the Asylum. Gordon urges Bruce not to lose hope in the city. Later, Cobblepot fatally poisons the restaurant robbers, who are revealed to had been hired for just that purpose by Cobblepot himself. Meanwhile, Barbara confronts Gordon about Cobblepot, telling him about her past with Montoya. She decides to end the engagement when he refuses to talk.",
    "title": "Arkham",
    "episode": "E04",
    "season": ""
  },
  {
    "description": "\nBruce plans to find a way to speak to the board members of Wayne Enterprises to learn their connections to the Arkham District Project. A new drug called \"Viper\", a prototype of Venom, is hitting the street, endowing the user with super-strength, but eventually killing them. Maroni plans to rob a casino owned by Falcone, and Cobblepot offers a less-casualty plan, forcing him to reveal his past, which Maroni believes after Gordon confirms it. The latter learns that \"Viper\" is being distributed at a charity event held by WellZyn and Wayne Enterprises. Gordon shoots the canister on the roof and former WellZyn employee Stan Potolsky is exposed, committing suicide after he suggests they check out Warehouse 39, where Gordon and Bullock later find nothing, observed by Wayne Enterprises operative Mathis. Maroni successfully robs the casino, admiring Cobblepot. As Mooney makes plans to conspire against Falcone with her lover and Russian mob boss Nikolai, a disguised Liza visits Falcone and begins seducing him.",
    "title": "Viper",
    "episode": "E05",
    "season": ""
  },
  {
    "description": "\nTen years ago, a masked killer calling himself the \"Spirit of the Goat\" targets the firstborn of Gotham's elite, leading Bullock and his partner Dix to investigate the case. They find the killer, Randall Milkie, who is shot down by Bullock after Dix falls through a trap door and ends up badly injured. In the present day, Bullock finds another elite firstborn murdered by someone with the same \"Goat\" motive. Upon surgery, Bullock sees Milkie's trademark, which only he and Dix knew, meaning that he was not an copycat. During a debrief, Dix tells Gordon about Bullock's enthusiasm for justice, to Gordon's surprise. Bullock deduces that hypnotherapist Marks coerced both Milkie and the new killer to become the Goat to scare Gotham's rich and corrupt, leading to Marks' arrest. The \"murder\" of Cobblepot is also investigated, with Gordon the prime suspect as Montoya and Allen finally find a witness near the river. When they attempt to arrest Gordon and Bullock, Cobblepot enters the precinct, causing friction between Bullock and Gordon. Meanwhile, CSU operative Nygma is revealed to be in love with archivist Kristen Kringle, who ignores him. Selina infiltrates the Wayne Manor and steals a component of Bruce's investigation.",
    "title": "Spirit of the Goat",
    "episode": "E06",
    "season": ""
  },
  {
    "description": "\nExonerated, Gordon tells Barbara to leave Gotham. Cobblepot leads Maroni enforcer Frankie Carbone and two other henchmen to Nikolai's hideout, killing the latter and Carbone by buying the loyalties of the henchmen. Montoya and Allen begin cooperating with Gordon. The escalating mob war is settled with a land trade between Maroni and Falcone. A drunken Bullock re-evaluates his choice for helping Gordon, and the two partners attempt to arrest Mayor James and Falcone, but they give up when it is revealed that Falcone and hitman Victor Zsasz have Barbara, who had returned to try and negotiate with Falcone for Gordon. Falcone allows the trio to leave. In a flashback to the night they had met Gordon, it is shown that Cobblepot and Falcone had formed a deal, in which Falcone would place Gordon in charge of killing Cobblepot, giving Cobblepot a chance at surviving, and in exchange, Cobblepot would forge an alliance with Maroni, snitching for Falcone; and Cobblepot told Falcone about Mooney and Nikolai and their plan. It is revealed that Falcone spared Gordon's life due to Cobblepot's request.",
    "title": "Penguin's Umbrella",
    "episode": "E07",
    "season": ""
  },
  {
    "description": "\nBruce returns to school, where he has some trouble with bully Tommy Elliot; and Alfred agrees to teach the former how to fight. Gordon and Bullock investigate Richard Sionis, who is hosting an illegal and deadly fight club where the champions are accepted for Sionis Investments. Liza's loyalty to Mooney begins to falter when she learns of the latter's plan to eventually kill Falcone, but Mooney presses her to steal a ledger from the Falcone's office that may be used to incriminate him. When Gordon is caught at the site of the fight club, Bullock persuades other officers, who collectively despise Gordon due to blaming them for leaving him during Zsasz' attack, to help find Gordon. Mooney fakes a story about her past to convince Liza to stay on the mission. After Sionis and those involved are arrested, Gordon learns that Selina was apprehended after skillfully robbing a dress store. Barbara leaves Gordon. Cobblepot learns from Mooney's henchman of a spy close to Falcone.",
    "title": "The Mask",
    "episode": "E08",
    "season": ""
  },
  {
    "description": "\nGordon has Selina placed at Wayne Manor for her safety. She and Bruce establish a friendship. She claims that her mother is an intelligence agent. During a prison transport from Blackgate Penitentiary to St. Mark Psychiatric Hospital, bomb maker Ian Hargrove is taken by the Russian mob, who are working against Falcone following Nikolai's death. Gordon meets with Harvey Dent, who suspects tycoon Dick Lovecraft for the Wayne murders. Gordon and Bullock realize that Hargrove intends no harm. Manipulated by Mooney, the Russians target Falcone's cache of money, but when a police standoff ensues, the Russians' armored truck explodes via remote control by Mooney's enforcer, Butch Gilzean. Cobblepot confronts Liza for spying on Falcone, whom the former claims will not tell. Mayor James announces his plans to reopen Arkham Asylum to house the mentally ill criminals, including Hargrove. Barbara is revealed to have a new relationship with Montoya.",
    "title": "Harvey Dent",
    "episode": "E09",
    "season": ""
  },
  {
    "description": "\nAssassins led by Copperhead[19][20][21] infiltrate Wayne Manor, but Bruce and Selina escape into the city. Alfred seeks Gordon and Bullock's help to find the pair. Dent suspects that Lovecraft hired the assassins to cover his tracks. However, Gordon learns Lovecraft is also being targeted to hide what he knows; the assassins kill Lovecraft in a staged suicide, planting Gordon's gun at the scene. Following the armory fiasco, Cobblepot tells Falcone that Mooney has a mole in his ranks, but does not reveal the identity. Selina determines the assassins are after her, and she and Bruce encounter Ivy Pepper.,[22] Mario's daughter. The assassins find Selina and Bruce, but she escapes while Bullock and Alfred, who convinces Mooney to help, arrive and rescue Bruce. Selina later kisses Bruce and returns to living on the streets. Following Lovecraft's \"suicide\", Mayor James reassigns Gordon as a security guard at Arkham Asylum.",
    "title": "Lovecraft",
    "episode": "E10",
    "season": ""
  },
  {
    "description": "\nWhile working at Arkham run by Dr. Gerry Lang, Gordon investigates a series of attacks on inmates with the help of Dr. Leslie \"Lee\" Thompkins. Mooney discusses her plan to overthrow Falcone with underboss Jimmy Saviano, who has a disagreement with her on succession. Cobblepot is arrested by the police for trying to further extort some fishermen already paying protection money to Maroni. The former is freed by the latter, who initiated the arrest to warn Cobblepot about hubris. Montoya ends her relationship with Barbara. Gordon, Bullock, and Captain Essen discover that the person attacking inmates was Jack Gruber,[24][25] who then escapes from Arkham with his associate Aaron Danzig, after killing several guards and Dr. Lang. Saviano tries to convince Gilzean to change sides, but the latter kills him instead. Selina takes an ill Ivy to Gordon's. Barbara calls and mistakes Ivy as his girlfriend.",
    "title": "Rogues' Gallery",
    "episode": "E11",
    "season": ""
  },
  {
    "description": "\nGruber and Danzig go on rampage through Gotham. Gordon promises Commissioner Loeb he will arrest Gruber within 24 hours. Nygma learns Gruber is a former Mafia bank robber who was betrayed by Maroni. Gordon and Bullock put Maroni under protective custody to use as bait to attract Gruber to the precinct. Gruber and Danzig attack, but Gordon thwarts them by shorting out Gruber's electrical apparatus with water. For living up to his end of the deal, Gordon is reinstated as a detective. Meanwhile, Mooney makes her move against Falcone by \"abducting\" Liza and extorting him into signing his crime family over to Mooney's gang. Falcone nearly goes through with the deal, but Cobblepot informs him that Liza is Mooney's mole. Falcone confronts Mooney, has his mercenaries take both her and Gilzean prisoner, and strangles Liza to death. Cobblepot inherits Mooney's nightclub and what's left of her gang. Barbara visits her estranged parents. Maroni begins suspecting Cobblepot. Gordon and Lee develop romance.",
    "title": "What the Little Bird Told Him",
    "episode": "E12",
    "season": ""
  },
  {
    "description": "\nMooney is tortured by Falcone's henchman, but Gilzean frees himself and rescues her. A homicide witness is murdered while under custody at GCPD. Gordon comes to suspect Narcotics Detective Arnold Flass is behind. Learning that Flass is supported by influential figures, Gordon asks Cobblepot for help, who tasks his enforcer, Gabe. Bruce asks Selina about his parents' murderer, but she reveals she lied about seeing the man's face to avoid being sent to juvenile detention. Nygma gives Kringle a romantic greeting card, but Flass finds it and mocks him; Kringle later apologizes to Nygma and admires the card. Gabe gives Gordon evidence that exposes Flass' involvement in the witness' death, and Flass is arrested. Gordon learns that Gabe threatened the family of Delaware, Flass's accomplice, for proof. Mooney and Gilzean confront Cobblepot at the nightclub, but Zsasz arrives and recaptures Gilzean. Mooney escapes decides to temporarily leave Gotham, with Bullock revealed as her lover.",
    "title": "Welcome Back, Jim Gordon",
    "episode": "E13",
    "season": ""
  },
  {
    "description": "\nGordon and Bullock investigate a serial killer who is targeting members of a phobia support group and extracting their adrenal glands. The killer turns out to be Gerald Crane, Jonathan's father; Gordon and Bullock are able to save one of his victims, but Crane evades capture. In light of Selina's recent claim of false witness, Bruce absolves Gordon of his promise to find the killer, intending to solve the case himself. Mooney informs Maroni about Cobblepot's treachery to him. Maroni tries to kill Cobblepot, who escapes. Nygma frames medical examiner Guerra for hoarding body parts after Guerra has him suspended for his repeated corpse probing. After Guerra's suspension and Nygma's reinstatement, Gordon informs Lee, who finds a clue in Crane's case, that a job has opened up for her as GCPD's medical examiner. Mooney is captured by mercenaries on a boat away from Gotham.",
    "title": "The Fearsome Dr. Crane",
    "episode": "E14",
    "season": ""
  },
  {
    "description": "\nGordon and Bullock investigate Gerald's background and learn his wife died in a fire that he was too scared to rescue her from; believing fear is a human flaw, he is now harvesting adrenal glands in order to create a serum that makes people confront and overcome their greatest fears. Bruce continues a yearly family tradition by going on a hiking trip in the woods, albeit alone for the first time. He finds himself unprepared for the dangers, but Alfred eventually joins him. Maroni speaks with Falcone and agrees to let Cobblepot live, but warns the latter that it will last until Falcone's eventual death. After using the serum on himself and overcoming his fear, Gerald injects Jonathan with a much larger dose. Gordon and Bullock arrive and kill Gerald in a gunfight. Jonathan is rushed to the hospital, but the serum has sent him into a state of constant terror, and he may never stop hallucinating his greatest fear: scarecrows. Mooney wakes up among other captives and befriends a man named Kelly. She kills the prisoners' leader and takes his place, learning that their captors are organ harvesters. Lee becomes the new medical examiner.",
    "title": "The Scarecrow",
    "episode": "E15",
    "season": ""
  },
  {
    "description": "\nBarbara returns to Gotham to find Ivy and Selina squatting in her apartment. Gordon and Lee investigate the murder of Lila Valeska, a snake dancer with Haly's Circus, and the contesting families Flying Graysons and the Lloyds are suspects. Gordon determines that Lila's son Jerome is the killer, which he eventually admits maniacally. When business begins to decrease at Cobblepot's club, Zsasz brings in a brainwashed Gilzean for help. Taking advice from Selina and Ivy, Barbara attempts to reunite with Gordon, but changes her mind after she sees him kissing Lee. Bruce holds a board meeting at Wayne Enterprises and voices concern to the executives that the company is involved with the mob, threatening with legal action. John Grayson and Mary Lloyd get engaged after the dispute between the two families are resolved. Mooney manages to get a meeting with the captors' boss after uniting the prisoners against the captors.",
    "title": "The Blind Fortune Teller",
    "episode": "E16",
    "season": ""
  },
  {
    "description": "\nAn armed group robs a bank, and one wearing a red mask throws some of the stolen money into the crowd to ensure their escape. Gordon and Bullock identify the \"Red Hood\" as Gus Floyd, but find him dead in the hideout. After a robbery led by Carl Destro, who now wears Floyd's mask, and the Hood becoming a public hero, Gordon and Bullock track him to his house where they find him wounded and the mask gone. With information given by Destro, the police find and kill the remainder of the gang in a shootout. A teenage boy steals the mask. Meanwhile, Cobblepot struggles from Maroni's actions against the restaurant, but Butch uses some fake policemen to seize Maroni's supplies. Mooney discovers that the facility is owned by Dulmacher, meeting the manager, who tries to take her eye for organ trade purposes; but she removes it herself and destroys it before passing out. An old comrade of Alfred, Reginald Payne, visits him in the Manor and stays over night. On the next day, however, he steals some of Bruce's files, stabs Alfred to evade capture and reports to the Board that Bruce has no solid evidence.",
    "title": "Red Hood",
    "episode": "E17",
    "season": ""
  },
  {
    "description": "\nAt the hospital, Alfred refuses to implicate Payne. Gordon and Dent investigate the sudden release and reinstatement of Flass by Loeb, who announces his support of Flass as the new president of the policemen's union. Bullock reveals that Loeb has leverage to blackmail most officers; in Bullock's case, Loeb forced him to falsely confess to providing illegitimate evidence against Flass. Investigating a triad bookmaking office and interrogating Loeb's former partner, Gordon learns that Loeb has ties with Falcone. With Cobblepot's help, Gordon and Bullock investigate Loeb's uptown farm, where they find the latter's psychotic daughter Miriam, who confesses to her mother's murder, which Gordon uses to terminate Bullock's case by blackmailing Loeb, who announces Gordon as the new candidate. Meanwhile, Mooney finally meets Dulmacher, who provides her with a blue-irised eye and allows her to prove herself in order to become his right hand woman. She surrenders some of the prisoners, including Kelly. She discovers that the facility is situated on a snowy island. Selina visits Bruce and offers her help in his investigation, which he refuses. Nygma learns that Kringle has a new boyfriend in the GCPD.",
    "title": "Everyone Has a Cobblepot",
    "episode": "E18",
    "season": ""
  },
  {
    "description": "\nDespite Gordon's warning, Bruce goes after Payne with Selina's help. Payne confesses that he was hired by the Board. Selina pushes Payne out a window after Bruce hesitates to do so, presumably killing him. Gordon and Bullock investigate an unsolved murder case. Upon Nygma discovering a painting of a broken heart as the key evidence, Bullock realizes that the serial killer called \"the Ogre\" is responsible. Harvey then states that everyone who tried to investigate the Ogre lost their loved ones. It is revealed that the Ogre keeps his victims prisoner for some time, until he realizes she is not a fit for his desire, so he kills her. Meanwhile, Oswald manages to convince a bar owner to do business, but his real intention is to kill Maroni in the bar. Mooney succeeds in escaping with Kelly and some other inmates by luring another group to a fatal deadend. She is shot during the takeoff by the \"Catcher\", the chief guard. It is revealed that Loeb had the case given to Gordon, but the latter decides to continue the investigation, knowing the threat upon Lee. Gordon promises Loeb that he will face justice too.",
    "title": "Beasts of Prey",
    "episode": "E19",
    "season": ""
  },
  {
    "description": "\nLee refuses to leave town, staying at the GCPD. The \"Ogre\" calls Gordon and makes his typical threat. Following the incident with Payne, Bruce and Selina attend Wayne Enterprises' Charity Ball with Barbara, where Selina copies keys from Sid Banderslaw, one of the executives who hired Payne. Cobblepot allies himself with Irish hitmen in hopes of killing Maroni, who visits the club and reveals to the former's mother that her son is a psychopathic killer. Nygma tries to protect Kringle from her abusive boyfriend Tom Dougherty, but goes too far when he stabs him to death and has a psychotic breakdown. Investigating the Ogre's first victim, Gordon, Bullock, and Essen identify the killer as Jason Skolimski, who illicitly inherited the fortune of a woman, whose butler is his father, who covered up the murder. Gordon learns that Jason saw him with Barbara at a charity event some time prior, meaning she is the target. Jason approaches Barbara at the Ball and takes her to his home, witnessed by Selina.",
    "title": "Under the Knife",
    "episode": "E20",
    "season": ""
  },
  {
    "description": "\nJason holds Barbara captive and forces her at knifepoint to choose his next victim. Nygma disposes of Dougherty's body and forges a letter from him saying a cold goodbye to Kringle. Bruce sneaks into Bunderslaw's office to open his safe, but Bunderslaw was expecting Bruce and has emptied it. He claims that Thomas knew of Wayne Enterprises' illegal activities but kept quiet. Junior executive Lucius Fox tells Bruce that Thomas did not approve of the company's crimes. Bruce confesses his and Selina's adventures, including Payne's death, to Alfred. Cobblepot sends the hitmen to attack Maroni, but is revealed to have set up the plan to frame Falcone and start a war between the two mob bosses. Gordon and Bullock locate Jason's apartment, but he and Barbara have already left for her parents' mansion. There, they find her parents dead, and Gordon kills Jason after a standoff. Later, Gordon reassures Lee that he no longer loves Barbara. Maroni begins attacking Falcone's men, and Essen calls all GCPD officers to remain on duty during the upcoming gang war.",
    "title": "The Anvil or the Hammer",
    "episode": "E21",
    "season": ""
  },
  {
    "description": "\nThe mob war between Falcone and Maroni escalates. Cobblepot attempts to kill Falcone himself and take his place, but Gordon intervenes. As Maroni's men approach, Gordon and Bullock bring Falcone, Cobblepot, and Butch to a safe house, but Mooney's new gang, including Selina, take them captive. Maroni arrives, but Cobblepot manipulates him and Mooney into a dispute over mob leadership. Mooney kills Maroni for slighting her. Gordon, Bullock, and Falcone escape in the ensuing chaos. While Butch struggles on whom to be loyal to, Cobblepot fights and throws Mooney off the roof into the water, calling himself Gotham's new crime lord. Barbara undergoes trauma counseling with Lee; she reveals she killed her parents and attacks Lee, who neutralizes her. Kringle begins suspecting Nygma's involvement in Dougherty's disappearance; and he is revealed to have a second personality. Falcone retires from the mob, urging Gordon to continue fighting crime. Believing his father led a secret life and remembering a subtle clue from Fox, Bruce discovers a hidden stairwell behind the fireplace.",
    "title": "All Happy Families Are Alike",
    "episode": "E22",
    "season": ""
  },
  {
    "description": "\nGordon is fired and Bullock resigns from the police. Gordon works with Cobblepot, now a crime boss, to force Commissioner Loeb to reinstate Gordon as a detective and resign as police commissioner in exchange for Gordon collecting a debt from someone and regretfully killing them to protect himself. Meanwhile, several inmates of Arkham Asylum including Barbara Kean, Aaron Helzinger, Jerome Valeska, Arnold Dobkins, Richard Sionis and Robert Greenwood are broken out of the asylum by Theo Galavan (James Frain) and his sister/enforcer, Tabitha Galavan (Jessica Lucas). All but Sionis agree to join forces with Galavan; Sionis is strangled to death for his refusal. Bruce and Alfred discover a secret room at the end of the staircase.",
    "title": "Damned If You Do...",
    "episode": "E01",
    "season": "S02"
  },
  {
    "description": "\nBruce  fires Alfred when the latter interferes with his exploring his father's computer, but changes his mind when Alfred agrees to physically train him so he can confront his parents' killer. Galavan kidnaps the mayor and his group of \"Maniax\" begin a public murder spree for the sake of publicity. The Maniax attack GCPD and kill several police officers, including Essen; Nygma is wounded saving Miss Kringle during the massacre. Following this, Bullock rejoins the force to stop the Maniax.",
    "title": "Knock, Knock",
    "episode": "E02",
    "season": ""
  },
  {
    "description": "\nGordon and Bullock search for Jerome, but discover Paul Cicero (Jerome's father) already murdered, Galavan reveals that his family built Gotham and he is seeking revenge on those who tarnished his family name. Galavan attends a charity event that Alfred, Bruce and Leslie Thompkins also attend, which turns out to be an elaborate ruse wherein Galavan kills Jerome and is perceived to be a hero; he announces his candidacy for mayor. Several Gotham citizens see Jerome's actions on television and begin having mental breakdowns.",
    "title": "The Last Laugh",
    "episode": "E03",
    "season": ""
  },
  {
    "description": "\nNathaniel Barnes (Michael Chiklis), a new captain of the GCPD, arrives to clean up department and end corruption. With Gordon's assistance, they recruit several aspiring police trainees from the Police Academy in order to form an elite team to accomplish that goal. Galavan kidnaps Cobblepot's mother and blackmails Cobblepot into murdering all of the other candidates so that Galavan can run for mayor unopposed. When Selina begins looking for Bruce at his prep school, she is ordered off by Alfred because of her killing of Reggie. Shortly afterwards, Bruce meets with Galavan to thank him for saving his life during the charity event and meets Galavan's niece, Silver St. Cloud (Natalie Alyn Lind). Nygma and Miss Kringle have a romantic evening together. As Cobblepot begins to have Butch quietly search for his mother, Captain Barnes directs the strike force to target Cobblepot.",
    "title": "Strike Force",
    "episode": "E04",
    "season": ""
  },
  {
    "description": "\nCobblepot and Butch bring a chest to Galavan in his penthouse, revealing a kidnapped Sid Bunderslaw, where Tabitha removes one of his eyes. Meanwhile, the GCPD Strike Force, led by Captain Barnes and Gordon busts one of Cobblepot's money laundering house, where they're nearly killed by a man with a rocket-propelled grenade. Galavan arrives at the GCPD, where he offers help in cleaning the GCPD's corruption in exchange for support in his candidacy. Gordon gently refuses, claiming the police and politics don't match. Tabitha visits Cobblepot to discuss their next move, which requires hiring arsonists. Gordon and Bullock ambush Bridgit on a would-be robbery, where their brothers abandon her. While she tries to back off, officer Luke Garrett (Lenny Platt) tries to restrain her, but she accidentally burns him down. She escapes with Selina but Officer Garrett later dies from the fire. Galavan again visits the GCPD, where Gordon decides to support on his candidacy. In his penthouse, Galavan is visited by Father Creel (Ron Rifkin), who hands him the knife, claiming his warriors are on the way, and Bruce Wayne will die.",
    "title": "Scarification",
    "episode": "E05",
    "season": ""
  },
  {
    "description": "\nAfter moving away from the Pike brothers and in with Selina, Bridgit Pike is abducted and further abused by the Pike Brothers after attempting to leave Gotham City. Bridgit snaps and murders the other Pike Brothers, beginning a crime spree. After a visit to Selina's hideout, Gordon and Bullock arrive at the Pike Brothers apartment where they find them dead. Theo Galavan continues to lure Bruce Wayne, this time offering to help clean up the corruption at Wayne Enterprises. Butch discovers the location of Cobblepot's mother and Cobblepot begins to rally a rescue party. Bridgit Pike is incapacitated in a struggle with the GCPD strike force, publicly announced to be dead much to the dismay of Selina. Kristen Kringle learns that Nygma murdered Officer Dougherty. In an attempt to keep Kringle from telling anyone, Nygma accidentally strangles her, killing her. Meanwhile Pike is alive but her entire body is burned. She is taken to Indian Hill, an underground division of Wayne Enterprises where inhumane experiments are secretly performed. It is stated that her suit had melted onto her, rendering her fireproof.",
    "title": "By Fire",
    "episode": "E06",
    "season": ""
  },
  {
    "description": "\nButch leads Cobblepot to the location of his mother, where Theo Galavan and Tabitha Galavan are waiting. Now cured of his programming, Butch betrays Cobblepot and Tabitha Galavan murders his mother (who though aware of her son's activities still claims him to be a good boy), though Cobblepot manages to escape, vowing to kill Theo in revenge. Galavan, now elected mayor, convinces the GCPD and the public that Cobblepot assaulted him and Galavan has Harvey Dent obtain a warrant for Cobblepot's arrest. Gordon begins to suspect that Galavan is framing Cobblepot and tracks down Butch. In an interrogation, Butch reveals that Theo has been blackmailing Cobblepot and that he murdered Cobblepot's mother. Later that night, Theo attends his victory celebration at which the GCPD are secretly stationed, ready to capture Cobblepot if he arrives. Cobblepot and his henchmen show up, but Cobblepot is quickly ambushed by Gordon. Theo attempts to convince Gordon to shoot Cobblepot, but Cobblepot narrowly escapes. Gordon informs Theo that he is determined to expose his corruption. Elsewhere, Tabitha murders a member of the GCPD strike force. Following the death of Kristen Kringle, Nygma's mental state worsens as his split personality attempts to convince him that he enjoys getting away with murder. Both of Nygma's personalities then merge.",
    "title": "Mommy's Little Monster",
    "episode": "E07",
    "season": ""
  },
  {
    "description": "\nTheo Galavan gives Barbara permission to kill Gordon and also offers Bruce a proposition: Bruce sells his controlling position in Wayne Enterprises to Theo and, in return, Theo gives Bruce the information about his parents' killer and the culprits responsible. Barbara walks inside the GCPD and Gordon suggests he risk himself to find more information about Galavan. While en route to an unknown location on Barbara's instructions, the squad car is assaulted by Tabitha and her crew. Gordon wakes up in Gotham Cathedral, where he and Barbara were going to have their wedding before their break-up. The Strike Force discovers Gordon's location, thanks to the help of Bullock. While the Strike Force engages Tabitha's crew and rescues Leslie (who was somehow kidnapped by Tabitha), Gordon briefly fights Barbara, leading to Barbara hanging outside the church and falling, resulting in severe injuries. Following information obtained by Barbara, GCPD rescue Aubrey James from his abduction. Bruce declines Theo's proposition just as Gordon arrives and arrests Theo, who destroys the evidence on the Waynes' killer. Meanwhile, while trying to bury Kristen Kringle, Nygma discovers an injured and exhausted Penguin, who asks Nygma for help.",
    "title": "Tonight's the Night",
    "episode": "E08",
    "season": ""
  },
  {
    "description": "\nTabitha goes to an underground killer agency and pays to have James Gordon assassinated. Bruce tries to get information about his parents' killer from Silver, but is stopped by Alfred, who orders Silver to stay away from Bruce. When Bruce tries to sneak out, he is stopped by Selina, who claims she has evidence that Silver is not who she claims to be. Gordon and Barnes investigate Theo's condo for evidence. The killers arrive; Gordon and Barnes manage to fend them off, but Barnes is severely injured. Police reinforcements arrive, but are eliminated by another hired killer named Eduardo Flamingo (Raúl Castillo). After coming close to killing him, Gordon arrests Flamingo, but, before being placed in his cell, Flamingo kills another officer. Meanwhile, Nygma persuades Cobblepot to move on from the death of his mother and the both of them kill one of Theo's kidnapped henchmen in celebration. The Order of Saint Dumas arrives in Gotham City.",
    "title": "A Bitter Pill to Swallow",
    "episode": "E09",
    "season": ""
  },
  {
    "description": "\nBruce and Silver are kidnapped by Tom \"The Knife\" (Tommy Flanagan). He manipulates Silver into seemingly revealing the name of Bruce's parents' killer after being paid by Bruce and Selina. She says that the killer's name is \"M. Malone\" but later claims that she lied. Galavan is released after Mayor James lies, stating that Galavan did not kidnap him, framing Penguin instead. Gordon is captured by Theo, who reveals the history of his family to Gordon, but Gordon is rescued by Cobblepot and Gabe. Alfred grows suspicious of Bruce's whereabouts and searches Theo's residence, where he is wounded in a fight with Tabitha, which he narrowly escapes. When Leslie notices Kristen Kringle's absence, Nygma is forced to lie to her, claiming that Kringle left town with Officer Dougherty. Theo breaks into Wayne Manor and kidnaps Bruce, as part of the Order of St. Dumas' plan to \"cleanse\" Gotham.",
    "title": "The Son of Gotham",
    "episode": "E10",
    "season": ""
  },
  {
    "description": "\nGordon wakes up in Nygma's house only to learn from Cobblepot that he is now a fugitive from the law for assaulting Theo Galavan. Gordon and Cobblepot begin making plans to break into Theo's residence and save Bruce. After finding Gordon, Leslie attempts to persuade him to turn himself to the GCPD by informing him that she is pregnant. Gordon, Bullock, Alfred, Selina, Cobblepot and his gang all arrive at Galavan's residence just as the Order of Saint Dumas is about to kill Bruce. During a clash between the Order and Cobblepot's gang in which the Order is defeated, Theo, Tabitha, and Silver St. Cloud begin to make their escape. Tabitha and Silver escape but leave Theo behind. Cobblepot convinces Gordon that Theo might never be convicted and the two take Theo to the docks and murder him. Later, Gordon finds Leslie and proposes to her. Theo's body is discovered by Wayne Enterprises, who take the corpse to Indian Hill where Fish Mooney's body also is being kept. The scientists state that Theo's body is to be experimented on by Professor Hugo Strange.",
    "title": "Worse Than a Crime",
    "episode": "E11",
    "season": ""
  },
  {
    "description": "\nSeveral weeks following the death of Theo Galavan, Gordon is called in for questioning and Cobblepot is arrested. Gordon and Cobblepot lie to the police, stating that Cobblepot murdered Galavan and Gordon was not involved. Gordon is reinstated into the GCPD, while Cobblepot falsely justifies his actions as the result of mental illness. Cobblepot is sent to Arkham Asylum, where he becomes a patient of Hugo Strange (B. D. Wong), the Chief of Psychiatry. Butch takes over Cobblepot's criminal empire. Gordon and Bullock begin investigating a kidnapping and murder spree, unaware that a scientist named Victor Fries (Nathan Darrow) is the culprit. Fries has been experimenting on freezing and re-animating humans so that he can freeze his terminally ill wife Nora (Kristen Hager) until he can find a cure for her disease. When the police target Fries as a suspect, they discover his laboratory while he's away and arrest his wife. After learning of the arrest, Victor Fries attempts to turn himself in before finally discovering which of his serums can successfully reanimate a human being. Professor Strange learns of the experiments and begins making plans to recruit Fries for Indian Hill.",
    "title": "Mr. Freeze",
    "episode": "E12",
    "season": ""
  },
  {
    "description": "\nAt Arkham Asylum, Professor Strange begins overseeing intensive treatments meant to reduce Oswald Cobblepot's aggressive tendencies. Upon learning that Nora is being sent to the medical wing at Arkham Asylum, Victor Fries builds an armoured suit. Fries arrives at the asylum and, after fighting through security and the police, manages to escape with Nora. Elsewhere, Bruce researches a lead, believing he has discovered that the man who killed his parents is Patrick \"Matches\" Malone. James Gordon deduces that Victor Fries will return to his home laboratory in order to freeze Nora and the police surround Fries' home to find that Gordon is correct. In the laboratory, Nora blames herself for the deaths that Fries has caused. Fries attempts to cryogenically freeze her, only to learn that Nora switched the formulas when he wasn't looking. Nora dies as a result. Distraught by Nora's death, Fries attempts to commit suicide by freezing himself. Fries is publicly pronounced dead, despite having survived the process. Fries wakes up in Indian Hill to discover that he can no longer survive outside of subzero temperatures. Fries meets Professor Strange, who offers him an alliance as a fellow scientist.",
    "title": "A Dead Man Feels No Cold",
    "episode": "E13",
    "season": ""
  },
  {
    "description": "\nBruce receives a gun from Selina and goes on the hunt for Patrick Malone with Alfred. To get the information, Alfred is forced to fight in an underground fight club, landing Alfred in the hospital. After Bruce goes on the hunt himself, Alfred contacts Gordon and Bullock so that they can save Bruce from potentially being killed. Bruce locates Malone, who later seemingly confirms he is responsible for the murder of Bruce's parents. He asks Bruce to kill him, but Bruce holds back at the last moment and leaves the gun behind, leading to Malone committing suicide. Later, in the cave, Alfred reads Bruce's letter about him moving to the streets with Selina to learn how to fight crime. Meanwhile, Leslie asks Gordon to investigate Kristen Kringle's sudden disappearance. When Nygma is informed, he swears under his breath that he will outsmart Gordon. After running a few more tests on Cobblepot, Hugo Strange declares him sane and releases him from Arkham, all the while stating that he still has plans for him.",
    "title": "This Ball of Mud and Meanness",
    "episode": "E14",
    "season": ""
  },
  {
    "description": "\nUpon being released from Arkham Asylum when his violent nature is cured, Cobblepot visits the grave of his deceased mother. There, he crosses paths with Elijah Van Dahl (Paul Reubens). After informing Dahl that he is the son of Gertrude Kapelput, Dahl reveals that he is Cobblepot's father. Dahl had an affair with Gertrude decades in the past, but the two were separated by Dahl's disapproving family. Dahl welcomes Cobblepot into his family. Paranoid that Gordon suspects him of killing Kristen Kringle, Nygma disguises himself and begins a series of crimes that involve brain teasers. As Gordon begins solving these crimes, Nygma kills a member of the GCPD strike force, informs the GCPD that Gordon killed Galavan while pretending to be said officer, and frames Gordon for the murder. Believing Gordon murdered the officer to keep him from testifying, the GCPD arrests Gordon. After a trial, Gordon is found guilty and sentenced to Blackgate Penitentiary. Selina teaches Bruce how to survive on the streets as they steal money from Butch's nephew, with Bruce taking a massive beating from the nephew in the process. Barbara wakes from her catatonic state in Arkham Asylum.",
    "title": "Mad Grey Dawn",
    "episode": "E15",
    "season": ""
  },
  {
    "description": "\nGordon is adjusting to life in Blackgate Penitentiary. Warden Carlson Grey (Ned Bellamy) announces to Gordon that he will be transferred to the gen-pop quarter dubbed \"the World's End,\" part of Grey's plan to kill Gordon. He's constantly aided by guard Wilson Bishop (Marc Damon Johnson). Gordon is told by Bullock that Lee has lost their baby and left town. Later, he is defended from attackers by convict Peter \"Puck\" Davies (Peter Mark Kendall), who is beaten and sent to the infirmary. In an attempt to save Gordon, Bullock meets with Falcone. Gordon's death is successfully staged and he and Puck escape. Puck dies from his injuries, while Gordon is given a safe house so he can clear his name and find Lee. Meanwhile, Cobblepot reveals his criminal past to Dahl, for which Dahl forgives him. Dahl is told by the doctor that his heart defect is infected and he has little time to live. Upset that Cobblepot may receive what they perceive to be \"their\" inheritance, Dahl's wife Grace and her children Sasha and Charles poison a drink for Cobblepot to ingest. However, Dahl drinks from the bottle and dies, after stating to Cobblepot his intentions of changing his will in favor of him.",
    "title": "Prisoners",
    "episode": "E16",
    "season": ""
  },
  {
    "description": "\nJames Gordon continues to flee the law as he tries to clear his name. When Gordon secretly approaches Nygma for help, he deduces that Nygma framed him. Nygma electrocutes Gordon into unconsciousness, but Gordon awakes just as Nygma is preparing to stuff him in a car trunk. Gordon asks Selina to report to the GCPD. Gordon follows Nygma into the woods, from where he intends to relocate Kristen Kringle's body. Nygma admits that he framed Gordon as the GCPD eavesdrops on the conversation. They arrest Nygma before he can kill Gordon. Nygma is placed in Arkham Asylum. Nathaniel Barnes offers Gordon his job back, but Gordon declines as he has other matters with which to deal. Barbara is released from Arkham Asylum after she stops showing any signs of mental illness. Following the death of his father, Cobblepot is bullied by his step-family. However, when he discovers evidence that they killed his father, his former self returns and he murders his step-family.",
    "title": "Into the Woods",
    "episode": "E17",
    "season": ""
  },
  {
    "description": "\nBruce, Lucius, and Alfred search through the secret files on Thomas Wayne's newly fixed computer with the goal of finding a clue as to who killed him and Martha and why. Barbara tracks down Gordon. Claiming to be cured of her insanity, she tries to reconcile with Gordon, but to no avail. With Barbara's unorthodox assistance, Gordon discovers that the person who contracted Patrick Malone to kill Thomas and Martha Wayne is known as \"the Philosopher.\" Bruce and Alfred track a lead from Thomas Wayne's computer and find Karen Jennings, a former Blackgate inmate on whom experiments were performed at Pinewood Farms, a Wayne Enterprises facility, by the Philosopher. She offers to identify the Philosopher, but Victor Fries is sent to kill her. Following Jennings' death, Lucius does further research and discovers that Hugo Strange is the Philosopher. After many failed attempts, Strange finally succeeds in resurrecting someone from the dead: Theo Galavan.",
    "title": "Pinewood",
    "episode": "E18",
    "season": ""
  },
  {
    "description": "\nGordon questions Professor Strange about Project Chimera, which later makes Strange send Theo Galavan, now under the name Azrael, to take out Gordon. While at Arkham Asylum, Gordon bumps into Nygma in the playroom. Nygma later overhears Strange and Peabody complaining about Gordon's interference. Nygma suggests that he can help them take out Gordon, but Strange refuses his help. Bruce is told by Bullock and Gordon that there isn't enough evidence to imprison Strange. Azrael gets some memories back after looking at posters from Galavan's election. After, Gordon is in holding when the lights flicker and Azrael shows up, killing a few officers and making an unsuccessful attempt on Gordon's life. Barnes and Gordon flee to the roof, where Barnes fights Azrael with a pipe, breaks his sword, and rips off his mask, revealing Azrael's identity. In the end, Barnes is sent to the hospital and Gordon heads home, watched by Azrael from a distance.",
    "title": "Azrael",
    "episode": "E19",
    "season": ""
  },
  {
    "description": "\nTogether with Bullock and a crew of police officers, Gordon arrives at Arkham Asylum with a warrant to inspect Professor Strange's office. Strange is unfortunately one step in front of them, having shredded all of his documents. Nygma, in the meantime, is disturbed by what he saw at Indian Hill and realizes he needs to escape. As Captain Barnes is still in the hospital, Harvey Bullock becomes de facto captain. Bruce decides to go off with Selina to find a way into Arkham. Selina accepts because she wants to rescue Bridgit from Arkham, but insists she go in on her own. Gordon and Bullock arrive at Butch's mansion to talk with Tabitha, who states the sword Azrael used was fake and that the real one is located in her grandfather's tomb. They later arrive at Gotham cemetery, where they steal the sword. Azrael arrives, injuring Tabitha and escaping with the real sword. Gordon warns Alfred about Galavan just as Bruce returns to Wayne Manor. Gordon arrives and shoots Azrael multiple times, but he remains undefeated until Cobblepot and Butch arrive. Butch fires an RPG, killing Azrael.",
    "title": "Unleashed",
    "episode": "E20",
    "season": ""
  },
  {
    "description": "\nSelina begs to be Bridgit's servant, making use of Bridgit's alter-ego. Bruce is troubled after Selina fails to meet with him and learns of her capture. Meanwhile, Strange's project continues and he successfully resurrects Fish Mooney – the first subject to retain full memory. Bruce believes that there is a secret room in Arkham where Strange is experimenting on the dead and that the only way to be certain is if they head in themselves. Bruce, Gordon, and Fox visit Arkham to execute their plan, but their motives are revealed and all three are captured. Bruce and Fox are put in a chamber and interrogated by Nygma on Strange's behalf. Meanwhile, Gordon is brought into another room with Strange and introduced to Basil, a patient whose skin stretches more than humanly possible. Strange places him in a machine and replicates Gordon's visage onto Basil's face.",
    "title": "A Legion of Horribles",
    "episode": "E21",
    "season": ""
  },
  {
    "description": "\nDisguised as Gordon, Basil pulls the GCPD off of Arkham; however, Barbara later exposes Basil as an impostor. Strange prepares to detonate a bomb beneath Arkham and tells Ms. Peabody to transfer the patients to another facility. Mooney gains control of Peabody, but Strange starts the bomb's countdown under the White-Haired Lady's orders. With Nygma's help, Gordon and Lucius stop the bomb. Mooney escapes in a bus with Strange's other monsters, and encounters a shocked Penguin on the street; she knocks him out, prompting Butch and his gang to flee. Strange is arrested, Gordon leaves to find Lee, Bruce tells Alfred of his plans to find the secret council that wants him dead, and Bullock is trusted to protect Gotham. A homeless woman opens the abandoned bus, unwittingly releasing the monsters upon Gotham; among them is a boy identical to Bruce.",
    "title": "Transference",
    "episode": "E22",
    "season": ""
  },
  {
    "description": "\nSix months after Fish's disappearance, Lee has moved on with a new man in her life and Gordon has become a bounty hunter tracking down the Indian Hill escapees. Cobblepot puts a bounty on Fish and visits Nygma at Arkham, surmising that Fish has an ulterior motive; but Nygma advises him to just kill her. Bruce's mysterious doppelgänger lurks around Gotham and learns of Bruce's identity from Ivy, who mistakes him for Bruce. Gordon, with the help of reporter Valerie Vale, tracks down Strange's assistant Ethel Peabody, who is later captured and killed by Fish, leading Barnes and Bullock to demand Gordon to stay away from GCPD. Her gang catches Ivy spying on them, but she runs and falls down a sewage pipe after being touched by a gang member who can accelerate a person's aging process. Bruce and Alfred call a meeting with the Wayne Enterprises Board of Directors, whom Bruce threatens with disseminating his alleged evidence pertaining to the cabal in charge behind the scenes, unless they contact him. The cabal sends an enforcer to kidnap Bruce. Meanwhile, Barbara and Tabitha refuse Cobblepot's protection. In an attempt to reconcile with Tabitha, Butch hires a mobster; but Cobblepot scolds him.",
    "title": "Better to Reign in Hell...",
    "episode": "E01",
    "season": "S03"
  },
  {
    "description": "\nBruce is brought before Kathryn, a high-ranking member of the secret council. He recognizes her from various Wayne Enterprises events. Bruce agrees to cease all his investigation in exchange for the lives of those closest to him. Cobblepot rallies the public against the \"monsters\". Ivy washes ashore as a grown woman, attacking a man for mistreating plants. Fish captures Bullock and uses her powers to make him lead her to the secret facility holding Strange, the only person she believes can save her life. Gordon makes a deal with Fish to help her escape with Strange if she hands over Bullock, and informs Cobblepot of her escape route. Cobblepot prepares to kill her, but lets her go when she reveals that she spared him because the \"Penguin\" was her greatest creation. The public under his command breaks into the facility and kills some of Fish's minions. Valerie visits Gordon about his deal with Fish, and they share a kiss. Bruce's doppelgänger breaks into Wayne Manor and asks him for help. Lee returns to Gotham.",
    "title": "Burn the Witch",
    "episode": "E02",
    "season": ""
  },
  {
    "description": "\nHypnotist Jervis Tetch hires Gordon to find his sister Alice, an Indian Hill escapee whose blood contains a virus. Barnes offers Lee her old job back at GCPD. Cobblepot challenges Aubrey's competence and decides to run for mayor, claiming to clean up Gotham's corrupt system; to aid with his campaign, he has Nygma declared legally sane and released from Arkham. Gordon gets into a brawl and is stitched up by Lee's new fiancé, Mario Calvi, at the ER. After Alice tells Gordon she wants nothing to do with Jervis, Gordon questions him, who hypnotizes him into nearly committing suicide. Alice saves Gordon, who brings her into GCPD. Lee and Mario have dinner with his father, revealed to be Falcone, who is worried about Gordon's possible jealousy. Bruce takes in his doppelgänger, Subject 514A a.k.a. \"Five\", who demonstrates impressive fighting skills and an imperviousness to pain. Five later impersonates Bruce and takes an oblivious Selina out on the town.",
    "title": "Look into My Eyes",
    "episode": "E03",
    "season": ""
  },
  {
    "description": "\nFive assists Selina in robbing a bar and rescues her when she is captured, but she sees the scars on his body and identifies him as an imposter. Five admits he wanted to experience a normal life by socializing with someone, but she reassures him that he is more normal than he thinks, and he kisses her. Tetch hypnotizes the wrestling Tweedle Brothers to help him break into GCPD and kidnap Alice, but Gordon and Bullock track them down. Gordon finds himself still under the suicidal influence of Tetch's hypnosis; realizing his suicidal urges are connected to his issues with Lee, Gordon overcomes them and breaks the hypnosis. Alice falls and is impaled on a pipe, leaving a grief-stricken Tetch to escape. While investigating the crime scene, Barnes becomes infected by Alice's dripping blood. Cobblepot has Butch bribe campaign officials to buy the election, but Nygma takes the money back; Cobblepot wins anyway, and realizes Nygma wanted to show him that the people genuinely want him as Mayor. Cobblepot appoints Nygma as his chief of staff, to Butch's displeasure. Gordon reconciles with Lee. Five bids farewell to Bruce and tries to leave Gotham, but is kidnapped by Kathryn.",
    "title": "New Day Rising",
    "episode": "E04",
    "season": ""
  },
  {
    "description": "\nCobblepot's term as mayor starts off well, but a new Red Hood Gang appears and openly challenges his authority. Nygma discovers that Butch is behind the new gang as part of a scheme to make himself Cobblepot's right-hand man again. At a celebratory party in the mayor's honor, Nygma manipulates Butch into exposing himself as the mastermind behind the Red Hoods, thus reinforcing his own position as Cobblepot's most trusted friend and ally. Barnes asks Lee about the tests on Alice's blood without revealing that he was exposed to it. He is later revealed to have gained superhuman strength. In order to please Selina, Bruce hires Gordon to find Ivy, who later confronts Selina without revealing her identity. At Gordon's suggestion, Bruce tells Selina how he feels about her, but she dismissively tells him that he only feels that way because he has never dated anyone. Bruce reasserts his feelings and Selina kisses him. Elsewhere, Jervis Tetch mourns Alice's death and plots revenge against Gordon, killing a girl resembling her.",
    "title": "Anything for You",
    "episode": "E05",
    "season": ""
  },
  {
    "description": "\nTetch begins a killing spree, hypnotizing several civilians into life-threatening situations and forcing Gordon to choose whom to save, leading to the other persons' deaths. Eventually, Tetch demands Gordon to kill one of the hostages himself. Gordon refuses; and Tetch kills both. He later kidnaps Valerie and Lee, demanding Gordon to go to Mario's alone. Gordon enlists Mario's help without involving the GCPD. While Mario recovers his gun from the basement, Gordon joins Tetch's \"tea party\", which Mario interrupts in order to rescue the women. However, Tetch is revealed to have unloaded the gun, having Mario locked. He then forces Gordon to choose the victim. He picks Lee, resulting in Tetch shooting Valerie instead. She is rushed to the hospital. Meanwhile, Cobblepot realizes he is in love with Nygma and plans to confess his feelings for him. However, Nygma meets one Isabella, who resembles Kristen Kringle and is interested in riddles as well. Barnes is revealed to have anger restraint difficulty as a result of his exposure.",
    "title": "Follow the White Rabbit",
    "episode": "E06",
    "season": ""
  },
  {
    "description": "\nValerie recovers, but ends her relationship with Gordon, knowing he manipulated Tetch into shooting her instead of Lee. Tetch breaks into the morgue and drains the blood from Alice's corpse. He also exposes Gordon to the powerful \"Red Queen\", causing intense hallucinations in which Barbara leads Gordon to a war-torn GCPD, then a life where he is married to Lee with two children, and to an encounter with his deceased father, who encourages him to be a better protector for Gotham. Mario brings Gordon back to consciousness. Cobblepot reveals Nygma's past to Isabella in an attempt to end their relationship, but to no avail. Barnes and Bullock learn Tetch is planning to spread the virus at the city founders' party, and arrest him in time; Tetch learns of Barnes' exposure however. As Barnes composes his will, Gordon decides to honor his father by rejoining the GCPD. The secret council is revealed to have plans for Cobblepot, with one member wearing a ring similar to that of Gordon's father's. Bruce begins dating Selina.",
    "title": "Red Queen",
    "episode": "E07",
    "season": ""
  },
  {
    "description": "\nAfter losing control and killing a criminal, Barnes visits Tetch at Arkham and demands to know if the virus can be cured, but Tetch refuses the possibility. Barnes begins hearing \"voices\" that urge him to kill more criminals. He finds the mastermind, plastic surgeon Maxwell Symon, who removes his victims' faces to insert on customers who intend to change their faces. Barnes arrests Symon after overcoming the voices. Lee and Mario throw an engagement party, where Barnes makes plans to turn himself in to police custody. However, his psychosis overpowers him when he learns Symon has been released due to his powerful connections. Mario threatens Gordon to stay away from Lee. Losing faith in Gotham's justice system, Barnes throws Symon off a window and plans to murder criminals on a larger scale. Symon tells Gordon about Barnes. Meanwhile, Ed fears that Isabella might meet Kringle's fate and decides to end the relationship, encouraged by Oswald. However, Isabella learns of Oswald's feelings and seduces Ed again. Oswald has Gabe kill Isabella.",
    "title": "Blood Rush",
    "episode": "E08",
    "season": ""
  },
  {
    "description": "\nBarnes begins his killing spree. Knowing Gordon's awareness, Barnes attempts to frame him for a murder, but is unable to convince the GCPD after Bullock convinces Lee to confirm the accusation. Gordon overpowers Barnes in a duel. The latter is arrested and incarcerated in Arkham. After Isabella's death is announced an accident, Nygma begins investigating it personally and deduces it was murder, suspect Butch; Cobblepot promises to help bring retribution to Butch. Ivy reveals herself to Bruce and Selina, unintentionally causing a friction in their relationship. She is to revealed to be followed by crossbow-wielding mercenaries seeking to kill her for a necklace she stole. The trio escapes and later finds the necklace's original owner dead; the necklace is revealed to contain a key.",
    "title": "The Executioner",
    "episode": "E09",
    "season": ""
  },
  {
    "description": "\nIvy uses her poison to control Alfred's mind and escape. Bruce learns the \"Whisper Gang\" after the key is out to destroy the secret council, a.k.a. the Court of Owls and is therefore not his enemy. Soon after, the Court enforcer kills the Gang leader. When Mario is targeted by assassins, Falcone deduces that the Court is responsible and successfully blackmails them into ceasing their attack, not learning their motives however. Nygma kidnaps and tortures Butch and Tabitha before discovering that they are not responsible for Isabella's death, but not before forcing Tabitha to choose between her right hand and Butch's life, choosing the latter. Nygma allows them to go to the hospital. After investigating the matter, Barbara realizes Cobblepot killed Isabella and plans to use the truth to stage a power grab. Gordon says a romantic goodbye to Lee before her upcoming wedding to Mario. When Mario sees her leaving Gordon's, he bursts into a fit of rage and exhibits symptoms of the Tetch virus.",
    "title": "Time Bomb",
    "episode": "E10",
    "season": ""
  },
  {
    "description": "\nIt is revealed that Tetch infected Mario, who vows to make Lee hate Gordon and orchestrates a series of events to make her believe Gordon is trying to sabotage their wedding merely out of jealousy. The plan works and, just before the wedding, she pushes Gordon away. Lucius proves Mario's infection to Bullock, but not before Mario and Lee disappear from the party. Gordon convinces Carmine to reveal the couple's location by promising not to kill Mario, who later attempts to kill an oblivious Lee, but Gordon arrives and guns him down, much to her shock. Barbara tells Nygma about Cobblepot; but Nygma does not believe it until luring Cobblepot into revealing his feelings. Barbara and Nygma plan to kill Cobblepot and usurp his power in the mob. Using information provided by the Whispers, Bruce's party uses the key to open the Court's vault and steal its contents – a crystalline owl statue – but are intercepted by Talon, the Court's enforcer; Selina's mother reveals herself and helps them kill Talon.",
    "title": "Beware the Green-Eyed Monster",
    "episode": "E11",
    "season": ""
  },
  {
    "description": "\nA vengeful Falcone sends Zsasz to kill Gordon, initially approved by Lee; however, after seeing what the virus has done to Barnes, she realizes Gordon may have been justified and persuades Falcone to call off the hit. Unhinged by ghostly sightings of his father, Cobblepot insults Gotham's citizens on live TV and murders his Deputy Chief of Staff, unaware that Nygma is orchestrating his downward spiral, with Basil having posed as Cobblepot's father. Bruce convinces Selina to accept her mother Maria back into her life, but later learns Maria owes money to criminal Cole Clemons. Investigating the discovery of a briefly reanimated corpse, Gordon and Bullock pursue former Indian Hill employee Dwight Pollard, who secretly leads a party of Jerome Valeska's admirers. Pollard is revealed to be planning to reanimate Valeska.",
    "title": "Ghosts",
    "episode": "E12",
    "season": ""
  },
  {
    "description": "\nWhen the reanimation seemingly fails, Dwight cuts off Jerome's face and wears it as a mask while he leads his \"cult\" to take over a news station. GCPD stops the cult, but Jerome awakens belatedly at GCPD and escapes. After the GCPD defeats the cult and secures the station, they learn of Jerome's revival, but not before he abducts Dwight. Nygma, Barbara, and Tabitha manipulate Cobblepot into believing the other crime bosses have turned against him. Bruce agrees to pay Maria's debt to Cole, but Selina becomes furious upon discovering the whole thing was a con Maria and Cole ran together, and that Bruce even suspected this but did not want Selina to learn the truth. After reattaching his face, Jerome encourages the cult to kill others and ignites explosives that kill Dwight and knock out Gotham's power, causing a citywide blackout.",
    "title": "Smile Like You Mean It",
    "episode": "E13",
    "season": ""
  },
  {
    "description": "\nDuring the blackout, the GCPD struggles to contain the riots committed by both Jerome's followers and random citizens gone corrupt. Jerome kidnaps Bruce and drags him to a circus, planning a theatrical execution in front of his followers. Accompanied by Alfred, the GCPD attacks the circus. Bruce escapes and fights Jerome in a house of mirrors, but resists the urge to kill him; Jerome is then subdued and sent back to Arkham by Gordon, restoring order to the city. Having gained enough skills, Bruce decides to begin fighting crime, vowing never to kill. Cobblepot escapes a murder attempt by Nygma and is captured by Barbara, who threatens him into helping them find and kill Nygma; realizing he truly loves Nygma, Cobblepot refuses. Nygma then reveals that it was all a ruse to make him realize he is incapable of love. Despite Cobblepot having proven otherwise, Nygma shoots him and drops him into Gotham Harbor. Gordon is reunited with his uncle Frank, who is secretly a member of the Court, which continues brainwashing Five.",
    "title": "The Gentle Art of Making Enemies",
    "episode": "E14",
    "season": ""
  },
  {
    "description": "\nBruce is summoned by Selina through a letter, but she denies sending the letter and demands him to stay away from her. Bruce later realizes the letter was sent by Five, who then drugs him and usurps his identity while the real Bruce is sent to a Court dungeon. Gordon reconnects with Frank, who states that he and Peter, Gordon's father, were members of the Court until they became disillusioned, leading to Peter's murder and making it look like an accident. Frank asks Gordon to join the Court and help him destroy it from the inside. Nygma attempts to build a name for himself by killing Gotham's elite, eventually picking Lucius as a potential arch-nemesis. After speaking to hallucinations of Cobblepot, Nygma decides to let him go and embraces his new persona as the Riddler. Meanwhile, Cobblepot wakes up in Ivy's apartment after surviving his gunshot wound.",
    "title": "How the Riddler Got His Name",
    "episode": "E15",
    "season": ""
  },
  {
    "description": "\nAfter fully recovering, Cobblepot attempts to build an army to take back power from Nygma and Barbara. He calls Gabe, who betrays him and attempts to auction him, but Ivy uses her \"perfume\" to rescue him. Cobblepot kills Gabe after the perfume makes the latter provoke the former by the truth. Ivy convinces Cobblepot to use the Indian Hill escapees for his army. At the dungeon, a Shaman gives Bruce hallucinogens that cause him to relive the night of his parents' murder, and soon after he begins his training Bruce so that he can protect Gotham. After learning a weapon is being transported to Gotham in order to destroy and \"cleanse\" it, Gordon investigates the Court further and realizes his father's death was a hit organized by Frank, who is later ordered to kill Gordon, but he instead commits suicide. On Frank's final instructions, Gordon tells Kathryn that he killed Frank and intends to join the Court, welcomed by her.",
    "title": "These Delicate and Dark Obsessions",
    "episode": "E16",
    "season": ""
  },
  {
    "description": "\nAfter being tipped off by Barbara about the Court, Nygma goes on a mission to solve the riddle of who controls Gotham. He takes Interim Mayor James hostage, televising a threat to end his life if he does not learn the identity of the Court. Gordon arranges a meeting with Nygma at the GCPD and convinces Nygma to be escorted to the Court; in doing this for Kathryn, Gordon takes Frank's place in the Court. Cobblepot and Ivy recruit Fries and Pike for the army that he plans to use against Nygma. Five struggles to gain Alfred's trust and later learns that he has a terminal illness. After failing to convince Selina to leave Gotham due to the Court's plans, she scolds him for his selfishness in comparison with Bruce's heroism. He pushes her out of a window. Her body is later surrounded by cats. Lee suspects Frank died under suspicious circumstances and vows to take down Gordon.",
    "title": "The Primal Riddle",
    "episode": "E17",
    "season": ""
  },
  {
    "description": "\nIvy visits Selina in the hospital and uses her plants to heal her injuries; upon waking, she decides to kill Five. Lee rules Frank's death a homicide and attempts to have Gordon questioned but, when she suspects Bullock and Lucius are helping Gordon evade justice, she resigns from the GCPD. The Court kidnaps Barnes and forces Strange, whom they abducted after he cured Fish, to harness the Tetch virus from Barnes' blood. With Strange's assistance, Gordon learns the Court intends to release the virus into Gotham and discreetly works with Cobblepot to prevent a group of socialites from being exposed. Bruce manages to overcome his rage during his training and the Shaman deems him ready to return to Gotham and embrace his power, but all is revealed to be the Court's scheme. Cobblepot is imprisoned in the Court's headquarters with Nygma. After deducing Gordon's betrayal, Kathryn orders Barnes to kill him.",
    "title": "Light the Wick",
    "episode": "E18",
    "season": ""
  },
  {
    "description": "\nSelina attacks Five and exposes his identity to Alfred, but he subdues them and escapes. At a hideout near Gotham, the Shaman purges Bruce of the pain of his parents' deaths and places him under his control, telling him of his mission to destroy the Court and save Gotham. Cobblepot and Nygma reluctantly work together to escape the Court, but resume their feud afterward. Learning about Bruce and Five, Gordon and Bullock discover that the Court's crystal owl statues contain maps of marked locations in Gotham. They interrogate Kathryn for Bruce's whereabouts, but Barnes attacks the GCPD and beheads her before she can reveal anything. Gordon shoots off Barnes' left hand; he is captured, but escapes again. Using the reassembled owl that Bruce stole, the GCPD finds several locations where Bruce might be. After speaking with Jervis at Arkham and realizing that she is the one to blame for Mario's death, Lee steals a vial of the Tetch virus from the GCPD and injects herself with it.",
    "title": "All Will Be Judged",
    "episode": "E19",
    "season": ""
  },
  {
    "description": "\nLee buries Jim alive in a coffin with his only escape option being the virus. She goes to the GCPD to taunt them and ends up in custody. Jim eventually runs out of oxygen and decides to inject himself and attempt to save the city from the virus attack. The Shaman, who executes the remaining members of the Court for the Wayne murders, prepares Bruce to detonate the bomb from Wayne Enterprises. Alfred interrogates Strange and learns Bruce's location, telling Harvey. Alfred then arrives at Wayne Enterprises and kills the Shaman, who, in his last words, redirects Bruce to \"the Demon's Head,\" while the bomb, which was triggered when the Shaman grabbed Bruce's hand, unleashes the virus across the city. Meanwhile, Cobblepot is deserted by Fries and Bridgit and later attacked by Nygma's party before the former is taken away by Fish.",
    "title": "Pretty Hate Machine",
    "episode": "E20",
    "season": ""
  },
  {
    "description": "\nAs the citizens begin to exhibit psychopathic behaviors due to the infection, Fish kidnaps Strange and manages to find the antidote, but she is murdered by Gordon and the antidote is destroyed. A mourning Cobblepot is arrested by the GCPD after being attacked by the League of Shadows. Nygma and Barbara have Tetch, whose blood is needed to formulate an antidote, kidnapped during transfer. They contact city hall and demand a large ransom in exchange for Tetch. However, Gordon secretly contacts Nygma and arranges a deal to trade merely Cobblepot for Tetch. Bruce escapes from police custody when they are overwhelmed by the infected and seeks out the Demon's Head, a.k.a. Ra's Al Ghul, the leader of the League. Ra's has Bruce prove his worth by impaling Alfred with a sword.",
    "title": "Destiny Calling",
    "episode": "E21",
    "season": ""
  },
  {
    "description": "\nAfter killing Alfred, Bruce breaks free from his conditioning and turns on Ra's, who escapes after instructing him to revive Alfred with the waters of a mystical well. Barbara's party interrupts Nygma and Gordon's trade. Cobblepot captures Nygma and has him frozen and kept as a trophy. Bruce pushes away Selina when she tries to visit Alfred. Barbara shoots Butch in the head before being electrocuted by Tabitha. Using Tetch's blood, an antidote is synthesized, curing most of the citizens, including Gordon and Lee, who leaves the city and encourages Gordon to continue fighting crime. A comatose Butch is placed in the hospital, where his birth name is revealed as Cyrus Gold. Cobblepot also makes plans to open a new nightclub called \"The Iceberg Lounge.\" Tabitha becomes a mentor to Selina and begins teaching her how to use a whip. Bruce is encouraged to make his own decisions by Alfred and becomes a masked vigilante.",
    "title": "Heavydirtysoul",
    "episode": "E22",
    "season": ""
  },
  {
    "description": "\nIn the aftermath of the Tetch virus incident, Penguin has regained control of Gotham's underworld and begun issuing \"Licenses of Misconduct\", allowing criminals to commit \"legal crimes,\" though not approved by Gordon and Bruce. Selina and a reluctant Tabitha agree to a license. A group of unlicensed criminals led by Merton and Grady Harris decide to defeat Penguin, releasing Jonathan Crane from Arkham to help them produce his father's fear toxin. Knowing that Gordon cannot help, Bruce decides to fight the licenses himself. The night Penguin opens the Iceberg Lounge, the Harrises are captured before they can attack the party but, when Penguin decides to execute them, Ivy turns on him and cuts the power. Merton uses the fear toxin on Penguin before Gordon shows up and takes him into custody. The toxin makes Penguin see an escaped Nygma. Bruce steals the list of licensed criminals, but is then found on the scene of a robbery by the GCPD, bank robbers. Grady, who escaped from the party, returns to Crane's house, but discovers Jonathan has adopted a new persona, calling himself \"The Scarecrow\" and spraying Grady with fear gas.",
    "title": "Pax Penguina",
    "episode": "E01",
    "season": "S04"
  },
  {
    "description": "\nGordon releases Bruce from custody. Penguin gives the former 24 hours to apprehend Crane in order to prove the GCPD is still efficient. With no support from the other cops, even Bullock, Gordon walks into Arkham and fights off dozens of inmates influenced by the fear toxin and eventually gets dosed himself. He walks into a hallucination and sees a dying Lee, but successfully overcomes his fear and uses water to nullify the inmates' reaction to the toxin, forcing Crane to run. Penguin mocks the GCPD and offers the policemen a spot on his payroll. Gordon seeks Falcone's help to defeat Penguin. Meanwhile, Selina and Tabitha meet with a resurrected Barbara, who asks them to join her new arms business, onto which Penguin later forces a license. After being convinced of Barbara's sincerity, Tabitha and Selina decide to join. Ivy drinks a combination of potions and begins mutating. After Bruce almost gets killed during his vigilantism, Fox, who seems to be aware of his activities, provides him with a \"Prototype Suit,\" making him faster and more resilient.",
    "title": "The Fear Reaper",
    "episode": "E02",
    "season": ""
  },
  {
    "description": "\nIn Arabia, AD 125, a deceased warrior is taken from the battlefield and placed into a healing pool known as the Lazarus Pit; once revived, the future Ra's is tasked by his master to find his future heir and given a ceremonial knife. In modern-day Gotham, the knife is sold at auction by Penguin; Bruce, playing a wealthy spoiled brat, outbids Barbara for it. She is revealed to have been revived by Ra's and tasked with retrieving the knife. She sends Selina to convince Bruce to yield it, but to no avail. Barbara seduces Ra's. Gordon visits Carmine, who declines his request, revealing his imminent demise. His daughter Sofia, however, comes to Gotham to help Gordon after they share a kiss. Ed is stolen from the Lounge by one of Penguin's employees, Myrtle Jenkins, who was a former classmate of Ed's and is a current follower. Ed finds that his brain has suffered, such that he is not able to answer even children's riddles. Penguin has Myrtle killed to make an example and Ed wanders around the city, angry to learn that Penguin is in control again.",
    "title": "They Who Hide Behind Masks",
    "episode": "E03",
    "season": ""
  },
  {
    "description": "\nBruce has antiquist Niles Winthrop and his grandson, Alex, study the knife. Ra's later kills Niles, forcing Alex to escape with the knife. Bruce and Gordon find Alex and are attacked by Ra's' psychotic enforcers; Bruce and Alex escape the scene. Ra's visits the GCPD as a Nanda Parbat official before Alfred arrives and tells Gordon about the previous activities of Ra's, who escapes. Alex and Bruce return to Niles' museum, where the former has hidden the knife. After recovering it, the enforcers attack them just as Gordon arrives and fights them off. Ra's holds Alex hostage, demanding the knife, which Bruce deems too important. An impressed Ra's kills Alex and, as part of his scheme, allows Gordon to arrest him. Meanwhile, Cobblepot threatens Sofia against contemplating a takeover. He uses her to trap and execute Falcone loyalists, completely trusting Sofia, who tells Jim that it was all part of her plan. Ed spends hours trying to make petty riddles to defy Cobblepot, who convinces Ed that he is no longer the Riddler and spares his life for more humiliation.",
    "title": "The Demon's Head",
    "episode": "E04",
    "season": ""
  },
  {
    "description": "\nFollowing Alex's funeral and learning that Ra's has applied for diplomatic immunity, Bruce takes the knife and vows to kill him at Blackgate. Ra's grants Barbara an unknown mystical power and says goodbye. Upon arriving, Bruce is ambushed by Ra's and the League posed as COs. When Alfred reports him missing to Gordon, they arrive at Blackgate and subdue the League. Ra's states that he is cursed with immortality and provokes Bruce into stabbing him with the knife, breaking the curse and rendering him a decayed corpse. Bruce suspends his vigilantism and Alfred keeps the suit until he can move on. Meanwhile, Butch's body is dumped in waters polluted by Indian Hill's chemical waste; he is revived with no memory, primitive language, pale skin, and superhuman strength, assuming the name \"Solomon Grundy\". He encounters and befriends Nygma, who takes him to a wrestling ring where Lee is working as the medic. Sofia attempts to level with Cobblepot and the two begin bonding.",
    "title": "The Blade's Path",
    "episode": "E05",
    "season": ""
  },
  {
    "description": "\nA man wearing a pig's head begins killing police officers acting as Cobblepot's bagmen. Deducing that the killer intends to fight corruption, Gordon and Bullock find the last target, but are too late to prevent his death, leading to the duo's capture. Gordon frees himself before the killer cuts Bullock's throat to facilitate his escape. Gordon tells Bullock that he knows the latter has also been on Cobblepot's payroll, demanding him to cease it. \"Professor Pyg\" is revealed to have larger-scale plans. Meanwhile, Cobblepot suspects Sofia's intentions and confronts her, but is deceived again when he learns that she has been constructing an orphanage. Nygma begins making money using Gilzean, trying to hire Thompkins to restore his genius. After running out of medicine in her private clinic, she accepts Nygma's offer.",
    "title": "Hog Day Afternoon",
    "episode": "E06",
    "season": ""
  },
  {
    "description": "\nPyg kidnaps three officers. Cobblepot and his temporary enforcer Headhunter ally with the GCPD to take down Pyg against the advice of Gordon and Sofia, who warns Cobblepot of the bad publicity should the alliance fail. They find one officer murdered and the second, Fisoli, critically wounded. While Fisoli is taken away in an ambulance, the alliance traps Pyg in an abandoned courthouse with the third officer, Patel. However, it is a trap and Bullock accidentally shoots Patel. Gordon saves them alone, reclaiming the GCPD's good publicity and ruining Cobblepot's. Penguin stabs Headhunter in rage while Fisoli, revealed to be Pyg in disguise, escapes to enact further plans. The GCPD stops recognizing the Licenses. Meanwhile, during a fundraiser, Bruce is met by Grace Blomdahl, his former classmate. He is also re-introduced to a now friendly Tommy Elliot and Brant, who acts arrogantly around Bruce. As an act of vengeance, Bruce excludes Brant while partying at a nightclub he impulsively purchased and develops a romance with Blomdahl. In order to make amends with Barbara, Selina and Tabitha steal from a biker gang and are accepted by the former.",
    "title": "A Day in the Narrows",
    "episode": "E07",
    "season": ""
  },
  {
    "description": "\nBarbara, Selina, and Tabitha are dispatched by Cobblepot to kidnap Nygma, after learning of his popularity mocking Cobblepot in the Narrows. Cobblepot also dispatches Bridgit to kill them in case they fail. Arriving, Barbara is distracted by Lee and Tabitha recognizes Gilzean. After Tabitha defeats Gilzean, who begins remembering, in a fight for Nygma, Bridgit arrives, but Lee incapacitates her; she also becomes the new leader of the fights after Cherry is killed by Barbara. Meanwhile, Gordon is offered a promotion to be the new Captain of Gotham Central, arranged by Sofia. Although initially hesitant, he takes the position when Bullock's bitterness and shame lead to him missing out on a police ceremony. Cobblepot takes advantage of a mentally unstable orphan named Martin and psychologically manipulates him into his protegé. Gordon ends his partnership with Sofia.",
    "title": "Stop Hitting Yourself",
    "episode": "E08",
    "season": ""
  },
  {
    "description": "\nIn a plot to launch an attack on Sofia's orphanage, Pyg kills several homeless people and cooks their insides, stuffing them into pies. His base of operations is exposed by the GCPD and Captain Gordon. When a dinner at the orphanage rounds up several of the rich and powerful, including Cobblepot, Pyg launches his plan into motion, torturing the rich into cannibalism by way of eating the pies. Cobblepot's friendship with Sofia is ruined when Martin, acting as an insider for Cobblepot, tells him of her interactions with Gordon, confirming his suspicions. Bruce, bitter at not feeling satisfaction after avenging his parents' deaths via the death of Ra's al Ghul, continues his partying ways after abandoning Alfred on a nature walk, straining their relationship.",
    "title": "Let Them Eat Pie",
    "episode": "E09",
    "season": ""
  },
  {
    "description": "\nGordon visits the Pyg in Arkham Asylum after Fox deduces that the Pyg has undergone numerous facial surgeries. Fox learns that he was a serial killer named Lazlo Valentin. The Pyg later breaks out of Arkham. In the Narrows, Thompkins and Nygma are faced with a rival mobster, Sampson, who challenges her leadership. After Sampson ransacks Thompkins' clinic, she poisons his drink and offers an antidote on the condition that he resign from power in the Narrows. Thompkins also learns that Nygma's side effects from being frozen have been worn off; Nygma begins having hallucinations of his dual personality, the Riddler. Cobblepot confronts Sofia and has her tortured by the Dentist, one of Cobblepot's assets. As part of an intricate plan, Sofia flees, but is kidnapped by Barbara, Tabitha, and Selina. The four make an alliance and, after Zsasz blows up Barbara's safehouse, they use Martin as leverage against Cobblepot, while Gordon learns of Sofia's intentions to use the GCPD against Cobblepot via Gordon's promotion. The two factions meet under a bridge and Cobblepot fakes Martin's death in a car bombing to force Sofia to retreat, declaring war.",
    "title": "Things That Go Boom",
    "episode": "E10",
    "season": ""
  },
  {
    "description": "\nWhile Nygma is haunted by his alternate Riddler persona, Tabitha kidnaps and repeatedly bludgeons Grundy in an attempt to have him remember her. She ultimately gives up, but Grundy soon awakens, regaining higher speech and remembering his past life as Butch Gilzean. Bruce's arrogance prompts Alfred to fight him in hand-to-hand combat after threatening to send him away. A conceited Bruce fires Alfred from service and forces him to resign as his legal guardian. Pyg becomes involved in a conspiracy with Sofia to assassinate her father Carmine and blame Cobblepot for the hit. After Carmine's funeral, Sofia manipulates Gordon into arresting Cobblepot for Martin's supposed murder, and Zsasz, revealed also to be working for Sofia, sells him out to the GCPD. Sofia kills Pyg and reveals her true motive to not take over Gotham, but to allow Gordon to live with the guilt for killing her brother Mario. Bullock resigns from the GCPD. Incarcerated at Arkham Asylum, Cobblepot meets Jerome Valeska.",
    "title": "Queen Takes Knight",
    "episode": "E11",
    "season": ""
  },
  {
    "description": "\nNygma's dual personality as the Riddler takes control of him, and with his intentions to overthrow Lee as the head of the Narrows, he hires Griffin Krank to assassinate her while she gives a speech to unite the Narrows. However, the assassination attempt fails, inciting a bombing instead. Alfred and Detective Gordon help rescue those in the bombing; Alfred is hailed as a hero at a local diner, while Gordon pursues Krank. Ivy reappears in a new mutated, adult body, created by a combination of drugs and toxins. She enters the newly rebuilt Sirens nightclub and reveals her powers to Selina, and the two make an alliance. Alfred learns that Tiffany, a waitress from the diner, has been killed by her abusive boyfriend, Rooney. Although Alfred is framed for the murder, he tracks down Rooney and alongside Bullock, who is now working as a bartender, has Rooney arrested. Nygma confronts Krank, not knowing his Riddler persona hired him. Gordon, who was led to Krank by Barbara earlier, arrives and shoots Krank dead just as he reveals the Riddler's involvement; Nygma lies to Gordon, keeping his involvement a secret.",
    "title": "Pieces of a Broken Mirror",
    "episode": "E12",
    "season": ""
  },
  {
    "description": "\nIvy begins to investigate \"Project M\", which is being conducted at Wayne Enterprises and involves the experimentation and deaths of several plants, much to her anger. After she murders a Wayne Enterprises employee, a horrified Selina abandons her. Ivy then visits Bruce and poisons him, causing him to hallucinate his closest friends and allies along with a mysterious cloaked figure. Simultaneously, Ivy hypnotizes Lucius and forces him to take her to the laboratory where Project M is being conducted and she collects a sample of the Lazarus water that is being used in the experiments before escaping. Gordon tracks them down and rescues Lucius before collecting the antidote and rescuing Bruce, who believes that he has seen his future. Ivy also uses the Lazarus water to create a new flower that can immediately kill someone upon contact with the petals. Meanwhile, Jerome pesters Oswald in Arkham and he subjects him to numerous humiliating tasks in order to turn him insane and upon learning that Jerome is intending on escaping and wreaking havoc in Gotham, Oswald decides to use that to escape.",
    "title": "A Beautiful Darkness",
    "episode": "E13",
    "season": ""
  },
  {
    "description": "\nNygma begins to contemplate suicide in order to kill his dual personality but opts to return to Arkham instead. However, Oswald reappears and he reveals to him that he had specifically written the letter so that his dual personality would read it and take Nygma back to Arkham. Meanwhile, Ivy begins to exact her revenge on those who have hurt her, beginning with Bullock for the death of her father years ago. Gordon takes Bullock to the GCPD and learns that Ivy is intending on attacking the annual Wayne Foundation dinner. Bruce attempts to convince Alfred to return but the latter turns him down; he later attends the dinner as Bruce attempts to reach out to him but is unsuccessful. However, Ivy attacks the dinner and kills several people as the GCPD arrive. Bruce dresses in vigilante attire and he rescues the few remaining people there and Alfred decides to return to Wayne Manor. Following this, Selina destroys the Lazarus water to prevent Ivy from making more plants. Simultaneously, Sofia forcibly takes control of the Narrows and has Lee thrown into the streets, leading to Gordon turning to Bullock for help and deciding to take Sofia down.",
    "title": "Reunion",
    "episode": "E14",
    "season": ""
  },
  {
    "description": "\nWorking with Oswald again, Nygma rescues Martin and he delivers him to safety while Oswald escapes from Arkham. Together, they attempt to convince Lee to help them but Nygma is captured by Grundy and returned to the Sirens, who take him to Sofia. However, Oswald successfully breaks into Sofia's mansion and follows Nygma to the pier and rescues him. Simultaneously, Sofia attempts to kill Oswald but Gordon and Bullock work together to protect him before surviving an attack from her, which leads to Lee shooting Sofia in the head, putting her into a coma. Gordon plans on confessing to the GCPD but Bullock forces him to live with the guilt instead. Meanwhile, Bruce and Selina reconcile with one another and Barbara becomes affected by Ra's al Ghul's powers.",
    "title": "The Sinking Ship The Grand Applause",
    "episode": "E15",
    "season": ""
  },
  {
    "description": "\nJervis Tetch breaks himself, Jerome, Scarecrow and eighty other inmates out of Arkham, before hypnotising hundreds of Gotham citizens to stand on rooftops to force Gordon into an impossible situation. Though Tetch programs his victims to jump if they are told not to, Gordon finds a loophole and tricks the hypnotised people into saving each other, while apprehending Tetch. Bruce, blaming himself for not killing Jerome in their previous encounter, tracks him down with Selina's help, as Jerome tracks down his abusive uncle. Jerome's uncle tries to kill him but Bruce intervenes, and in the ensuing encounter, he chooses to spare Jerome again. Jerome kills his uncle after learning the location of someone he is searching for, and he and Scarecrow later rescue Tetch and head to 'St. Ignatius', pursued by Bruce, who alerts Gordon. Elsewhere Barbara, forcing herself to remember the events surrounding her resurrection, learns that Ra's al Ghul revived her so she could replace him as the Demon's Head, and she usurps leadership of the League of Shadows with help from the organisation's female members, who kill their male comrades to protect her.",
    "title": "One of My Three Soups",
    "episode": "E16",
    "season": ""
  },
  {
    "description": "\nThompkins challenges Nygma to his game, the Riddle Factory, and wagers to abolish it if she wins. After she outsmarts Nygma, the two share a kiss. Jerome Valeska assembles the \"Legion of Horribles\" – Penguin, Mad Hatter, Scarecrow, Firefly and Mr. Freeze – and sets out to find Wayne Enterprises associate Xander Wilde. Valeska shoots up a Wayne Enterprises building, but to no avail does he find Wilde, and is forced to escape when the GCPD arrive. With help from Bruce, Gordon and Bullock locate Wilde, who reveals that he is Jerome's twin brother, Jeremiah, and also reveals that he has kidnapped Jerome. Mad Hatter and Scarecrow break out Jerome from Jeremiah's custody, but are chased off by Gordon and Bullock. Cobblepot convinces Grundy to be hired muscle for the Legion of Horribles, just as Scarecrow concocts a laughing gas for Jerome to spread across the city.",
    "title": "Mandatory Brunch Meeting",
    "episode": "E17",
    "season": ""
  },
  {
    "description": "\nJerome holds the interim mayor and other powerful Gothamites hostage at a music festival and orders Gordon to bring him Bruce and Jeremiah, buying time for the other Legion members to load the laughing gas onto a blimp and release it upon the festival crowd. The GCPD takes out Jerome's men and saves the mayor, while Cobblepot betrays the Legion by subduing the pilot and steering the blimp away from civilians. Gordon pursues Jerome, who declares that he will live on and willingly falls to his death from a rooftop. Barbara learns more of her alleged destiny as the League of Shadows' leader, but Tabitha believes she is delusional; Barbara severs ties with Tabitha, who is then taken by another League faction still loyal to Ra's al Ghul. Tricked into opening a \"gift\" left by Jerome, Jeremiah is exposed to a modified version of the laughing gas that drives him insane.",
    "title": "That's Entertainment",
    "episode": "E18",
    "season": ""
  },
  {
    "description": "\nNygma robs several banks to distribute wealth to the Narrows, but Cobblepot tells him Lee is using him as a pawn. Nygma agrees to bring Cobblepot and Grundy along on his next robbery and kill Lee, but betrays them and plans to make Lee fall in love with him; the GCPD arrives, but Lee gives herself up and allows Nygma to escape. With Tabitha's help, the renegade League faction uses Bruce's blood in a ritual to resurrect Ra's al Ghul, who disdains Barbara's limited ambitions and tries to take back the power of the Demon's Head. Barbara fights Ra's, but returns the power to him when he threatens Tabitha's life. Barbara reconciles with Tabitha, while the female League members recognize her worth as a leader and continue to serve her. After a vision of a cataclysmic event that will soon devastate the city, Ra's resolves to remain alive and use the coming disaster to shape Bruce into a \"dark knight of Gotham.\"",
    "title": "To Our Deaths and Beyond",
    "episode": "E19",
    "season": ""
  },
  {
    "description": "\nUnder seemingly posthumous orders from Jerome, his followers launch an attack on GCPD Headquarters. Nygma infiltrates the precinct and breaks Lee out, while Cobblepot and Grundy torture one of Jerome's followers in order to uncover the true mastermind and regain power. At his bunker, Jeremiah works on his self-sustaining energy generator and tells Bruce he is struggling against the toxin's insanity, leading to a confrontation at Jerome's grave. Believing the GCPD attack is a diversion from Bruce and Jeremiah, Gordon heads to the bunker and learns the day's events were a subterfuge orchestrated by Jeremiah, who has modified the generator into a bomb; Gordon barely escapes as the generator explodes. Revealing his true insane personality and his plan to tear Gotham down, Jeremiah leaves Bruce unconscious and steals more generators from Wayne Enterprises.",
    "title": "That Old Corpse",
    "episode": "E20",
    "season": ""
  },
  {
    "description": "\nJeremiah plants his bombs around Gotham and gives the city six hours to evacuate before detonation. Gordon escapes the bunker with blueprints of Jeremiah's plans, but is knocked out and rescued by Lee and Nygma. Jeremiah also abducts Alfred and lures Bruce to a hideout, where Bruce enlists Selina's help. Scarecrow's fear toxin makes Bruce hallucinate an insane Alfred attacking him, but Selina frees the real Alfred, and the two save Bruce. Jeremiah is intercepted by Cobblepot, Grundy, Barbara and Tabitha, who demand a ransom on threat of destroying the bombs' core relay; Jeremiah instead destroys the relay himself and rewires the bombs to detonate in sequence. After Nygma deciphers the blueprints, Gordon brings the plans to GCPD; with help from Fox, Bullock locates and deactivates the first bomb in time. Gordon then reveals on a newscast that he is alive, as Jeremiah believed that the bomb in his bunker killed Gordon. His plans foiled, Jeremiah incinerates all his followers alive, but is later approached by Ra's al Ghul, who proposes an alliance. Bruce, Selina and Alfred return to Wayne Manor, but Jeremiah breaks in and shoots Selina in the abdomen; Alfred then subdues him.",
    "title": "One Bad Day",
    "episode": "E21",
    "season": ""
  },
  {
    "description": "\nSelina is hospitalized with likely permanent spinal damage. Ra's al Ghul kidnaps Bruce, breaks Jeremiah out of custody and steals his bombs back from the GCPD. Nygma tries to kill Gordon and free Lee from her old self, but Lee falsely convinces Nygma she no longer loves Gordon. Cobblepot, Alfred and the Sirens briefly ally against Jeremiah and the League of Shadows.  Barbara kills Ra's with his knife (gripping it in Bruce's hands), while Jeremiah's bombs kill the mayor and destroy every bridge out of Gotham, reducing the city to lawlessness. Cobblepot hires Hugo Strange, who successfully turns Grundy back into Butch; however, Cobblepot then kills Butch in front of Tabitha as retribution for his mother. Lee decides to help the civilians and breaks up with Nygma, but the confrontation ends with the two stabbing each other; Cobblepot finds their bodies and orders Strange to \"fix\" them. With Gotham largely evacuated and overrun by criminals, Bruce accepts his destiny as the city's protector and begins hunting Jeremiah. Gordon, supported by Bullock, Fox and a dozen other cops, also stays to fight for the city, and operates a searchlight atop GCPD Headquarters as a symbol against the darkness.",
    "title": "No Man's Land",
    "episode": "E22",
    "season": ""
  }
]