[
  {
    "description": "Rookie detective James Gordon and his partner Harvey Bullock are assigned to the case of the murders of Thomas and Martha Wayne, witnessed by street petty criminal Selina Kyle. Their investigation leads them to a parolee named Mario Pepper, whom Bullock kills in Gordon's defense. They discover that Pepper had been framed, leading them to mobster Fish Mooney, an associate of Carmine Falcone, an organized crime boss. Mooney has them captured, but Falcone spares them upon his arrival, revealing that he intended to end the case so that the people of Gotham could feel safe, facilitating his illegal activities. In exchange, Falcone orders Gordon to kill Oswald Cobblepot, a low-level member of Mooney's gang and informant for Gotham Major Crimes Unit (MCU) investigators Renee Montoya and Crispus Allen. Gordon fakes Cobblepot's death, and tells him never to return to Gotham. Gordon promises the Waynes' son, Bruce, and his butler, Alfred Pennyworth, to find the real killer. Cobblepot kills a fisher. Selina is seen watching the Wayne Manor. Meanwhile, Montoya threatens Barbara, Gordon's fiancee, to tell him about Barbara's unknown past.",
    "title": "Pilot",
    "date": "September 22, 2014 ",
    "directed_by": "Danny Cannon",
    "views": "8.21",
    "season": "S01",
    "episode": "E01"
  },
  {
    "description": "Gordon and Bullock start investigating the abductions of street kids by Patti and Doug, operatives of Dr. Francis Dulmacher, A.K.A the Dollmaker,[7][8][9] and have been posing as members of the Mayor's Homeless Outreach Program. Mayor Aubrey James announces plans to help Gotham's homeless kids, rounding them up and shipping them out of town. Patti and Doug hijack one of the buses of street kids, including Selina. After Bullock's extreme interrogation of an informant, Gordon obtains a clue. Gordon and Bullock arrive and catch Patti and Doug while encountering Kyle. While Bruce has plans to find a way to help the children, Gordon meets with Kyle who states that she has been watching him during his visits with Bruce and might have some information on the person who shot the Waynes. Meanwhile, Cobblepot kills two men after they mock his walking pattern. He takes refuge in a rented trailer after his faked death, plotting his return to Gotham City, having kidnapped a teenager for ransom. Falcone confronts Mooney for her plans to overthrow him, having heard from Cobblepot. The former warns her by having her lover beaten. Allen and Montoya investigate Cobblepot's mother.",
    "title": "Selina Kyle",
    "date": "September 29, 2014 ",
    "directed_by": "Danny Cannon",
    "views": "7.45",
    "episode": "E02",
    "season": ""
  },
  {
    "description": "Gordon and Bullock track a vigilante who targets corrupt Gotham officials and nicknamed \"Balloonman\" for strapping his victims to weather balloons, which eventually implode in the cold atmosphere, giving the victim a long fall. Montoya and Allen question Gordon about Cobblepot, who returns to Gotham to get revenge on Mooney. He gets a job at Don Sal Maroni's restaurant, and is befriended by Maroni himself. Mooney arranges for Falcone's lover Natalia to be disfigured in response to her own lover's beating. Gordon realizes that \"Balloonman\" is social worker Davis Lamond, who was driven to vigilantism because of corrupt officials refusing to aid children on the streets. After arrest, he warns Gordon that more vigilantes will follow in his path. Falcone tells Mooney that he will investigate what happened to Natalia, also telling about the Arkham Plan. At his apartment later, Gordon receives a surprise visit from Cobblepot. Meanwhile, Barbara is revealed to be an addict and Montoya's former girlfriend. Selina is given to Gordon for his investigation; but she uses the chance to escape.",
    "title": "The Balloonman",
    "date": "October 6, 2014 ",
    "directed_by": "Dermott Downs",
    "views": "6.36",
    "episode": "E03",
    "season": ""
  },
  {
    "description": "Cobblepot offers Gordon help in stopping the future war. The latter learns of the Arkham Plan from Alfred, who states that Falcone and Mayor James are backing the project that will improve the Arkham District, opposed by Maroni, who has another plan. An independent hitman starts targeting the city council members involved in both opposing sides of the Plan. After an armed robbery of Maroni's restaurant, Cobblepot is promoted to restaurant manager by Maroni, following the former's action of saving a bag of money and the death of the previous manager. Mooney pits two female singers against each other for her nightclub job opening, with the winner being Liza. In order to prevent the war, Mayor James holds a conference about a compromise on the Arkham Plan, that Falcone will handle small housing development projects and Maroni will be refurbishing the Asylum. Gordon urges Bruce not to lose hope in the city. Later, Cobblepot fatally poisons the restaurant robbers, who are revealed to had been hired for just that purpose by Cobblepot himself. Meanwhile, Barbara confronts Gordon about Cobblepot, telling him about her past with Montoya. She decides to end the engagement when he refuses to talk.",
    "title": "Arkham",
    "date": "October 13, 2014 ",
    "directed_by": "TJ Scott",
    "views": "6.39",
    "episode": "E04",
    "season": ""
  },
  {
    "description": "Bruce plans to find a way to speak to the board members of Wayne Enterprises to learn their connections to the Arkham District Project. A new drug called \"Viper\", a prototype of Venom, is hitting the street, endowing the user with super-strength, but eventually killing them. Maroni plans to rob a casino owned by Falcone, and Cobblepot offers a less-casualty plan, forcing him to reveal his past, which Maroni believes after Gordon confirms it. The latter learns that \"Viper\" is being distributed at a charity event held by WellZyn and Wayne Enterprises. Gordon shoots the canister on the roof and former WellZyn employee Stan Potolsky is exposed, committing suicide after he suggests they check out Warehouse 39, where Gordon and Bullock later find nothing, observed by Wayne Enterprises operative Mathis. Maroni successfully robs the casino, admiring Cobblepot. As Mooney makes plans to conspire against Falcone with her lover and Russian mob boss Nikolai, a disguised Liza visits Falcone and begins seducing him.",
    "title": "Viper",
    "date": "October 20, 2014 ",
    "directed_by": "Tim Hunter",
    "views": "6.09",
    "episode": "E05",
    "season": ""
  },
  {
    "description": "Ten years ago, a masked killer calling himself the \"Spirit of the Goat\" targets the firstborn of Gotham's elite, leading Bullock and his partner Dix to investigate the case. They find the killer, Randall Milkie, who is shot down by Bullock after Dix falls through a trap door and ends up badly injured. In the present day, Bullock finds another elite firstborn murdered by someone with the same \"Goat\" motive. Upon surgery, Bullock sees Milkie's trademark, which only he and Dix knew, meaning that he was not an copycat. During a debrief, Dix tells Gordon about Bullock's enthusiasm for justice, to Gordon's surprise. Bullock deduces that hypnotherapist Marks coerced both Milkie and the new killer to become the Goat to scare Gotham's rich and corrupt, leading to Marks' arrest. The \"murder\" of Cobblepot is also investigated, with Gordon the prime suspect as Montoya and Allen finally find a witness near the river. When they attempt to arrest Gordon and Bullock, Cobblepot enters the precinct, causing friction between Bullock and Gordon. Meanwhile, CSU operative Nygma is revealed to be in love with archivist Kristen Kringle, who ignores him. Selina infiltrates the Wayne Manor and steals a component of Bruce's investigation.",
    "title": "Spirit of the Goat",
    "date": "October 27, 2014 ",
    "directed_by": "TJ Scott",
    "views": "5.89",
    "episode": "E06",
    "season": ""
  },
  {
    "description": "Exonerated, Gordon tells Barbara to leave Gotham. Cobblepot leads Maroni enforcer Frankie Carbone and two other henchmen to Nikolai's hideout, killing the latter and Carbone by buying the loyalties of the henchmen. Montoya and Allen begin cooperating with Gordon. The escalating mob war is settled with a land trade between Maroni and Falcone. A drunken Bullock re-evaluates his choice for helping Gordon, and the two partners attempt to arrest Mayor James and Falcone, but they give up when it is revealed that Falcone and hitman Victor Zsasz have Barbara, who had returned to try and negotiate with Falcone for Gordon. Falcone allows the trio to leave. In a flashback to the night they had met Gordon, it is shown that Cobblepot and Falcone had formed a deal, in which Falcone would place Gordon in charge of killing Cobblepot, giving Cobblepot a chance at surviving, and in exchange, Cobblepot would forge an alliance with Maroni, snitching for Falcone; and Cobblepot told Falcone about Mooney and Nikolai and their plan. It is revealed that Falcone spared Gordon's life due to Cobblepot's request.",
    "title": "Penguin's Umbrella",
    "date": "November 3, 2014 ",
    "directed_by": "Rob Bailey",
    "views": "6.63",
    "episode": "E07",
    "season": ""
  },
  {
    "description": "Bruce returns to school, where he has some trouble with bully Tommy Elliot; and Alfred agrees to teach the former how to fight. Gordon and Bullock investigate Richard Sionis, who is hosting an illegal and deadly fight club where the champions are accepted for Sionis Investments. Liza's loyalty to Mooney begins to falter when she learns of the latter's plan to eventually kill Falcone, but Mooney presses her to steal a ledger from the Falcone's office that may be used to incriminate him. When Gordon is caught at the site of the fight club, Bullock persuades other officers, who collectively despise Gordon due to blaming them for leaving him during Zsasz' attack, to help find Gordon. Mooney fakes a story about her past to convince Liza to stay on the mission. After Sionis and those involved are arrested, Gordon learns that Selina was apprehended after skillfully robbing a dress store. Barbara leaves Gordon. Cobblepot learns from Mooney's henchman of a spy close to Falcone.",
    "title": "The Mask",
    "date": "November 10, 2014 ",
    "directed_by": "Paul Edwards",
    "views": "6.35",
    "episode": "E08",
    "season": ""
  },
  {
    "description": "Gordon has Selina placed at Wayne Manor for her safety. She and Bruce establish a friendship. She claims that her mother is an intelligence agent. During a prison transport from Blackgate Penitentiary to St. Mark Psychiatric Hospital, bomb maker Ian Hargrove is taken by the Russian mob, who are working against Falcone following Nikolai's death. Gordon meets with Harvey Dent, who suspects tycoon Dick Lovecraft for the Wayne murders. Gordon and Bullock realize that Hargrove intends no harm. Manipulated by Mooney, the Russians target Falcone's cache of money, but when a police standoff ensues, the Russians' armored truck explodes via remote control by Mooney's enforcer, Butch Gilzean. Cobblepot confronts Liza for spying on Falcone, whom the former claims will not tell. Mayor James announces his plans to reopen Arkham Asylum to house the mentally ill criminals, including Hargrove. Barbara is revealed to have a new relationship with Montoya.",
    "title": "Harvey Dent",
    "date": "November 17, 2014 ",
    "directed_by": "Karen Gaviola",
    "views": "6.49",
    "episode": "E09",
    "season": ""
  },
  {
    "description": "Assassins led by Copperhead[18][19][20] infiltrate Wayne Manor, but Bruce and Selina escape into the city. Alfred seeks Gordon and Bullock's help to find the pair. Dent suspects that Lovecraft hired the assassins to cover his tracks. However, Gordon learns Lovecraft is also being targeted to hide what he knows; the assassins kill Lovecraft in a staged suicide, planting Gordon's gun at the scene. Following the armory fiasco, Cobblepot tells Falcone that Mooney has a mole in his ranks, but does not reveal the identity. Selina determines the assassins are after her, and she and Bruce encounter Ivy Pepper.[21], Mario's daughter. The assassins find Selina and Bruce, but she escapes while Bullock and Alfred, who convinces Mooney to help, arrive and rescue Bruce. Selina later kisses Bruce and returns to living on the streets. Following Lovecraft's \"suicide\", Mayor James reassigns Gordon as a security guard at Arkham Asylum.",
    "title": "Lovecraft",
    "date": "November 24, 2014 ",
    "directed_by": "Guy Ferland",
    "views": "6.05",
    "episode": "E10",
    "season": ""
  },
  {
    "description": "While working at Arkham run by Dr. Gerry Lang, Gordon investigates a series of attacks on inmates with the help of Dr. Leslie \"Lee\" Thompkins. Mooney discusses her plan to overthrow Falcone with underboss Jimmy Saviano, who has a disagreement with her on succession. Cobblepot is arrested by the police for trying to further extort some fishermen already paying protection money to Maroni. The former is freed by the latter, who initiated the arrest to warn Cobblepot about hubris. Montoya ends her relationship with Barbara. Gordon, Bullock, and Captain Essen discover that the person attacking inmates was Jack Gruber[23][24], who then escapes from Arkham with his associate Aaron Danzig, after killing several guards and Dr. Lang. Saviano tries to convince Gilzean to change sides, but the latter kills him instead. Selina takes an ill Ivy to Gordon's. Barbara calls and mistakes Ivy as his girlfriend.",
    "title": "Rogues' Gallery",
    "date": "January 5, 2015 ",
    "directed_by": "Oz Scott",
    "views": "7.06",
    "episode": "E11",
    "season": ""
  },
  {
    "description": "Gruber and Danzig go on rampage through Gotham. Gordon promises Commissioner Loeb he will arrest Gruber within 24 hours. Nygma learns Gruber is a former Mafia bank robber who was betrayed by Maroni. Gordon and Bullock put Maroni under protective custody to use as bait to attract Gruber to the precinct. Gruber and Danzig attack, but Gordon thwarts them by shorting out Gruber's electrical apparatus with water. For living up to his end of the deal, Gordon is reinstated as a detective. Meanwhile, Mooney makes her move against Falcone by \"abducting\" Liza and extorting him into signing his crime family over to Mooney's gang. Falcone nearly goes through with the deal, but Cobblepot informs him that Liza is Mooney's mole. Falcone confronts Mooney, has his mercenaries take both her and Gilzean prisoner, and strangles Liza to death. Cobblepot inherits Mooney's nightclub and what's left of her gang. Barbara visits her estranged parents. Maroni begins suspecting Cobblepot. Gordon and Lee develop romance.",
    "title": "What the Little Bird Told Him",
    "date": "January 19, 2015 ",
    "directed_by": "Eagle Egilsson",
    "views": "6.50",
    "episode": "E12",
    "season": ""
  },
  {
    "description": "Mooney is tortured by Falcone's henchman, but Gilzean frees himself and rescues her. A homicide witness is murdered while under custody at GCPD. Gordon comes to suspect Narcotics Detective Arnold Flass is behind. Learning that Flass is supported by influential figures, Gordon asks Cobblepot for help, who tasks his enforcer, Gabe. Bruce asks Selina about his parents' murderer, but she reveals she lied about seeing the man's face to avoid being sent to juvenile detention. Nygma gives Kringle a romantic greeting card, but Flass finds it and mocks him; Kringle later apologizes to Nygma and admires the card. Gabe gives Gordon evidence that exposes Flass' involvement in the witness' death, and Flass is arrested. Gordon learns that Gabe threatened the family of Delaware, Flass's accomplice, for proof. Mooney and Gilzean confront Cobblepot at the nightclub, but Zsasz arrives and recaptures Gilzean. Mooney escapes decides to temporarily leave Gotham, with Bullock revealed as her lover.",
    "title": "Welcome Back, Jim Gordon",
    "date": "January 26, 2015 ",
    "directed_by": "Wendey Stanzler",
    "views": "6.04",
    "episode": "E13",
    "season": ""
  },
  {
    "description": "Gordon and Bullock investigate a serial killer who is targeting members of a phobia support group and extracting their adrenal glands. The killer turns out to be Gerald Crane, Jonathan's father; Gordon and Bullock are able to save one of his victims, but Crane evades capture. In light of Selina's recent claim of false witness, Bruce absolves Gordon of his promise to find the killer, intending to solve the case himself. Mooney informs Maroni about Cobblepot's treachery to him. Maroni tries to kill Cobblepot, who escapes. Nygma frames medical examiner Guerra for hoarding body parts after Guerra has him suspended for his repeated corpse probing. After Guerra's suspension and Nygma's reinstatement, Gordon informs Lee, who finds a clue in Crane's case, that a job has opened up for her as GCPD's medical examiner. Mooney is captured by mercenaries on a boat away from Gotham.",
    "title": "The Fearsome Dr. Crane",
    "date": "February 2, 2015 ",
    "directed_by": "John Behring",
    "views": "5.79",
    "episode": "E14",
    "season": ""
  },
  {
    "description": "Gordon and Bullock investigate Gerald's background and learn his wife died in a fire that he was too scared to rescue her from; believing fear is a human flaw, he is now harvesting adrenal glands in order to create a serum that makes people confront and overcome their greatest fears. Bruce continues a yearly family tradition by going on a hiking trip in the woods, albeit alone for the first time. He finds himself unprepared for the dangers, but Alfred eventually joins him. Maroni speaks with Falcone and agrees to let Cobblepot live, but warns the latter that it will last until Falcone's eventual death. After using the serum on himself and overcoming his fear, Gerald injects Jonathan with a much larger dose. Gordon and Bullock arrive and kill Gerald in a gunfight. Jonathan is rushed to the hospital, but the serum has sent him into a state of constant terror, and he may never stop hallucinating his greatest fear: scarecrows. Mooney wakes up among other captives and befriends a man named Kelly. She kills the prisoners' leader and takes his place, learning that their captors are organ harvesters. Lee becomes the new medical examiner.",
    "title": "The Scarecrow",
    "date": "February 9, 2015 ",
    "directed_by": "Nick Copus",
    "views": "5.63",
    "episode": "E15",
    "season": ""
  },
  {
    "description": "Barbara returns to Gotham to find Ivy and Selina squatting in her apartment. Gordon and Lee investigate the murder of Lila Valeska, a snake dancer with Haly's Circus, and the contesting families Flying Graysons and the Lloyds are suspects. Gordon determines that Lila's son Jerome is the killer, which he eventually admits maniacally. When business begins to decrease at Cobblepot's club, Zsasz brings in a brainwashed Gilzean for help. Taking advice from Selina and Ivy, Barbara attempts to reunite with Gordon, but changes her mind after she sees him kissing Lee. Bruce holds a board meeting at Wayne Enterprises and voices concern to the executives that the company is involved with the mob, threatening with legal action. John Grayson and Mary Lloyd get engaged after the dispute between the two families are resolved. Mooney manages to get a meeting with the captors' boss after uniting the prisoners against the captors.",
    "title": "The Blind Fortune Teller",
    "date": "February 16, 2015 ",
    "directed_by": "Jeffrey Hunt",
    "views": "6.19",
    "episode": "E16",
    "season": ""
  },
  {
    "description": "An armed group robs a bank, and one wearing a red mask throws some of the stolen money into the crowd to ensure their escape. Gordon and Bullock identify the \"Red Hood\" as Gus Floyd, but find him dead in the hideout. After a robbery led by Carl Destro, who now wears Floyd's mask, and the Hood becoming a public hero, Gordon and Bullock track him to his house where they find him wounded and the mask gone. With information given by Destro, the police find and kill the remainder of the gang in a shootout. A teenage boy steals the mask. Meanwhile, Cobblepot struggles from Maroni's actions against the restaurant, but Butch uses some fake policemen to seize Maroni's supplies. Mooney discovers that the facility is owned by Dulmacher, meeting the manager, who tries to take her eye for organ trade purposes; but she removes it herself and destroys it before passing out. An old comrade of Alfred, Reginald Payne, visits him in the Manor and stays over night. On the next day, however, he steals some of Bruce's files, stabs Alfred to evade capture and reports to the Board that Bruce has no solid evidence.",
    "title": "Red Hood",
    "date": "February 23, 2015 ",
    "directed_by": "Nathan Hope",
    "views": "6.53",
    "episode": "E17",
    "season": ""
  },
  {
    "description": "At the hospital, Alfred refuses to implicate Payne. Gordon and Dent investigate the sudden release and reinstatement of Flass by Loeb, who announces his support of Flass as the new president of the policemen's union. Bullock reveals that Loeb has leverage to blackmail most officers; in Bullock's case, Loeb forced him to falsely confess to providing illegitimate evidence against Flass. Investigating a triad bookmaking office and interrogating Loeb's former partner, Gordon learns that Loeb has ties with Falcone. With Cobblepot's help, Gordon and Bullock investigate Loeb's uptown farm, where they find the latter's psychotic daughter Miriam, who confesses to her mother's murder, which Gordon uses to terminate Bullock's case by blackmailing Loeb, who announces Gordon as the new candidate. Meanwhile, Mooney finally meets Dulmacher, who provides her with a blue-irised eye and allows her to prove herself in order to become his right hand woman. She surrenders some of the prisoners, including Kelly. She discovers that the facility is situated on a snowy island. Selina visits Bruce and offers her help in his investigation, which he refuses. Nygma learns that Kringle has a new boyfriend in the GCPD.",
    "title": "Everyone Has a Cobblepot",
    "date": "March 2, 2015 ",
    "directed_by": "Bill Eagles",
    "views": "6.10",
    "episode": "E18",
    "season": ""
  },
  {
    "description": "Despite Gordon's warning, Bruce goes after Payne with Selina's help. Payne confesses that he was hired by the Board. Selina pushes Payne out a window after Bruce hesitates to do so, presumably killing him. Gordon and Bullock investigate an unsolved murder case. Upon Nygma discovering a painting of a broken heart as the key evidence, Bullock realizes that the serial killer called \"the Ogre\" is responsible. Harvey then states that everyone who tried to investigate the Ogre lost their loved ones. It is revealed that the Ogre keeps his victims prisoner for some time, until he realizes she is not a fit for his desire, so he kills her. Meanwhile, Oswald manages to convince a bar owner to do business, but his real intention is to kill Maroni in the bar. Mooney succeeds in escaping with Kelly and some other inmates by luring another group to a fatal deadend. She is shot during the takeoff by the \"Catcher\", the chief guard. It is revealed that Loeb had the case given to Gordon, but the latter decides to continue the investigation, knowing the threat upon Lee. Gordon promises Loeb that he will face justice too.",
    "title": "Beasts of Prey",
    "date": "April 13, 2015 ",
    "directed_by": "Eagle Egilsson",
    "views": "4.50",
    "episode": "E19",
    "season": ""
  },
  {
    "description": "Lee refuses to leave town, staying at the GCPD. The \"Ogre\" calls Gordon and makes his typical threat. Following the incident with Payne, Bruce and Selina attend Wayne Enterprises' Charity Ball with Barbara, where Selina copies keys from Sid Banderslaw, one of the executives who hired Payne. Cobblepot allies himself with Irish hitmen in hopes of killing Maroni, who visits the club and reveals to the former's mother that her son is a psychopathic killer. Nygma tries to protect Kringle from her abusive boyfriend Tom Dougherty, but goes too far when he stabs him to death and has a psychotic breakdown. Investigating the Ogre's first victim, Gordon, Bullock, and Essen identify the killer as Jason Skolimski, who illicitly inherited the fortune of a woman, whose butler is his father, who covered up the murder. Gordon learns that Jason saw him with Barbara at a charity event some time prior, meaning she is the target. Jason approaches Barbara at the Ball and takes her to his home, witnessed by Selina.",
    "title": "Under the Knife",
    "date": "April 20, 2015 ",
    "directed_by": "TJ Scott",
    "views": "4.44",
    "episode": "E20",
    "season": ""
  },
  {
    "description": "Jason holds Barbara captive and forces her at knifepoint to choose his next victim. Nygma disposes of Dougherty's body and forges a letter from him saying a cold goodbye to Kringle. Bruce sneaks into Bunderslaw's office to open his safe, but Bunderslaw was expecting Bruce and has emptied it. He claims that Thomas knew of Wayne Enterprises' illegal activities but kept quiet. Junior executive Lucius Fox tells Bruce that Thomas did not approve of the company's crimes. Bruce confesses his and Selina's adventures, including Payne's death, to Alfred. Cobblepot sends the hitmen to attack Maroni, but is revealed to have set up the plan to frame Falcone and start a war between the two mob bosses. Gordon and Bullock locate Jason's apartment, but he and Barbara have already left for her parents' mansion. There, they find her parents dead, and Gordon kills Jason after a standoff. Later, Gordon reassures Lee that he no longer loves Barbara. Maroni begins attacking Falcone's men, and Essen calls all GCPD officers to remain on duty during the upcoming gang war.",
    "title": "The Anvil or the Hammer",
    "date": "April 27, 2015 ",
    "directed_by": "Paul Edwards",
    "views": "4.58",
    "episode": "E21",
    "season": ""
  },
  {
    "description": "The mob war between Falcone and Maroni escalates. Cobblepot attempts to kill Falcone himself and take his place, but Gordon intervenes. As Maroni's men approach, Gordon and Bullock bring Falcone, Cobblepot, and Butch to a safe house, but Mooney's new gang, including Selina, take them captive. Maroni arrives, but Cobblepot manipulates him and Mooney into a dispute over mob leadership. Mooney abruptly kills Maroni. Gordon, Bullock, and Falcone escape in the ensuing chaos. While Butch struggles on whom to be loyal to, Cobblepot fights and throws Mooney off the roof into the water, calling himself Gotham's new crime lord. Barbara undergoes trauma counseling with Lee; she reveals she killed her parents and attacks Lee, who neutralizes her. Kringle begins suspecting Nygma's involvement in Dougherty's disappearance; and he is revealed to have a second personality. Falcone retires from the mob, urging Gordon to continue fighting crime. Believing his father led a secret life and remembering a subtle clue from Fox, Bruce discovers a hidden stairwell behind the fireplace.",
    "title": "All Happy Families Are Alike",
    "date": "May 4, 2015 ",
    "directed_by": "Danny Cannon",
    "views": "4.93",
    "episode": "E22",
    "season": ""
  },
  {
    "description": "Having resigned, Bullock is working as a bartender while Gordon is demoted to an officer and eventually fired by Commissioner Loeb. Gordon works with Cobblepot, now a crime boss having employed Zsasz and Selina, to force Loeb to reinstate Gordon as a detective, resign and give his position to Essen in exchange for Gordon collecting a debt from a mobster and regretfully killing him to protect himself. Meanwhile, several inmates of Arkham Asylum including Barbara Kean, Aaron Helzinger, Jerome Valeska, Arnold Dobkins, Richard Sionis and Robert Greenwood are broken out by Theo Galavan and his sister/enforcer, Tabitha[38][39]. All but Sionis agree to join forces with Theo; Sionis is killed for his refusal. Bruce and Alfred discover a secret office at the end of the staircase, with a letter from Thomas, urging Bruce to choose between happiness and the truth.",
    "title": "Damned If You Do...",
    "date": "September 21, 2015 ",
    "directed_by": "Danny Cannon",
    "views": "4.57",
    "season": "S02",
    "episode": "E01"
  },
  {
    "description": "Theo kidnaps Mayor James while his group of \"Maniax\", excluding Barbara, begin a killing spree for the sake of publicity. Gordon fails to persuade Bullock to return. Dobkins is arrested before being killed by Tabitha using a sniper rifle. While Barbara lures Gordon out of GCPD, the Maniax attack and kill several police officers; Nygma is wounded saving Kringle. Helzinger beats up Gordon until he is stopped by Barbara. Jerome kills Greenwood and fatally wounds Essen. Following this, Bullock rejoins the force to stop the Maniax. Meanwhile, Alfred destroys the computer in the secret room, intending to protect Bruce, who gets angry and fires him. Alfred later agrees to return with the condition of training Bruce how to fight. Bruce has Fox begin fixing the computer.",
    "title": "Knock, Knock",
    "date": "September 28, 2015 ",
    "directed_by": "Rob Bailey",
    "views": "4.65",
    "episode": "E02",
    "season": ""
  },
  {
    "description": "Gordon and Bullock start searching for Jerome, but discover Paul Cicero, Jerome's father, already murdered, Theo tells Barbara, who has a romantic relationship with Tabitha, that his family built Gotham and he is seeking revenge on those who tarnished his family name. He attends a charity event that Alfred, Bruce and Lee also do. Alfred develops feelings toward Lee. Jerome and Barbara impose as magicians and take the guests hostage. Bruce and Selina manage to escape; but he returns to save Alfred. Gordon fails to persuade the officers for a rescue operation, entering the building alone. The situation turns out to be an elaborate ruse wherein Theo kills Jerome and is perceived to be a hero. Alfred learns about Gordon and Lee. Tabitha learns that Barbara is involved with Theo. Bullock threatens Cobblepot not to ask Gordon for anymore \"favors\". Several Gotham citizens see Jerome's actions on television and begin having mental breakdowns.",
    "title": "The Last Laugh",
    "date": "October 5, 2015 ",
    "directed_by": "Eagle Egilsson",
    "views": "4.33",
    "episode": "E03",
    "season": ""
  },
  {
    "description": "Nathaniel Barnes, a new captain of the GCPD, arrives to clean up department and end corruption. With Gordon's assistance, they recruit several aspiring police graduates from the Academy in order to form a Strike Force team called Unit Alpha to accomplish the goal. Theo kidnaps Kapelput and blackmails Cobblepot into murdering all of the other candidates so that the former can run for mayor unopposed. When Selina begins looking for Bruce at his prep school, Alfred punches her for Payne and demands her to stay away from Bruce. Shortly afterwards, Bruce meets with Theo to thank him for saving his life during the charity event and meets his niece, Silver St. Cloud, who is also attending the school. Nygma begins dating Kringle. As Cobblepot begins to have Butch quietly search for Kapelput, Gordon confronts him for attacking the candidates. Cobblepot threatens to reveal Gordon's affiliations to Barnes, who directs Unit Alpha to target Cobblepot.",
    "title": "Strike Force",
    "date": "October 12, 2015 ",
    "directed_by": "TJ Scott",
    "views": "4.17",
    "episode": "E04",
    "season": ""
  },
  {
    "description": "Theo has Bunderslaw kidnapped; and Tabitha removes one of his eyes. Unit Alpha busts one of Cobblepot's money laundering facilities. Theo asks Gordon to endorse his campaign, which he declines. Tabitha tasks Cobblepot to burn buildings owned by Wayne Enterprises; and he lures her into believing that he has become paranoid with his henchmen's loyalties. He hires the Pyke arsonist family, giving them Bunderslaw's eye, which they use to steal an old knife. Cobblepot learns from an antiquist that 200 years prior, the Waynes destroyed the Dumas, beginning with cutting one's hand off by the knife. The Dumas' remnants changed their family name to Galavan. Cobblepot deduces that the Galavans want revenge upon the Waynes and tasks Butch to infiltrate the Galavans using Cobblepot's paranoia and free Kapelput, cutting off Butch's hand to support the deceit. Unit Alpha ambushes Bridgit Pyke, who fatally burns an officer. She escapes with Selina. Gordon decides to endorse Theo, who is revealed to be affiliated with a monk named Creel.",
    "title": "Scarification",
    "date": "October 19, 2015 ",
    "directed_by": "Bill Eagles",
    "views": "4.19",
    "episode": "E05",
    "season": ""
  },
  {
    "description": "Barnes scolds Gordon for using extreme interrogation. Bridgit is abducted and further abused by her brothers after attempting to leave Gotham. She kills them and begins killing other criminals. After a visit to Selina's hideout, Gordon and Bullock find the Pike brothers dead. As Bruce and Silver begin developing feelings, Theo promises him to help clean up the corruption at Wayne Enterprises. Butch discovers Kapelput's location before being discovered by Theo. The former escapes and tells Cobblepot, who begins rallying a rescue team. Bridgit is incapacitated in a struggle with the GCPD strike force, publicly announced to be dead much to the dismay of Selina, who tells Gordon about Cobblepot's involvement. Nygma tells Kringle about Dougherty before accidentally killing her when she attempts to escape him. Bridgit is revealed to be alive with her suit had melted onto her, rendering her fireproof. She is taken to Indian Hill, an underground division of Wayne Enterprises where illicit experiments are performed.",
    "title": "By Fire",
    "date": "October 26, 2015 ",
    "directed_by": "TJ Scott",
    "views": "4.32",
    "episode": "E06",
    "season": ""
  },
  {
    "description": "Butch leads Cobblepot to Gertrud's location, where Theo and Tabitha are waiting. The former is revealed to have been freed of his brainwash, betraying Cobblepot. Tabitha kills Gertrud before Cobblepot manages to escape, vowing to get revenge. Theo, now elected mayor, convinces the GCPD that Cobblepot assaulted him and has Dent obtain a warrant for Cobblepot's arrest. Gordon begins suspecting Theo and tracks down Butch, who reveals Theo's actions. Theo attends his victory celebration at which the GCPD are secretly stationed, ready to capture Cobblepot if he arrives. Cobblepot shows up with his henchmen, but is quickly ambushed by Gordon and narrowly escapes. Gordon promises Theo to expose his corruption. Tabitha murders a Unit Alpha member to escape. Following Kringle's death, Nygma's split personality convinces him that he enjoys getting away with murder. Both of Nygma's personalities then merge. Silver is revealed to be involved in Theo's plans and assigned to seduce Bruce. She succeeds while causing a friction between him and Selina.",
    "title": "Mommy's Little Monster",
    "date": "November 2, 2015 ",
    "directed_by": "Kenneth Fink",
    "views": "4.27",
    "episode": "E07",
    "season": ""
  },
  {
    "description": "Due to Gordon's investigation, Theo accelerates his plans, offering Bruce the identity of his parents' murderer in exchange for buying his voting shares in Wayne Enterprises. Barnes recruits more officers into the Strike Force. In order to keep Gordon distracted from Bruce, Barbara surrenders to GCPD and offers information against Theo. While en route to an unknown location on her instructions, they are ambushed by Theo's operatives. Gordon wakes up in the church where he and Barbara were planning to marry. She brings an abducted Lee for execution. Bullock deduces the location. While the Strike Force engages Tabitha's crew and rescues Lee, Gordon briefly fights Barbara, leading to her severe injuries after due to a fall. Following information provided by Barbara, GCPD rescues James. Bruce declines Theo's proposition just as Gordon arrives and arrests Theo, who destroys the evidence on the Waynes' killer. While trying to bury Kringle and another victim, Nygma discovers an injured and exhausted Penguin, who asks Nygma for help.",
    "title": "Tonight's the Night",
    "date": "November 9, 2015 ",
    "directed_by": "Jeffrey Hunt",
    "views": "4.11",
    "episode": "E08",
    "season": ""
  },
  {
    "description": "Seeking revenge for Barbara's injuries, Tabitha hires an assassins agency against Gordon. Bruce tries to get information about his parents' killer from Silver, but is stopped by Alfred, who demands her to stay away from the former, whom he warns not to pursue the case without Gordon. When Bruce tries to sneak out, he is stopped by Selina, who claims she has evidence for Silver's malevolence. Gordon and Barnes investigate Theo's penthouse for evidence. The assassins arrive; Gordon and Barnes manage to overpower them, but Barnes is severely injured. Barnes tells Gordon about a teenage prisoner he killed while serving as a marine, assuring him that they are not evil since they are enforcing the law. Police backup is eliminated by another assassin named Eduardo Flamingo. After coming close to killing him, Gordon arrests Flamingo, but, before being placed in his cell, Flamingo kills another officer. Meanwhile, Nygma persuades Cobblepot to move on from Gertrud's death and kill one of Theo's kidnapped henchmen in celebration. Tabitha visits Theo, who warns her not to interfere with his plans. Creel's fellow monks arrive in Gotham.",
    "title": "A Bitter Pill to Swallow",
    "date": "November 16, 2015 ",
    "directed_by": "Louis Shaw Milito",
    "views": "4.35",
    "episode": "E09",
    "season": ""
  },
  {
    "description": "Bruce and Silver are kidnapped by a mercenary named Tom, who manipulates her into seemingly revealing the name of the Waynes' killer, named M. Malone. Tom is revealed to have been hired by Bruce and Selina to extract the truth from Silver, who later claims that she lied. Bruce later admits feelings to Selina. The monks known as the Order of Saint Dumas begin a killing spree, which Gordon connects to the Galavans. Theo is released after James lies, framing Cobblepot for the kidnapping. Gordon is abducted by Theo, who reveals the history of his family to Gordon, and overpowers him in a duel; but Gordon is rescued by Cobblepot and Gabe. Alfred grows suspicious of Bruce's whereabouts and searches Theo's residence, where he is wounded in a fight with Tabitha, whom he narrowly escapes from. When Lee notices Kringle's absence, Nygma tells her that Kringle left town with Dougherty. Theo breaks into Wayne Manor and attacks Bruce.",
    "title": "The Son of Gotham",
    "date": "November 23, 2015 ",
    "directed_by": "Rob Bailey",
    "views": "4.00",
    "episode": "E10",
    "season": ""
  },
  {
    "description": "Gordon wakes up in Nygma's house only to learn from Cobblepot that he is now a fugitive for assaulting Theo. Lucius finishes fixing the computer, but finds no one at the Manor. Gordon and Cobblepot begin making plans to break into Theo's residence, save Bruce and defeat the Order. Lee tells Gordon that she is pregnant. Theo tasks Silver to seduce Bruce again, warning to expel her if she fails. Bruce learns of Silver's mission and decides to lure Theo into believing her success. Gordon, Bullock, Alfred, Selina, Cobblepot and his gang all arrive at Theo's residence just as the Order is about to kill Bruce. As the Order is decimated, Theo, Tabitha, and Silver begin to make their escape. Tabitha and Silver escape but leave Theo behind. Cobblepot convinces Gordon that Theo might never be convicted and the two take Theo to the docks and murder him. Gordon proposes to Lee. Theo's body is taken Indian Hill where Fish Mooney's body also is being kept. Theo's body is assigned to one Professor Strange.",
    "title": "Worse Than a Crime",
    "date": "November 30, 2015 ",
    "directed_by": "Jeffrey Hunt",
    "views": "4.51",
    "episode": "E11",
    "season": ""
  },
  {
    "description": "Several weeks following Theo's death, Gordon is called in for questioning and Cobblepot is arrested. Gordon and Cobblepot lie to the police, stating that Cobblepot murdered Galavan due to insanity and Gordon was not involved. The latter is reinstated into the GCPD, while Cobblepot is sent to Arkham, where he becomes a patient of Strange, the Chief of Psychiatry. Butch takes over Cobblepot's criminal empire and is seduced by Tabitha. Gordon and Bullock begin investigating a kidnapping and murder spree, unaware that a scientist named Victor Fries is the culprit. Victor has been experimenting on freezing and re-animating humans so as to find a cure for his terminally ill wife Nora. When the police target Victor as a suspect, they discover his laboratory while he is away and arrest Nora. After learning of the arrest, Victor attempts to turn himself in before witnessing one of his subjects reanimated and deducing the treatment. Cobblepot learns of the illicit experiments conducted by Strange, who receives news of Victor's activities and begins making plans to recruit him for Indian Hill, where Bridgit is reported to be resisting the procedures.",
    "title": "Mr. Freeze",
    "date": "February 29, 2016 ",
    "directed_by": "Nick Copus",
    "views": "4.12",
    "episode": "E12",
    "season": ""
  },
  {
    "description": "At Arkham, Strange begins overseeing intensive treatments for Cobblepot's aggressive tendencies. Upon learning that Nora is being sent to the medical wing at Arkham, Victor builds an armoured suit. Strange learns the truth about Theo's death. Victor arrives at the asylum and, with Strange facilitating his activities in exchange for one of his cartridges, manages to escape with Nora. Gordon deduces that Victor will return to his home laboratory in order to freeze Nora and the police surround the building. In the laboratory, Nora blames herself for the murders. Victor freezes her, only to learn that she switched the cartridges when he was not looking, leading to her death. He attempts suicide by freezing himself. Publicly pronounced dead, he wakes up in Indian Hill to discover that he can no longer survive outside of subzero temperatures. He meets Strange, who offers him an alliance as a fellow scientist and a modified suit for outside world. Gordon and Lee's relationship faces a friction. Elsewhere, Bruce researches a lead, believing he has discovered the killer to be Patrick \"Matches\" Malone. Bruce falsely promises Alfred to let him kill Malone when found, but asks Selina to find him a gun.",
    "title": "A Dead Man Feels No Cold",
    "date": "March 7, 2016 ",
    "directed_by": "Eagle Egilsson",
    "views": "4.54",
    "episode": "E13",
    "season": ""
  },
  {
    "description": "Bruce receives a gun from Selina and goes on the hunt for Malone with Alfred. To get the information, Alfred is forced to fight in an underground club, landing him in the hospital. After Bruce goes on the hunt himself, Alfred contacts Gordon and Bullock so that they can protect Bruce, who locates Malone, who seemingly confirms he is responsible for the murder of Bruce's parents, refusing to name the employer. He asks Bruce to kill him, but Bruce holds back at the last moment and leaves the gun behind, leading to Malone committing suicide. Later, in the cave, Alfred reads Bruce's letter about him moving to the streets with Selina to learn how to fight crime. Meanwhile, Leslie asks Gordon to investigate Kringle's sudden disappearance. When Nygma is informed, he vows to outsmart Gordon. After running a few more tests on Cobblepot, Strange declares him sane and releases him from Arkham, all the while stating that he still has \"deeper plans\" for him.",
    "title": "This Ball of Mud and Meanness",
    "date": "March 14, 2016 ",
    "directed_by": "John Behring",
    "views": "4.01",
    "episode": "E14",
    "season": ""
  },
  {
    "description": "Cobblepot meets and reconciles with Butch, disapproved by Tabitha. After seeing and disappointing Nygma, Cobblepot visits Gertrud's grave, meeting his father Elijah Van Dahl, who had an affair with Gertrud when she served his wealthy family, who forcefully separated the pair. Dahl welcomes Cobblepot into his family, with his wife and her children despising Cobblepot. Nygma begins a series of crimes that involve brain teasers. As Gordon begins solving these crimes, Nygma kills Officer Pinkney, deceiving the GCPD that Gordon killed Pinkney to cover up Theo's murder, to which Pinkney was presumably a witness. An angry Barnes arrests Gordon. After a trial, Gordon is found guilty and sentenced to Blackgate Penitentiary. Bullock vows to prove Gordon's innocence. Selina begins training Bruce as they steal money from Butch's nephew, with Bruce taking a massive beating from the nephew in the process. He later tells her that he believed in his stamina. Barbara wakes from her catatonic state in Arkham.",
    "title": "Mad Grey Dawn",
    "date": "March 21, 2016 ",
    "directed_by": "Nick Copus",
    "views": "3.89",
    "episode": "E15",
    "season": ""
  },
  {
    "description": "Gordon begins adjusting to life in prison. Warden Carlson Grey moves Gordon to the General Population, part of his plan to have Gordon killed. The latter is constantly aided by C.O. Wilson Bishop. Gordon is told by Bullock that Lee has lost their baby and left town. Later, he is defended from attackers by convict Peter \"Puck\" Davies, who is beaten and sent to the infirmary. In an attempt to save Gordon, Bullock meets with Falcone. Gordon's death is successfully staged; and he and Puck escape. Puck dies from his injuries, while Gordon is given a safe house so he can prove his innocence and find Lee. Meanwhile, Oswald reveals his criminal past to Dahl, who forgives him. Dahl learns from his physician that he has little time to live. After several failed attempts to expel Oswald and claim Dahl's fortune, his wife Grace and her children Sasha and Charles poison a drink for Oswald to ingest. However, Dahl drinks from the bottle and dies, after stating to Oswald his intentions of changing his will in favor of him.",
    "title": "Prisoners",
    "date": "March 28, 2016 ",
    "directed_by": "Scott White",
    "views": "3.82",
    "episode": "E16",
    "season": ""
  },
  {
    "description": "Gordon continues fleeing the law as he tries to clear his name. When Gordon secretly approaches Nygma for help, he deduces that Nygma framed him and escapes him after being shot. He goes to Selina's, tasking her to give a false report to the GCPD, luring Nygma into relocating Kringle's body. Gordon follows Nygma into the woods, where the latter admits that he framed Gordon as the GCPD eavesdrops on the conversation. They arrest Nygma before he can kill Gordon. Nygma is placed in Arkham. Barnes offers Gordon his job back, but Gordon decides to find Malone's employer first, with Barnes giving him Lee's phone number and workplace. Strange has Barbara released in spite of her incomplete treatment, intending to watch her activities. She visits Gordon. After Alfred tells him of Lucius having fixed the computer, Bruce decides to stay at the manor and push Selina away for her safety. Following Dahl's funeral, Cobblepot is bullied by Grace and her children. However, when he discovers evidence that they killed Dahl, his former self returns and he kills the trio.",
    "title": "Into the Woods",
    "date": "April 11, 2016 ",
    "directed_by": "Oz Scott",
    "views": "3.71",
    "episode": "E17",
    "season": ""
  },
  {
    "description": "Bruce, Lucius, and Alfred search through the secret files on Thomas's computer with the goal of finding a clue to his and Martha's murder. Claiming to be cured of her condition, Barbara tries to reconcile with Gordon, but to no avail. With her unorthodox assistance, Gordon discovers that the person who contracted Malone to kill the Waynes is known as \"the Philosopher.\" Bruce and Alfred track a lead from Thomas's computer and find Karen Jennings, a former Blackgate inmate on whom experiments were performed at Pinewood Farms, a Wayne Enterprises facility, by the Philosopher. She offers to identify the Philosopher, but Fries is sent to kill her. Following Jennings' death, Lucius does further research and discovers that Strange is the Philosopher. After many failed attempts, Strange finally succeeds in resurrecting someone from the dead: Theo. Barbara returns to Tabitha.",
    "title": "Pinewood",
    "date": "April 18, 2016 ",
    "directed_by": "John Stephens",
    "views": "3.72",
    "episode": "E18",
    "season": ""
  },
  {
    "description": "Gordon questions Strange about his activities, which later makes Strange send a brainwashed Theo, now under the name Azrael, to take out Gordon. Nygma overhears Strange and Peabody complaining about Gordon's interference, offering help in defeatin Gordon, but Strange refuses. Bruce is told by Bullock and Gordon that there is not enough evidence to arrest Strange. Azrael gets some memories back after looking at posters from Galavan's election. Barnes puts Gordon in holding to protect him before the lights flicker and Azrael shows up, killing a few officers and making an unsuccessful attempt on Gordon's life. Barnes and Gordon flee to the roof, where Barnes fights Azrael with a pipe, breaks his supposedly legendary sword, and rips off his mask, revealing Azrael's identity to the public. In the end, Barnes is sent to the hospital and Gordon heads home, watched by Azrael from a distance. Nygma uses some inmates under his influence to infiltrate Strange's secret ward.",
    "title": "Azrael",
    "date": "May 2, 2016 ",
    "directed_by": "Larysa Kondracki",
    "views": "3.59",
    "episode": "E19",
    "season": ""
  },
  {
    "description": "Together with Bullock and a crew of police officers, Gordon arrives at Arkham with a warrant to inspect Strange's office. Strange is one step ahead, having shredded all of his documents. Nygma, in the meantime, is disturbed by what he saw at Indian Hill and determines to escape. Bullock becomes the acting captain. Bruce decides to go off with Selina to find a way into Arkham. She accepts in order to rescue Bridgit, but insists she go in on her own. Gordon and Bullock arrive at Butch's mansion to talk with Tabitha, who states the sword Azrael used was fake and that the real one is located in her grandfather's tomb, where they arrive and acquire it. Azrael arrives, injuring Tabitha and escaping with the sword. Selina encounters Nygma, who gives her instructions to enter Indian Hill in exchange for the way out. Gordon warns Alfred about Azrael just as Bruce returns to Wayne Manor. Gordon arrives and shoots Azrael multiple times, but he remains undefeated until Cobblepot and Butch arrive and kill Azrael with an RPG. Nygma is captured while Selina is attacked by Bridget, who has no memories of her past and calls herself \"Firefly\".",
    "title": "Unleashed",
    "date": "May 9, 2016 ",
    "directed_by": "Paul Edwards",
    "views": "3.67",
    "episode": "E20",
    "season": ""
  },
  {
    "description": "Seeing Firefly's defeat improbable, Selina convinces her to accept her as a \"servant\". Bruce learns of her capture. As Strange's unknown female employer pushes him for results, his project continues; and he successfully resurrects Fish, the first subject to retain full mental function. Bruce believes that there is a secret room in Arkham where Strange is experimenting on the dead and that the only way to be certain is if they head in themselves. Bruce, Gordon, and Fox visit Arkham to execute their plan, but their motives are revealed and all three are captured. Fish learns that she can control the mind of the person she touches. Bruce and Fox are put in a chamber and interrogated by Nygma on Strange's behalf while Gordon is taken into another room with Strange and introduced to Basil, a patient whose skin stretches more than humanly possible. As Bullock leads a Strike Force team to Arkham, Strange places Gordon in a machine and replicates his visage onto Basil's face.",
    "title": "A Legion of Horribles",
    "date": "May 16, 2016 ",
    "directed_by": "Rob Bailey",
    "views": "3.84",
    "episode": "E21",
    "season": ""
  },
  {
    "description": "Disguised as Gordon, Basil pulls the GCPD off of Arkham; however, Barbara later exposes Basil as an impostor. Strange prepares to detonate a bomb beneath Arkham and tells Peabody to transfer the patients to another facility. Mooney gains control of Peabody, but Strange starts the bomb's countdown anyway. With Nygma's help, Gordon and Lucius stop the bomb. Mooney escapes in a bus with the other enhanced inmates, and encounters a shocked Penguin on the street; she knocks him out, prompting Butch and his gang to flee. Strange is arrested, Gordon leaves to find Lee, entrusting Gotham to Bullock. Bruce tells Alfred of his plans to find the secret council that wants him dead. A homeless woman opens the abandoned bus, unwittingly releasing the inmates upon Gotham; among them is a boy identical to Bruce.",
    "title": "Transference",
    "date": "May 23, 2016 ",
    "directed_by": "Eagle Egilsson",
    "views": "3.62",
    "episode": "E22",
    "season": ""
  }
]