[
  {
    "description": "Rookie detective James Gordon and his partner Harvey Bullock are assigned to the case of the murder of Thomas (Grayson McCouch) and Martha Wayne (Brette Taylor), which was witnessed by street orphan Selina Kyle. Gordon meets the Waynes' son, Bruce, and promises the boy that he will find the killer. Their investigation leads them to a parolee named Mario Pepper, whom Bullock shoots when he flees and attacks Gordon. They discover that Pepper had been framed, leading them to mobster Fish Mooney, an associate of Don Carmine Falcone. Mooney has them captured, but Falcone spares them upon his arrival. In exchange, Falcone orders Gordon to kill Oswald Cobblepot, a low-level member of Mooney's gang and informant for Gotham MCU investigators Renee Montoya and Crispus Allen. Gordon fakes Cobblepot's death, and tells him never to return to Gotham. Gordon and Bullock are celebrated for solving the Wayne murders, but Gordon confesses the truth to Bruce and his butler, Alfred Pennyworth. As Gordon leaves, Selina is seen lingering around the borders of Wayne Manor.",
    "title": "Pilot",
    "date": "September 22, 2014 ",
    "directed_by": "Danny Cannon",
    "views": "8.21",
    "season": "S01",
    "episode": "E01"
  },
  {
    "description": "The murder of a homeless man leads Gordon and Bullock to investigate the abductions of street kids by Patti (Lili Taylor) and Doug (Frank Whaley), who are underlings of Dr. Francis Dulmacher, A.K.A the Dollmaker,[7][8][9] and have been posing as members of the Mayor's Homeless Outreach Program. Meanwhile, Oswald Cobblepot takes refuge in a rented trailer after his faked death, plotting his return to Gotham City. After Patti and Doug escape, with Quillinformer worker Morry Quillan (Wayne Duvall) captured, Mayor Aubrey James (Richard Kind) announces plans to help Gotham's homeless kids, which involves rounding them up and shipping them out of town. Patti and Doug return and hijack one of the buses of street kids, including Selina Kyle. After Bullock's interrogation of Quillan, Gordon obtains a clue that leads to Trident International Shipping. Gordon and Bullock arrive and catch Patti and Doug while encountering Kyle. While Bruce has plans to find a way to help the children, Gordon meets with Kyle who states that she has been watching him during his visits with Bruce and might have some information on the person who shot the Waynes.",
    "title": "Selina Kyle",
    "date": "September 29, 2014 ",
    "directed_by": "Danny Cannon",
    "views": "7.45",
    "episode": "E02",
    "season": ""
  },
  {
    "description": "Gordon and Bullock track a vigilante who targets corrupt Gotham citizens and nicknamed \"Balloonman\" for strapping his victims to weather balloons. Montoya and Allen question Gordon about Cobblepot, who returns to Gotham to get revenge on Mooney. He gets a job at Don Sal Maroni's restaurant, and is befriended by Maroni (David Zayas) himself. Mooney arranges for Falcone's lover Natalia to be disfigured in a phony mugging after Falcone's men severely beat a waiter with whom Mooney had been sexually coupled. Gordon realizes that \"Balloonman\" is social worker Davis Lamond (Dan Bakkedahl), who was driven to become the Balloonman because of corrupt officials refusing to aid children on the streets. He warns Gordon that more vigilantes will follow in his path. At his apartment later, Gordon receives a surprise visit from Cobblepot.",
    "title": "The Balloonman",
    "date": "October 6, 2014 ",
    "directed_by": "Dermott Downs",
    "views": "6.36",
    "episode": "E03",
    "season": ""
  },
  {
    "description": "Gordon learns of the Arkham Plan when he visits Bruce Wayne, where Alfred mentions that Falcone and Mayor James are backing the project that will improve the Arkham District. An unnamed hitman (Hakeem Kae-Kazim) has been targeting the city council members involved in the Arkham Project. After an attack on Maroni's restaurant by three masked men, Cobblepot is promoted to restaurant manager by Maroni, following his action of saving a bag of money and the death of the previous manager. Mooney pits two female singers against each other for her nightclub job opening, with the winner being Liza. Mayor James holds a conference about the Arkham Plan, announcing that Falcone will handle small housing development projects and Maroni will be refurbishing the Asylum. Later, Cobblepot kills the three masked robbers who had attacked Maroni's restaurant, who it turns out had been hired for just that purpose by Cobblepot himself, by serving them poisoned cannoli.",
    "title": "Arkham",
    "date": "October 13, 2014 ",
    "directed_by": "TJ Scott",
    "views": "6.39",
    "episode": "E04",
    "season": ""
  },
  {
    "description": "Bruce plans to find a way to speak to the board members of Wayne Enterprises to learn their connections to the Arkham District Project. A new drug called \"Viper\" (which is a prototype of Venom) is hitting the street, which endows the user with super-strength, but eventually kills them. Maroni plans to rob a casino owned by Falcone, and Cobblepot reveals his past. Gordon learns that \"Viper\" is being distributed at a charity event held by WellZyn and Wayne Enterprises. Gordon shoots the canister on the roof and former WellZyn employee Stan Potolsky (Daniel London) is exposed, jumping off as he suggests they check out Warehouse 39, where Gordon and Bullock later find nothing. As Mooney makes plans to conspire against Falcone with her lover and Russian mob boss Nikolai, a disguised Liza visits him in the park where she shares her opera music with him.",
    "title": "Viper",
    "date": "October 20, 2014 ",
    "directed_by": "Tim Hunter",
    "views": "6.09",
    "episode": "E05",
    "season": ""
  },
  {
    "description": "Ten years ago, a masked killer calling himself the \"Spirit of the Goat\" targeted the first born of Gotham City's elite. The Goat targets a girl named Shelley Lawson, which leads a younger Bullock and his partner Detective Dix (Dan Hedaya) to try and rescue her. When Lawson is found dead, they find the killer, Randall Milkie, who claims that \"Randall Milkie is dead\" as he tries to attack them. Milkie is shot down by Bullock after Dix falls through a trap door and ends up badly injured. Ten years later, Bullock finds Robert Hastings' daughter, Amanda, murdered by someone with the same \"Goat\" motive. Upon surgery, Harvey sees a penny inside her neck, Milkie's trademark, which only he and Dix knew, which meant that he was not an imposter. They find out that Hastings' psychotherapist Dr. Marks (Susan Misner) hypnotized both Milkie and the new killer to become the Goat to scare Gotham City's rich and corrupt. The \"murder\" of Cobblepot is also investigated, with Gordon the prime suspect as Montoya and Allen finally find a witness near the river. When they attempt to arrest Gordon and Bullock, Cobblepot enters the police station, causing friction between Bullock and Gordon.",
    "title": "Spirit of the Goat",
    "date": "October 27, 2014 ",
    "directed_by": "TJ Scott",
    "views": "5.89",
    "episode": "E06",
    "season": ""
  },
  {
    "description": "Gordon takes Barbara to the bus station, telling her to leave Gotham. Cobblepot leads Maroni enforcer Frankie Carbone and two other henchmen to Nikolai's hideout, killing him and Carbone. The escalating mob war is put down with a land trade between the two mafia families. A drunken Bullock re-evaluates his choice for helping Gordon, and the two partners attempt to arrest the mayor and Falcone, but they give up when it is revealed that Falcone and hitman Victor Zsasz have Barbara, who had come back to try and negotiate with Falcone for Gordon. As Falcone later tends to his chickens, Cobblepot visits him, and Falcone tells him that everything is going as Cobblepot predicted. In a flashback to the night they had met Gordon, it is shown that Cobblepot and Falcone had formed a deal, in which Falcone would place Gordon in charge of killing Cobblepot, giving Cobblepot a chance at surviving, and in exchange, Cobblepot would forge an alliance with Maroni, snitching for Falcone. Cobblepot tells Falcone that Mooney and Nikolai are conspiring against him.",
    "title": "Penguin's Umbrella",
    "date": "November 3, 2014 ",
    "directed_by": "Rob Bailey",
    "views": "6.63",
    "episode": "E07",
    "season": ""
  },
  {
    "description": "Bruce returns to school, where he has some trouble with the students, including Tommy Elliot (Cole Vallis), who made fun of his parents' death and asks Alfred to teach him how to defend himself. Gordon and Bullock investigate Richard Sionis (Todd Stashwick) who is hosting an illegal and deadly fight club where the victims are those who applied for Sionis Investments. Meanwhile, Liza's loyalty to Fish Mooney begins to falter when she learns of Mooney's plan to eventually kill Don Falcone, but Mooney presses her to steal a ledger from the Falcone's office that may be used to incriminate him. When Gordon is caught at the site of the fight club, Bullock asks GCPD for help finding Gordon. After \"The Mask\" and those involved are arrested, Gordon is informed by Detective Alvarez that Selina was apprehended after robbing a dress store.",
    "title": "The Mask",
    "date": "November 10, 2014 ",
    "directed_by": "Paul Edwards",
    "views": "6.35",
    "episode": "E08",
    "season": ""
  },
  {
    "description": "Gordon has Selina placed at Wayne Manor for her safety. During a prison transport from Blackgate Penitentiary to St. Mark Psychiatric Hospital, insane bomb maker Ian Hargrove (Leslie Odom Jr.) is taken by the Russian mob, who are working against Falcone following Nikolai's death. Gordon meets with Harvey Dent, who suspects tycoon Dick Lovecraft may be behind the Wayne murders. When Gordon and Bullock find Hargrove at an abandoned metal factory, they are ambushed by Russian mob thugs who make off with Hargrove. Manipulated by Fish Mooney, the new Russian boss Gregor Kasyanov (Steve Cirbus) and his crew targets Falcone's cache of money, but when a police standoff ensues, the Russians' armored truck explodes via remote control by Butch Gilzean. Oswald visits Liza at her apartment, telling her that he knows that she is a spy for Fish and that he won't tell Falcone. At a press conference, Mayor James states that Arkham Asylum will be reopened to house the criminally insane, including Ian Hargrove. Later that night, Gordon leaves a message on Barbara's phone, unaware that she has gone back to sleeping with Renee Montoya.",
    "title": "Harvey Dent",
    "date": "November 17, 2014 ",
    "directed_by": "Karen Gaviola",
    "views": "6.49",
    "episode": "E09",
    "season": ""
  },
  {
    "description": "Assassins led by Copperhead[18][19][20] infiltrate Wayne Manor, but Bruce and Selina escape into the city. Alfred seeks Gordon and Bullock's help to find the pair. Dent suspects that Dick Lovecraft is connected to the Wayne murders and hired the assassins to cover his tracks. However, Gordon learns Lovecraft is also being targeted to hide what he knows; the assassins kill Lovecraft in a staged suicide, planting Gordon's gun at the scene. Following the armory fiasco, Cobblepot tells Falcone that Mooney has a mole in his ranks, but lies that he doesn't yet know who it is. Selina determines the assassins are after her, and she and Bruce encounter Ivy Pepper.[21] The assassins find Selina and Bruce, but Selina escapes while Bullock and Alfred arrive and rescue Bruce. Selina later kisses Bruce and returns to living on the streets. Following Lovecraft's \"suicide\", Mayor James reassigns Gordon to Arkham Asylum.",
    "title": "Lovecraft",
    "date": "November 24, 2014 ",
    "directed_by": "Guy Ferland",
    "views": "6.05",
    "episode": "E10",
    "season": ""
  },
  {
    "description": "While working guard duty at Arkham Asylum under Dr. Gerry Lang (Isiah Whitlock, Jr.), Gordon investigates a series of attacks on prisoners with the help of Dr. Leslie \"Lee\" Thompkins (Morena Baccarin). Mooney discusses her plan to overthrow Don Falcone with underboss Jimmy Saviano. Saviano wants to be the new boss, but Mooney is sure she is the best candidate. Oswald Cobblepot is arrested by the police for trying to further extort some fishermen already paying protection money to Sal Maroni. Cobblepot is bailed out by Maroni, who initiated the arrest to teach Cobblepot a lesson about hubris. Montoya breaks off her relationship with Barbara. Gordon, Bullock, and Essen discover that the person attacking prisoners was Jack Gruber[23][24] (Christopher Heyerdahl), who then escapes from Arkham with his associate Aaron Danzig (Kevin McCormick), after killing several guards and Dr. Lang. Saviano tries to get Butch Gilzean to join his crew and renounce Mooney, but Gilzean kills Saviano instead.",
    "title": "Rogues' Gallery",
    "date": "January 5, 2015 ",
    "directed_by": "Oz Scott",
    "views": "7.06",
    "episode": "E11",
    "season": ""
  },
  {
    "description": "Jack Gruber and Aaron Danzig escape from Arkham Asylum and rampage through Gotham. James Gordon promises the Commissioner he will arrest Gruber within 24 hours. Edward Nygma learns Gruber is a former Mafia bank robber who was betrayed by Salvatore Maroni. Gordon and Bullock put Maroni under protective custody to use as bait to attract Gruber to the police station. Gruber and Danzig attack the station, but Gordon thwarts them by shorting out Gruber's electrical apparatus with water. Fish Mooney makes her move against Falcone by \"abducting\" Liza and extorting him into signing his crime family over to Mooney's gang. Falcone nearly goes through with the deal, but Cobblepot informs him that Liza is Mooney's mole. Falcone confronts Mooney, has his mercenaries take both her and Butch Gilzean prisoner, and strangles Liza to death. Cobblepot inherits Mooney's nightclub and what's left of her gang. For living up to his end of the deal, Gordon is reinstated as a detective.",
    "title": "What the Little Bird Told Him",
    "date": "January 19, 2015 ",
    "directed_by": "Eagle Egilsson",
    "views": "6.50",
    "episode": "E12",
    "season": ""
  },
  {
    "description": "Fish Mooney is tortured by Falcone's servant, but Butch Gilzean frees himself and rescues her. A homicide witness is murdered while under custody at GCPD. Gordon comes to suspect Detective Arnold Flass is behind this, and asks Cobblepot for information on Flass. Bruce asks Selina about his parents' killer, but she reveals she lied about seeing the man's face to avoid being sent to juvenile hall. Nygma gives Kristen Kringle a romantic greeting card, but Flass finds it and mocks him; Kringle later apologizes to Nygma and admits she found the card thoughtful. Cobblepot sends Gordon evidence that exposes Flass' involvement in the witness' death, and Flass is arrested. Mooney and Butch confront Cobblepot at the nightclub, but Victor Zsasz arrives and recaptures Butch. Mooney escapes and lays low, but vows to take revenge against Cobblepot.",
    "title": "Welcome Back, Jim Gordon",
    "date": "January 26, 2015 ",
    "directed_by": "Wendey Stanzler",
    "views": "6.04",
    "episode": "E13",
    "season": ""
  },
  {
    "description": "Gordon and Bullock investigate a serial killer who is targeting members of a fear support group and extracting their adrenal glands. The killer turns out to be Gerald Crane (Julian Sands), the father of Jonathan Crane (Charlie Tahan); Gordon and Bullock are able to save one of his victims, but Crane evades capture. In light of Selina's recent claim of false witness towards his parents' killer's identity, Bruce absolves Gordon of his promise to find him. Mooney informs Maroni that Cobblepot has been working against him. Maroni tries to kill Cobblepot, who escapes. At the GCPD, Edward Nygma frames the medical examiner Dr. Guerra for hoarding body parts after Guerra has him suspended for his repeated corpse probing. After Guerra's suspension, Gordon informs Dr. Lee Thompkins (whom he is now dating) that a job has opened up for her as GCPD's medical examiner. Mooney tries to leave Gotham City, but is captured by mercenaries.",
    "title": "The Fearsome Dr. Crane",
    "date": "February 2, 2015 ",
    "directed_by": "John Behring",
    "views": "5.79",
    "episode": "E14",
    "season": ""
  },
  {
    "description": "Gordon and Bullock investigate Gerald Crane's background and learn his wife died in a fire that he was too scared to rescue her from; believing fear is a human flaw, he is now harvesting adrenal glands in order to create a serum that makes people confront and overcome their greatest fears. Mooney and others are imprisoned by organ harvesters; she kills the prisoners' leader and takes his place. Bruce continues a yearly family tradition by going on a hiking trip in the woods, albeit alone for the first time. He finds himself unprepared for the dangers of the forest, but Alfred eventually joins him for the campout. Maroni speaks with Falcone and agrees to let Cobblepot live, but only until Falcone's eventual death. After using the serum on himself and losing his ability to feel fear, Crane injects his son Jonathan with a much larger dose. Gordon and Bullock arrive and kill Crane in a gunfight. Jonathan is rushed to the hospital, but the serum has sent him into a state of constant terror, and he may never stop hallucinating his greatest fear: animated scarecrows.",
    "title": "The Scarecrow",
    "date": "February 9, 2015 ",
    "directed_by": "Nick Copus",
    "views": "5.63",
    "episode": "E15",
    "season": ""
  },
  {
    "description": "Barbara returns to Gotham to find Ivy and Selina squatting in her apartment. Gordon and Lee investigate the murder of Lila Valeska, a snake dancer with Haly's Circus, and the Flying Graysons and the Lloyds are suspects. Gordon determines that Lila's son Jerome (Cameron Monaghan) is the killer; when questioned, Jerome admits he killed his mother for being a \"nagging, drunken whore\" and laughs maniacally. When business begins to decrease at Oswald Cobblepot's club, Zsasz brings in Butch Gilzean, who is knowledgeable about maintaining clubs and whom Zsasz has spent days torturing and reforming into a submissive servant for Cobblepot. Taking advice from Selina and Ivy, Barbara attempts to reunite with Gordon, but changes her mind after she sees him kissing Lee. Bruce holds a board meeting at Wayne Enterprises and voices concern to the executives that the company is involved with the mob. John Grayson and Mary Lloyd get engaged after the dispute between the two families are resolved. Mooney manages to get a meeting with the organ harvesters' boss, and is led out of the prison.",
    "title": "The Blind Fortune Teller",
    "date": "February 16, 2015 ",
    "directed_by": "Jeffrey Hunt",
    "views": "6.19",
    "episode": "E16",
    "season": ""
  },
  {
    "description": "A crew of bank robbers heists a bank, they throw some of stolen money into to crowd to ensure their escape. Gordon and Bullock track down a member named Gus Floyd (Michael Goldsmith) who called himself the Red Hood, but find him dead in the hideout. After another robbery led by Carl Destro (Jonny Coyne), who took the position of the Red Hood's trademark mask, Gordon and Bullock track him to his house where they find him wounded. With information given by Destro, the police find and gun down the remainder of the gang (Peter Brensinger, Peter Albrink & Kevin T. Collins) in a shootout. Meanwhile, Oswald Cobblepot struggles from Maroni's actions against the restaurant, but Butch uses some cops on his payroll to seize Maroni's supplies. Fish Mooney discovers that the facility she is kept in is run by the Dollmaker. When his manager (Jeffrey Combs) tries to take her eye for organ trade purposes, she removes it herself and destroys it before passing out. An old comrade of Alfred, Reginald Payne (David O'Hara), visits him in Wayne Manor and stays over night. On the next day, however, he steals some of Bruce Wayne's files, stabs Alfred to evade capture and reports to Wayne Enterprises Board of Directors.",
    "title": "Red Hood",
    "date": "February 23, 2015 ",
    "directed_by": "Nathan Hope",
    "views": "6.53",
    "episode": "E17",
    "season": ""
  },
  {
    "description": "At the hospital, Alfred struggles from his wounds but refuses to implicate Payne. Gordon and Harvey Dent investigate the sudden release and reinstatement of Arnold Flass by Commissioner Loeb. Bullock reveals that Loeb has been collecting information on police officers who have committed mob murders, which Loeb uses to control and blackmail them; in Bullock's case, Loeb forced him to falsely confess to providing illegitimate evidence against Flass. Investigating a triad bookmaking office and interrogating Loeb's former partner, Gordon learns that Loeb has ties with Falcone, being in his pocket. With the help of Oswald Cobblepot, Gordon and Bullock investigate Loeb's uptown farm, where they find Loeb's psychotic daughter Miriam (Nicholle Tom) being kept in the attic. After Miriam confesses to the murder of her mother, Gordon uses that information to terminate Bullock's case by blackmailing Loeb. Meanwhile, Fish Mooney finally meets the Dollmaker (Colm Feore), who provides her with a new sky-blue irised eye and allows her to prove herself in order to become his right hand woman. Later, Fish discovers much to her dismay that the prison facility is situated on an isolated island.",
    "title": "Everyone Has a Cobblepot",
    "date": "March 2, 2015 ",
    "directed_by": "Bill Eagles",
    "views": "6.10",
    "episode": "E18",
    "season": ""
  },
  {
    "description": "Despite Gordon's warning, Bruce still goes after Reginald Payne with Selina's help. Payne confesses that he was hired by Wayne Enterprises' Board of Directors. When Payne threatens to tell the Board that Bruce is coming after them, Selina pushes Payne out a window after Bruce initially moves to but hesitates, presumably killing him. Gordon and Bullock investigate a cold case murder. Upon Nygma discovering a painting of a broken heart as the key evidence, Bullock realizes that the serial killer called \"the Ogre\" (Milo Ventimiglia) is behind the murder. Harvey then states that everyone who tried to investigate Ogre lost their loved ones. A flashback of a victimized girl reveals the killer's motives and him keeping her prisoner for some time, until he realizes she isn't a fit for his desire, so he kills her. Meanwhile, Oswald negotiates with a bar's owner (Barbara Rosenblat) to do business, but his real intention is to kill Maroni in this bar. Mooney succeeds in escaping with the rest of the crew from Dollmaker's island, but is shot during the takeoff by the Catcher. It is revealed that Gordon was set up by Commissioner Loeb, but Gordon still goes after the killer and threatens Loeb that he will be next.",
    "title": "Beasts of Prey",
    "date": "April 13, 2015 ",
    "directed_by": "Eagle Egilsson",
    "views": "4.50",
    "episode": "E19",
    "season": ""
  },
  {
    "description": "The \"Ogre\" calls Gordon and threatens to kill someone he loves if Gordon does not stop the investigation. Following the incident with Reggie, Bruce and Selina attend Wayne Enterprises' Charity Ball with Barbara Kean, where Selina steals keys from Sid Banderslaw (Michael Potts), one of the Wayne Enterprises executives who sent Reggie to Wayne Manor. Cobblepot allies himself with Irish hitmen in hopes of killing Maroni, but Maroni visits the club and reveals to Oswald's mother that her son is a killer. Nygma tries to protect Kristin Kringle from her abusive boyfriend Tom Dougherty, but goes too far when he stabs him to death and has a psychotic breakdown. Investigating the Ogre's first victim, Gordon, Bullock, and Essen identify the killer as Jason Lennon, who saw Gordon with Barbara at the Charity Gallery some time ago, meaning she is the target. The Ogre approaches Barbara at the Ball and brings her to his home.",
    "title": "Under the Knife",
    "date": "April 20, 2015 ",
    "directed_by": "TJ Scott",
    "views": "4.44",
    "episode": "E20",
    "season": ""
  },
  {
    "description": "Jason \"The Ogre\" Lennon holds Barbara captive and forces her at knifepoint to choose his next victim. Nygma disposes of Dougherty's body and forges a letter from him breaking up with Kringle. Bruce sneaks into Bunderslaw's office to open his safe, but Bunderslaw was expecting Bruce and has removed the incriminating documents. He reveals that Bruce's father knew of Wayne Enterprises' illegal activities but kept quiet. Afterwards, junior executive Lucius Fox (Chris Chalk) gives Bruce some cryptic words about his father, explaining that he did not approve of the company's crimes. Bruce confesses his and Selina's murder of Reggie to Alfred. Cobblepot sends the Irish hitmen to kill Maroni, but it is a setup designed by Cobblepot to frame Falcone and start a war between the two mob bosses. Gordon and Bullock locate Lennon's apartment, but he and Barbara have already left for her parents' mansion. There, they find Barbara's parents dead, and Gordon kills Lennon after a standoff. Later, Gordon reassures Lee that he no longer loves Barbara. Maroni begins attacking Falcone's men, and Captain Essen calls all GCPD officers to remain on duty during the upcoming gang war.",
    "title": "The Anvil or the Hammer",
    "date": "April 27, 2015 ",
    "directed_by": "Paul Edwards",
    "views": "4.58",
    "episode": "E21",
    "season": ""
  },
  {
    "description": "The mob war between Falcone and Maroni escalates. Cobblepot attempts to kill Falcone himself and take his place, but Gordon intervenes. As Maroni's men approach, Gordon and Bullock bring Falcone, Cobblepot, and Butch to a safe house, but Fish Mooney's new gang (with Selina Kyle amongst its recruits) take them captive. Maroni arrives, but Cobblepot manipulates him and Mooney into a dispute over mob leadership. Mooney eventually shoots Maroni dead. Gordon, Bullock, and Falcone escape in the ensuing chaos. Cobblepot fights and throws Mooney off the roof into the water, becoming Gotham's new crime lord. Barbara undergoes trauma counseling with Lee, but turns out to have been driven insane by her ordeal with the Ogre; she reveals she killed her parents and attacks Lee, who neutralizes her in self-defense. When Kristen Kringle suspects him of involvement in Dougherty's disappearance, Nygma has a paranoid outburst and speaks to a second personality. Falcone retires from the mob. Believing his father led a secret life and remembering a subtle clue from Lucius Fox, Bruce discovers a hidden stairwell behind the fireplace.",
    "title": "All Happy Families Are Alike",
    "date": "May 4, 2015 ",
    "directed_by": "Danny Cannon",
    "views": "4.93",
    "episode": "E22",
    "season": ""
  },
  {
    "description": "Gordon is fired and Bullock resigns from the police. Gordon works with Cobblepot, now a crime boss, to force Commissioner Loeb to reinstate Gordon as a detective and resign as police commissioner in exchange for Gordon collecting a debt from someone and regretfully killing them to protect himself. Meanwhile, several inmates of Arkham Asylum including Barbara Kean, Aaron Helzinger, Jerome Valeska, Arnold Dobkins, Richard Sionis and Robert Greenwood are broken out of the asylum by Theo Galavan (James Frain) and his sister/enforcer, Tabitha Galavan[39][40] (Jessica Lucas). All but Sionis agree to join forces with Galavan; Sionis is strangled to death for his refusal. Bruce and Alfred discover a secret room at the end of the staircase.",
    "title": "Damned If You Do...",
    "date": "September 21, 2015 ",
    "directed_by": "Danny Cannon",
    "views": "4.57",
    "season": "S02",
    "episode": "E01"
  },
  {
    "description": "Bruce fires Alfred when the latter interferes with his exploring his father's computer, but changes his mind when Alfred agrees to physically train him so he can confront his parents' killer. Galavan kidnaps the mayor and his group of \"Maniax\" begin a public murder spree for the sake of publicity. The Maniax attack GCPD and kill several police officers, including Essen; Nygma is wounded saving Miss Kringle during the massacre. Following this, Bullock rejoins the force to stop the Maniax.",
    "title": "Knock, Knock",
    "date": "September 28, 2015 ",
    "directed_by": "Rob Bailey",
    "views": "4.65",
    "episode": "E02",
    "season": ""
  },
  {
    "description": "Gordon and Bullock search for Jerome, but discover Paul Cicero (Jerome's father) already murdered, Galavan reveals that his family built Gotham and he is seeking revenge on those who tarnished his family name. Galavan attends a charity event that Alfred, Bruce and Leslie Thompkins also attend, which turns out to be an elaborate ruse wherein Galavan kills Jerome and is perceived to be a hero; he announces his candidacy for mayor. Several Gotham citizens see Jerome's actions on television and begin having mental breakdowns.",
    "title": "The Last Laugh",
    "date": "October 5, 2015 ",
    "directed_by": "Eagle Egilsson",
    "views": "4.33",
    "episode": "E03",
    "season": ""
  },
  {
    "description": "Nathaniel Barnes (Michael Chiklis), a new captain of the GCPD, arrives to clean up department and end corruption. With Gordon's assistance, they recruit several aspiring police trainees from the Police Academy in order to form an elite team to accomplish that goal. Galavan kidnaps Cobblepot's mother and blackmails Cobblepot into murdering all of the other candidates so that Galavan can run for mayor unopposed. When Selina begins looking for Bruce at his prep school, she is ordered off by Alfred because of her killing of Reggie. Shortly afterwards, Bruce meets with Galavan to thank him for saving his life during the charity event and meets Galavan's niece, Silver St. Cloud (Natalie Alyn Lind). Nygma and Miss Kringle have a romantic evening together. As Cobblepot begins to have Butch quietly search for his mother, Captain Barnes directs the strike force to target Cobblepot.",
    "title": "Strike Force",
    "date": "October 12, 2015 ",
    "directed_by": "TJ Scott",
    "views": "4.17",
    "episode": "E04",
    "season": ""
  },
  {
    "description": "Cobblepot (Robin Lord Taylor) and Butch (Drew Powell) bring a chest to Galavan (James Frain) in his penthouse, revealing a kidnapped Sid Bunderslaw (Michael Potts), where Tabitha (Jessica Lucas) removes one of his eyes. Meanwhile, the GCPD Strike Force, led by Captain Barnes (Michael Chiklis) and Gordon (Ben McKenzie) busts one of Cobblepot's money laundering house, where they're nearly killed by a man with a rocket-propelled grenade. Galavan arrives at the GCPD, where he offers help in cleaning the GCPD's corruption in exchange for support in his candidacy. Gordon gently refuses, claiming the police and politics don't match. Tabitha visits Cobblepot to discuss their next move, which requires hiring arsonists. Gordon and Bullock (Donal Logue) ambush Bridgit on a would-be robbery, where their brothers abandon her. While she tries to back off, officer Luke Garrett (Lenny Platt) tries to restrain her, but she accidentally burns him down. She escapes with Selina but Officer Garrett later dies from the fire. Galavan again visits the GCPD, where Gordon decides to support on his candidacy. In his penthouse, Galavan is visited by Father Creel (Ron Rifkin), who hands him the knife, claiming his warriors are on the way, and Bruce Wayne will die.",
    "title": "Scarification",
    "date": "October 19, 2015 ",
    "directed_by": "Bill Eagles",
    "views": "4.19",
    "episode": "E05",
    "season": ""
  },
  {
    "description": "After moving away from the Pike brothers and in with Selina, Bridgit Pike is abducted and further abused by the Pike Brothers after attempting to leave Gotham City. Bridgit snaps and murders the other Pike Brothers, beginning a crime spree. After a visit to Selina's hideout, Gordon and Bullock arrive at the Pike Brothers apartment where they find them dead. Theo Galavan continues to lure Bruce Wayne, this time offering to help clean up the corruption at Wayne Enterprises. Butch discovers the location of Cobblepot's mother and Cobblepot begins to rally a rescue party. Bridgit Pike is incapacitated in a struggle with the GCPD strike force, publicly announced to be dead much to the dismay of Selina. Kristen Kringle learns that Nygma murdered Officer Dougherty. In an attempt to keep Kringle from telling anyone, Nygma accidentally strangles her, killing her. Meanwhile Pike is alive but her entire body is burned. She is taken to Indian Hill, an underground division of Wayne Enterprises where inhumane experiments are secretly performed. It is stated that her suit had melted onto her, rendering her fireproof.",
    "title": "By Fire",
    "date": "October 26, 2015 ",
    "directed_by": "TJ Scott",
    "views": "4.32",
    "episode": "E06",
    "season": ""
  },
  {
    "description": "Butch leads Cobblepot to the location of his mother, where Theo Galavan and Tabitha Galavan are waiting. Now cured of his programming, Butch betrays Cobblepot and Tabitha Galavan murders his mother (who though aware of her son's activities still claims him to be a good boy), though Cobblepot manages to escape, vowing to kill Theo in revenge. Galavan, now elected mayor, convinces the GCPD and the public that Cobblepot assaulted him and Galavan has Harvey Dent obtain a warrant for Cobblepot's arrest. Gordon begins to suspect that Galavan is framing Cobblepot and tracks down Butch. In an interrogation, Butch reveals that Theo has been blackmailing Cobblepot and that he murdered Cobblepot's mother. Later that night, Theo attends his victory celebration at which the GCPD are secretly stationed, ready to capture Cobblepot if he arrives. Cobblepot and his henchmen show up, but Cobblepot is quickly ambushed by Gordon. Theo attempts to convince Gordon to shoot Cobblepot, but Cobblepot narrowly escapes. Gordon informs Theo that he is determined to expose his corruption. Elsewhere, Tabitha murders a member of the GCPD strike force. Following the death of Kristen Kringle, Nygma's mental state worsens as his split personality attempts to convince him that he enjoys getting away with murder. Both of Nygma's personalities then merge.",
    "title": "Mommy's Little Monster",
    "date": "November 2, 2015 ",
    "directed_by": "Kenneth Fink",
    "views": "4.27",
    "episode": "E07",
    "season": ""
  },
  {
    "description": "Theo Galavan gives Barbara permission to kill Gordon and also offers Bruce a proposition: Bruce sells his controlling position in Wayne Enterprises to Theo and, in return, Theo gives Bruce the information about his parents' killer and the culprits responsible. Barbara walks inside the GCPD and Gordon suggests he risk himself to find more information about Galavan. While en route to an unknown location on Barbara's instructions, the squad car is assaulted by Tabitha and her crew. Gordon wakes up in Gotham Cathedral, where he and Barbara were going to have their wedding before their break-up. The Strike Force discovers Gordon's location, thanks to the help of Bullock. While the Strike Force engages Tabitha's crew and rescues Leslie (who was somehow kidnapped by Tabitha), Gordon briefly fights Barbara, leading to Barbara hanging outside the church and falling, resulting in severe injuries. Following information obtained by Barbara, GCPD rescue Aubrey James from his abduction. Bruce declines Theo's proposition just as Gordon arrives and arrests Theo, who destroys the evidence on the Waynes' killer. Meanwhile, while trying to bury Kristen Kringle, Nygma discovers an injured and exhausted Penguin, who asks Nygma for help.",
    "title": "Tonight's the Night",
    "date": "November 9, 2015 ",
    "directed_by": "Jeffrey Hunt",
    "views": "4.11",
    "episode": "E08",
    "season": ""
  },
  {
    "description": "Tabitha goes to an underground killer agency and pays to have James Gordon assassinated. Bruce tries to get information about his parents' killer from Silver, but is stopped by Alfred, who orders Silver to stay away from Bruce. When Bruce tries to sneak out, he is stopped by Selina, who claims she has evidence that Silver is not who she claims to be. Gordon and Barnes investigate Theo's condo for evidence. The killers arrive; Gordon and Barnes manage to fend them off, but Barnes is severely injured. Police reinforcements arrive, but are eliminated by another hired killer named Eduardo Flamingo (Raúl Castillo). After coming close to killing him, Gordon arrests Flamingo, but, before being placed in his cell, Flamingo kills another officer. Meanwhile, Nygma persuades Cobblepot to move on from the death of his mother and the both of them kill one of Theo's kidnapped henchmen in celebration. The Order of Saint Dumas arrives in Gotham City.",
    "title": "A Bitter Pill to Swallow",
    "date": "November 16, 2015 ",
    "directed_by": "Louis Shaw Milito",
    "views": "4.35",
    "episode": "E09",
    "season": ""
  },
  {
    "description": "Bruce and Silver are kidnapped by Tom \"The Knife\" (Tommy Flanagan). He manipulates Silver into seemingly revealing the name of Bruce's parents' killer after being paid by Bruce and Selina. She says that the killer's name is \"M. Malone\" but later claims that she lied. Galavan is released after Mayor James lies, stating that Galavan did not kidnap him, framing Penguin instead. Gordon is captured by Theo, who reveals the history of his family to Gordon, but Gordon is rescued by Cobblepot and Gabe. Alfred grows suspicious of Bruce's whereabouts and searches Theo's residence, where he is wounded in a fight with Tabitha, which he narrowly escapes. When Leslie notices Kristen Kringle's absence, Nygma is forced to lie to her, claiming that Kringle left town with Officer Dougherty. Theo breaks into Wayne Manor and kidnaps Bruce, as part of the Order of St. Dumas' plan to \"cleanse\" Gotham.",
    "title": "The Son of Gotham",
    "date": "November 23, 2015 ",
    "directed_by": "Rob Bailey",
    "views": "4.00",
    "episode": "E10",
    "season": ""
  },
  {
    "description": "Gordon wakes up in Nygma's house only to learn from Cobblepot that he is now a fugitive from the law for assaulting Theo Galavan. Gordon and Cobblepot begin making plans to break into Theo's residence and save Bruce. After finding Gordon, Leslie attempts to persuade him to turn himself to the GCPD by informing him that she is pregnant. Gordon, Bullock, Alfred, Selina, Cobblepot and his gang all arrive at Galavan's residence just as the Order of Saint Dumas is about to kill Bruce. During a clash between the Order and Cobblepot's gang in which the Order is defeated, Theo, Tabitha, and Silver St. Cloud begin to make their escape. Tabitha and Silver escape but leave Theo behind. Cobblepot convinces Gordon that Theo might never be convicted and the two take Theo to the docks and murder him. Later, Gordon finds Leslie and proposes to her. Theo's body is discovered by Wayne Enterprises, who take the corpse to Indian Hill where Fish Mooney's body also is being kept. The scientists state that Theo's body is to be experimented on by Professor Hugo Strange.",
    "title": "Worse Than a Crime",
    "date": "November 30, 2015 ",
    "directed_by": "Jeffrey Hunt",
    "views": "4.51",
    "episode": "E11",
    "season": ""
  },
  {
    "description": "Several weeks following the death of Theo Galavan, Gordon is called in for questioning and Cobblepot is arrested. Gordon and Cobblepot lie to the police, stating that Cobblepot murdered Galavan and Gordon was not involved. Gordon is reinstated into the GCPD, while Cobblepot falsely justifies his actions as the result of mental illness. Cobblepot is sent to Arkham Asylum, where he becomes a patient of Hugo Strange (B. D. Wong), the Chief of Psychiatry. Butch takes over Cobblepot's criminal empire. Gordon and Bullock begin investigating a kidnapping and murder spree, unaware that a scientist named Victor Fries (Nathan Darrow) is the culprit. Fries has been experimenting on freezing and re-animating humans so that he can freeze his terminally ill wife Nora (Kristen Hager) until he can find a cure for her disease. When the police target Fries as a suspect, they discover his laboratory while he's away and arrest his wife. After learning of the arrest, Victor Fries attempts to turn himself in before finally discovering which of his serums can successfully reanimate a human being. Professor Strange learns of the experiments and begins making plans to recruit Fries for Indian Hill.",
    "title": "Mr. Freeze",
    "date": "February 29, 2016 ",
    "directed_by": "Nick Copus",
    "views": "4.12",
    "episode": "E12",
    "season": ""
  },
  {
    "description": "At Arkham Asylum, Professor Strange begins overseeing intensive treatments meant to reduce Oswald Cobblepot's aggressive tendencies. Upon learning that Nora is being sent to the medical wing at Arkham Asylum, Victor Fries builds an armoured suit. Fries arrives at the asylum and, after fighting through security and the police, manages to escape with Nora. Elsewhere, Bruce researches a lead, believing he has discovered that the man who killed his parents is Patrick \"Matches\" Malone. James Gordon deduces that Victor Fries will return to his home laboratory in order to freeze Nora and the police surround Fries' home to find that Gordon is correct. In the laboratory, Nora blames herself for the deaths that Fries has caused. Fries attempts to cryogenically freeze her, only to learn that Nora switched the formulas when he wasn't looking. Nora dies as a result. Distraught by Nora's death, Fries attempts to commit suicide by freezing himself. Fries is publicly pronounced dead, despite having survived the process. Fries wakes up in Indian Hill to discover that he can no longer survive outside of subzero temperatures. Fries meets Professor Strange, who offers him an alliance as a fellow scientist.",
    "title": "A Dead Man Feels No Cold",
    "date": "March 7, 2016 ",
    "directed_by": "Eagle Egilsson",
    "views": "4.54",
    "episode": "E13",
    "season": ""
  },
  {
    "description": "Bruce receives a gun from Selina and goes on the hunt for Patrick Malone with Alfred. To get the information, Alfred is forced to fight in an underground fight club, landing Alfred in the hospital. After Bruce goes on the hunt himself, Alfred contacts Gordon and Bullock so that they can save Bruce from potentially being killed. Bruce locates Malone, who later seemingly confirms he is responsible for the murder of Bruce's parents. He asks Bruce to kill him, but Bruce holds back at the last moment and leaves the gun behind, leading to Malone committing suicide. Later, in the cave, Alfred reads Bruce's letter about him moving to the streets with Selina to learn how to fight crime. Meanwhile, Leslie asks Gordon to investigate Kristen Kringle's sudden disappearance. When Nygma is informed, he swears under his breath that he will outsmart Gordon. After running a few more tests on Cobblepot, Hugo Strange declares him sane and releases him from Arkham, all the while stating that he still has plans for him.",
    "title": "This Ball of Mud and Meanness",
    "date": "March 14, 2016 ",
    "directed_by": "John Behring",
    "views": "4.01",
    "episode": "E14",
    "season": ""
  },
  {
    "description": "Upon being released from Arkham Asylum when his violent nature is cured, Cobblepot visits the grave of his deceased mother. There, he crosses paths with Elijah Van Dahl (Paul Reubens). After informing Dahl that he is the son of Gertrude Kapelput, Dahl reveals that he is Cobblepot's father. Dahl had an affair with Gertrude decades in the past, but the two were separated by Dahl's disapproving family. Dahl welcomes Cobblepot into his family. Paranoid that Gordon suspects him of killing Kristen Kringle, Nygma disguises himself and begins a series of crimes that involve brain teasers. As Gordon begins solving these crimes, Nygma kills a member of the GCPD strike force, informs the GCPD that Gordon killed Galavan while pretending to be said officer, and frames Gordon for the murder. Believing Gordon murdered the officer to keep him from testifying, the GCPD arrests Gordon. After a trial, Gordon is found guilty and sentenced to Blackgate Penitentiary. Selina teaches Bruce how to survive on the streets as they steal money from Butch's nephew, with Bruce taking a massive beating from the nephew in the process. Barbara wakes from her catatonic state in Arkham Asylum.",
    "title": "Mad Grey Dawn",
    "date": "March 21, 2016 ",
    "directed_by": "Nick Copus",
    "views": "3.89",
    "episode": "E15",
    "season": ""
  },
  {
    "description": "Gordon is adjusting to life in Blackgate Penitentiary. Warden Carlson Grey (Ned Bellamy) announces to Gordon that he will be transferred to the gen-pop quarter dubbed \"the World's End,\" part of Grey's plan to kill Gordon. He's constantly aided by guard Wilson Bishop (Marc Damon Johnson). Gordon is told by Bullock that Lee has lost their baby and left town. Later, he is defended from attackers by convict Peter \"Puck\" Davies (Peter Mark Kendall), who is beaten and sent to the infirmary. In an attempt to save Gordon, Bullock meets with Falcone. Gordon's death is successfully staged and he and Puck escape. Puck dies from his injuries, while Gordon is given a safe house so he can clear his name and find Lee. Meanwhile, Cobblepot reveals his criminal past to Dahl, for which Dahl forgives him. Dahl is told by the doctor that his heart defect is infected and he has little time to live. Upset that Cobblepot may receive what they perceive to be \"their\" inheritance, Dahl's wife Grace and her children Sasha and Charles poison a drink for Cobblepot to ingest. However, Dahl drinks from the bottle and dies, after stating to Cobblepot his intentions of changing his will in favor of him.",
    "title": "Prisoners",
    "date": "March 28, 2016 ",
    "directed_by": "Scott White",
    "views": "3.82",
    "episode": "E16",
    "season": ""
  },
  {
    "description": "James Gordon continues to flee the law as he tries to clear his name. When Gordon secretly approaches Nygma for help, he deduces that Nygma framed him. Nygma electrocutes Gordon into unconsciousness, but Gordon awakes just as Nygma is preparing to stuff him in a car trunk. Gordon asks Selina to report to the GCPD. Gordon follows Nygma into the woods, from where he intends to relocate Kristen Kringle's body. Nygma admits that he framed Gordon as the GCPD eavesdrops on the conversation. They arrest Nygma before he can kill Gordon. Nygma is placed in Arkham Asylum. Nathaniel Barnes offers Gordon his job back, but Gordon declines as he has other matters with which to deal. Barbara is released from Arkham Asylum after she stops showing any signs of mental illness. Following the death of his father, Cobblepot is bullied by his step-family. However, when he discovers evidence that they killed his father, his former self returns and he murders his step-family.",
    "title": "Into the Woods",
    "date": "April 11, 2016 ",
    "directed_by": "Oz Scott",
    "views": "3.71",
    "episode": "E17",
    "season": ""
  },
  {
    "description": "Bruce, Lucius, and Alfred search through the secret files on Thomas Wayne's newly fixed computer with the goal of finding a clue as to who killed him and Martha and why. Barbara tracks down Gordon. Claiming to be cured of her insanity, she tries to reconcile with Gordon, but to no avail. With Barbara's unorthodox assistance, Gordon discovers that the person who contracted Patrick Malone to kill Thomas and Martha Wayne is known as \"the Philosopher.\" Bruce and Alfred track a lead from Thomas Wayne's computer and find Karen Jennings, a former Blackgate inmate on whom experiments were performed at Pinewood Farms, a Wayne Enterprises facility, by the Philosopher. She offers to identify the Philosopher, but Victor Fries is sent to kill her. Following Jennings' death, Lucius does further research and discovers that Hugo Strange is the Philosopher. After many failed attempts, Strange finally succeeds in resurrecting someone from the dead: Theo Galavan.",
    "title": "Pinewood",
    "date": "April 18, 2016 ",
    "directed_by": "John Stephens",
    "views": "3.72",
    "episode": "E18",
    "season": ""
  },
  {
    "description": "Gordon questions Professor Strange about Project Chimera, which later makes Strange send Theo Galavan, now under the name Azrael, to take out Gordon. While at Arkham Asylum, Gordon bumps into Nygma in the playroom. Nygma later overhears Strange and Peabody complaining about Gordon's interference. Nygma suggests that he can help them take out Gordon, but Strange refuses his help. Bruce is told by Bullock and Gordon that there isn't enough evidence to imprison Strange. Azrael gets some memories back after looking at posters from Galavan's election. After, Gordon is in holding when the lights flicker and Azrael shows up, killing a few officers and making an unsuccessful attempt on Gordon's life. Barnes and Gordon flee to the roof, where Barnes fights Azrael with a pipe, breaks his sword, and rips off his mask, revealing Azrael's identity. In the end, Barnes is sent to the hospital and Gordon heads home, watched by Azrael from a distance.",
    "title": "Azrael",
    "date": "May 2, 2016 ",
    "directed_by": "Larysa Kondracki",
    "views": "3.59",
    "episode": "E19",
    "season": ""
  },
  {
    "description": "Together with Bullock and a crew of police officers, Gordon arrives at Arkham Asylum with a warrant to inspect Professor Strange's office. Strange is unfortunately one step in front of them, having shredded all of his documents. Nygma, in the meantime, is disturbed by what he saw at Indian Hill and realizes he needs to escape. As Captain Barnes is still in the hospital, Harvey Bullock becomes de facto captain. Bruce decides to go off with Selina to find a way into Arkham. Selina accepts because she wants to rescue Bridgit from Arkham, but insists she go in on her own. Gordon and Bullock arrive at Butch's mansion to talk with Tabitha, who states the sword Azrael used was fake and that the real one is located in her grandfather's tomb. They later arrive at Gotham cemetery, where they steal the sword. Azrael arrives, injuring Tabitha and escaping with the real sword. Gordon warns Alfred about Galavan just as Bruce returns to Wayne Manor. Gordon arrives and shoots Azrael multiple times, but he remains undefeated until Cobblepot and Butch arrive. Butch fires an RPG, killing Azrael.",
    "title": "Unleashed",
    "date": "May 9, 2016 ",
    "directed_by": "Paul Edwards",
    "views": "3.67",
    "episode": "E20",
    "season": ""
  },
  {
    "description": "Selina begs to be Bridgit's servant, making use of Bridgit's alter-ego. Bruce is troubled after Selina fails to meet with him and learns of her capture. Meanwhile, Strange's project continues and he successfully resurrects Fish Mooney – the first subject to retain full memory. Bruce believes that there is a secret room in Arkham where Strange is experimenting on the dead and that the only way to be certain is if they head in themselves. Bruce, Gordon, and Fox visit Arkham to execute their plan, but their motives are revealed and all three are captured. Bruce and Fox are put in a chamber and interrogated by Nygma on Strange's behalf. Meanwhile, Gordon is brought into another room with Strange and introduced to Basil, a patient whose skin stretches more than humanly possible. Strange places him in a machine and replicates Gordon's visage onto Basil's face.",
    "title": "A Legion of Horribles",
    "date": "May 16, 2016 ",
    "directed_by": "Rob Bailey",
    "views": "3.84",
    "episode": "E21",
    "season": ""
  },
  {
    "description": "Disguised as Gordon, Basil pulls the GCPD off of Arkham; however, Barbara later exposes Basil as an impostor. Strange prepares to detonate a bomb beneath Arkham and tells Ms. Peabody to transfer the patients to another facility. Mooney gains control of Peabody, but Strange starts the bomb's countdown under the White-Haired Lady's orders. With Nygma's help, Gordon and Lucius stop the bomb. Mooney escapes in a bus with Strange's other monsters, and encounters a shocked Penguin on the street; she knocks him out, prompting Butch and his gang to flee. Strange is arrested, Gordon leaves to find Lee, Bruce tells Alfred of his plans to find the secret council that wants him dead, and Bullock is trusted to protect Gotham. A homeless woman opens the abandoned bus, unwittingly releasing the monsters upon Gotham; among them is a boy identical to Bruce.",
    "title": "Transference",
    "date": "May 23, 2016 ",
    "directed_by": "Eagle Egilsson",
    "views": "3.62",
    "episode": "E22",
    "season": ""
  },
  {
    "description": "Six months after the last sighting of Fish Mooney, Lee has moved on with a new man in her life and Gordon has become a bounty hunter tracking down the Indian Hill escapees. Cobblepot puts a bounty on Fish and visits Nygma at Arkham Asylum, surmising that Fish has an ulterior motive. Bruce's mysterious doppelgänger lurks around Gotham City and learns of Bruce's identity from Ivy, who mistakes him for Bruce. Gordon, with the help of reporter Valerie Vale (Jamie Chung), tracks down Strange's assistant Ethel Peabody, but she is captured and killed by Fish. Fish's gang catches Ivy spying on them, but she runs and falls down a sewage pipe after being touched by a gang member who can accelerate a person's aging process. Bruce and Alfred call a meeting with the Wayne Enterprises Board of Directors, where Bruce threatens to disseminate his evidence pertaining to the cabal in charge behind the scenes, unless they contact him. The Court of Owls sends Talon to kidnap Bruce.",
    "title": "Better to Reign in Hell...",
    "date": "September 19, 2016 ",
    "directed_by": "Danny Cannon",
    "views": "3.90",
    "season": "S03",
    "episode": "E01"
  },
  {
    "description": "Bruce is brought before Kathryn, a high-ranking member of the Court, whom he recognizes from various Wayne functions. She orders him to cease his investigations into them, Wayne Enterprises, Indian Hill, and the deaths of his parents, to which he obliges in exchange for the lives of those closest to him. Ivy washes ashore as a grown woman. Fish captures Bullock and uses her powers to make him lead her to the secret facility holding Strange. Gordon makes a deal with Fish to help her escape with Strange if she hands over Bullock, and informs Cobblepot of her escape route. Cobblepot prepares to kill her but, when she reveals that she let him live because he was her greatest creation, he lets her go. The mob breaks into the facility and kills some of Fish's minions. Valerie visits Gordon about his deal with Fish, and they share a kiss. Bruce's doppelgänger breaks into Wayne Manor. Lee returns to Gotham.",
    "title": "Burn the Witch",
    "date": "September 26, 2016 ",
    "directed_by": "Danny Cannon",
    "views": "3.54",
    "episode": "E02",
    "season": ""
  },
  {
    "description": "Hypnotist Jervis Tetch (Benedict Samuel) hires Gordon to find his sister Alice (Naian Gonzalez Norvind), an Indian Hill escapee whose blood contains a virus. Barnes offers Lee her old job back at GCPD. Cobblepot runs for mayor to clean up Gotham's corrupt system; to aid with his campaign, he has Edward Nygma declared legally sane and released from Arkham. Gordon gets into a brawl and is stitched up by Lee's new fiancé, Mario Calvi (James Carpinello), at the ER. After Alice tells Gordon she wants nothing to do with her brother, Gordon questions Tetch, who hypnotizes him into nearly committing suicide. Alice saves Gordon, who brings her into GCPD. Lee and Mario have dinner with Mario's father, the ex-Don Carmine Falcone. Bruce takes in his doppelgänger—subject 514A, a.k.a. \"Five\"—who demonstrates impressive fighting skills and an imperviousness to pain. Five later impersonates Bruce and takes an oblivious Selina out on the town.",
    "title": "Look Into My Eyes",
    "date": "October 3, 2016 ",
    "directed_by": "Rob Bailey",
    "views": "3.19",
    "episode": "E03",
    "season": ""
  },
  {
    "description": "Five assists Selina in robbing a bar and rescues her when she is captured, but she sees the scars on his body and identifies him as an imposter. Five admits he wanted to experience a normal life by socializing with someone, but Selina reassures him that he is more normal than he thinks, and they kiss. Tetch hypnotizes the wrestling Tweedle Brothers to help him break into GCPD and kidnap Alice, but Gordon and Bullock track them down. Gordon finds himself still under the suicidal influence of Tetch's hypnosis; realizing his suicidal urges are connected to his issues with Lee, Gordon overcomes them and breaks the spell. Alice falls and is impaled on a pipe, leaving a grief-stricken Tetch to escape. While investigating the crime scene, Barnes becomes infected by Alice's dripping blood. Cobblepot bribes campaign officials to buy the election, but Nygma takes the money back; to Cobblepot's shock, he wins the election anyway, and realizes Nygma wanted to show him that the people genuinely want him as Mayor. Five bids farewell to Bruce and tries to leave Gotham, but is kidnapped by the Court.",
    "title": "New Day Rising",
    "date": "October 10, 2016 ",
    "directed_by": "Eagle Egilsson",
    "views": "3.42",
    "episode": "E04",
    "season": ""
  },
  {
    "description": "Cobblepot's term as mayor starts off well, but a new Red Hood Gang appears and openly challenges his authority. Nygma discovers that Butch is behind the new gang as part of a scheme to make himself Cobblepot's right-hand man again. At a celebratory party in the mayor's honor, Nygma manipulates Butch into exposing himself as the mastermind behind the Red Hoods, thus reinforcing his own position as Cobblepot's most trusted friend and ally. Barnes asks Lee about the tests on Alice Tetch's blood without revealing that he was exposed to it. At Gordon's suggestion, Bruce tells Selina how he feels about her, but she dismissively tells him that he only feels that way because he's never dated anyone. Bruce reasserts his feelings and Selina kisses him. Elsewhere, Jervis Tetch mourns his sister's death and plots revenge against Gordon.",
    "title": "Anything for You",
    "date": "October 17, 2016 ",
    "directed_by": "TJ Scott",
    "views": "3.32",
    "episode": "E05",
    "season": ""
  },
  {
    "description": "Tetch hypnotizes several civilians into life-threatening situations, and forces Gordon to choose whom to save. Tetch later kidnaps Valerie and Lee, and again forces Gordon to make a choice; Gordon says Lee, resulting in Tetch shooting Valerie instead. Valerie is rushed to the hospital. Meanwhile, Cobblepot realizes he's in love with Nygma and plans to confess his feelings for him, but Nygma meets a woman named Isabella who reminds him of Kristen Kringle.",
    "title": "Follow the White Rabbit",
    "date": "October 24, 2016 ",
    "directed_by": "Nathan Hope",
    "views": "3.48",
    "episode": "E06",
    "season": ""
  },
  {
    "description": "Valerie recovers, but ends her relationship with Gordon, knowing he manipulated Tetch into shooting her instead of Lee. Tetch breaks into the morgue and drains the blood from Alice's corpse. He also exposes Gordon to the powerful \"Red Queen\" hallucinogen, causing intense hallucinations that bring Gordon to a war-torn GCPD, to a life where he is married to Lee with two children, and to an encounter with his deceased father, who encourages him to be a better protector for Gotham. Mario brings Gordon back to consciousness. Cobblepot attempts to manipulate Isabella and Nygma into breaking off their relationship, but to no avail. Barnes loses control and attacks a suspect while questioning him over the break-in; he and Bullock learn Tetch is planning to spread the virus at the city Founders' Party, and arrest him in time. Gordon decides to honor his father by rejoining the GCPD.",
    "title": "Red Queen",
    "date": "October 31, 2016 ",
    "directed_by": "Scott White",
    "views": "3.16",
    "episode": "E07",
    "season": ""
  },
  {
    "description": "After losing control and killing a criminal, Barnes visits Jervis Tetch at Arkham Asylum and demands to know if the virus can be cured, but Tetch says it's only a matter of time before it takes him over. Barnes begins hearing voices that urge him to kill more criminals. Lee and Mario throw an engagement party, where Barnes makes plans to turn himself in to police custody. However, his psychosis overpowers him when he learns Dr. Symon, a killer he arrested, has been released thanks to his powerful connections. Losing faith in Gotham's justice system, Barnes kills Symon and plans to murder criminals on a larger scale.",
    "title": "Blood Rush",
    "date": "November 7, 2016 ",
    "directed_by": "Rob Bailey",
    "views": "3.52",
    "episode": "E08",
    "season": ""
  },
  {
    "description": "Driven mad by the virus, Nathaniel Barnes has become a vigilante, murdering any criminals that cross his path. After Gordon becomes suspicious of Barnes, he attempts to frame Gordon for the murder of a low-level criminal, but is unable to convince the GCPD. After a showdown, Barnes is arrested and incarcerated in Arkham Asylum. After Cobblepot kills Isabella, Nygma suspects Butch Gilzean for the act; Cobblepot promises to help bring retribution to Butch. Ivy Pepper reveals herself to Bruce and Selina in her new adult form. However, she is being followed by people seeking to kill her for a necklace she stole. The three of them escape, and later find the necklace's original owner dead and that the necklace contains a key.",
    "title": "The Executioner",
    "date": "November 14, 2016 ",
    "directed_by": "John Behring",
    "views": "3.63",
    "episode": "E09",
    "season": ""
  },
  {
    "description": "Bruce learns the gang who's after the key is out to destroy the Court of Owls and is therefore not his enemy. Soon after, Talon murders the gang leader. When Mario is targeted by assassins, Falcone deduces that the Court is responsible and successfully blackmails them into ceasing their attack. Nygma kidnaps and tortures Butch and Tabitha, before discovering that they are not responsible for Isabella's death; showing remorse after cutting off Tabitha's hand, he allows them to go to the hospital. After investigating the matter, Barbara realizes Cobblepot killed Isabella and plans to use the truth to turn Nygma against him. Gordon makes one final goodbye to Lee before her upcoming wedding day with Mario. When Mario sees Lee with Gordon from a distance, he lets out a fit of rage and shows symptoms of the Tetch virus.",
    "title": "Time Bomb",
    "date": "November 21, 2016 ",
    "directed_by": "Hanelle M. Culpepper",
    "views": "3.44",
    "episode": "E10",
    "season": ""
  },
  {
    "description": "Infected by Alice Tetch's blood, Mario vows to make Lee hate Gordon, and orchestrates a series of events to make her believe Gordon is trying to sabotage their wedding. The plan works, and just before the wedding, she vows never to see Gordon again. On their honeymoon, a deranged Mario attempts to kill an oblivious Lee, but Gordon arrives and guns him down, much to her shock. Barbara informs Nygma that Cobblepot killed Isabella because he's in love with him; after verifying this information, Barbara and Nygma plan to betray Cobblepot and usurp his power in the mob. Bruce, Selina, and Alfred use the key to open the Court of Owls' vault and steal its contents—a crystalline owl statue—but are intercepted by Talon; Selina's mother reveals herself and helps them kill Talon.",
    "title": "Beware the Green-Eyed Monster",
    "date": "November 28, 2016 ",
    "directed_by": "Danny Cannon",
    "views": "3.37",
    "episode": "E11",
    "season": ""
  },
  {
    "description": "In the wake of Mario's death, a vengeful Falcone sends Zsasz to kill Gordon; however, after seeing what the virus has done to Barnes, Lee realizes Gordon may have been justified and persuades Falcone to call off the hit. Unhinged by ghostly sightings of his father, Cobblepot insults Gotham's citizens on live TV and murders his Deputy Chief of Staff, unaware that Nygma is orchestrating his downward spiral. Selina accepts her mother Maria (Ivana Miličević) back into her life, but later learns Maria owes money to criminal Cole Clemons. Investigating the discovery of a briefly reanimated corpse, Gordon and Bullock pursue ex-Indian Hill employee Dwight Pollard (David Dastmalchian) as he prepares to resurrect another corpse: Jerome Valeska.",
    "title": "Ghosts",
    "date": "January 16, 2017 ",
    "directed_by": "Eagle Egilsson",
    "views": "3.69",
    "episode": "E12",
    "season": ""
  },
  {
    "description": "When the reanimation seemingly fails, Dwight cuts off Jerome's face and wears it as a mask as he leads a cult of Jerome fanatics to take over a news station. GCPD infiltrates the station and stops the cult, but Jerome awakens belatedly at GCPD Headquarters and abducts Dwight. Nygma, Barbara, and Tabitha manipulate Cobblepot into believing the other crime bosses have turned against him and taken Nygma captive. Bruce agrees to pay Maria's debt to Cole, but Selina becomes furious upon discovering the whole thing was a con Maria and Cole ran together, and that Bruce even suspected this but didn't want her to learn the painful truth. After reattaching his face, Jerome knocks out Gotham's power by igniting explosives strapped onto Dwight's body, causing a citywide blackout.",
    "title": "Smile Like You Mean It",
    "date": "January 23, 2017 ",
    "directed_by": "Olatunde Osunsanmi",
    "views": "3.60",
    "episode": "E13",
    "season": ""
  }
]