[
  {
    "description": "In 2166, Vandal Savage has successfully conquered the entire planet. In an effort to save humanity, Time Master Rip Hunter travels back to 2016 to assemble a group of superheroes and supervillains to team up and stop Savage's rise to power: Ray, Sara, Jefferson and Martin, Mick, Leonard, Carter, and Kendra. Hunter takes them to 1975 to talk to Professor Boardman, a leading expert on Savage. While providing information on Savage, Boardman also reveals that he is the son of Kendra and Carter from one of their past reincarnations. Meanwhile, a time-traveling bounty hunter named Chronos attacks Hunter's ship, the Waverider. The team is able to regroup and escape, but not before Boardman is wounded and dies. The attack forces Hunter to reveal that Chronos is after him for stealing the Waverider and going on the mission against the wishes of the Time Council and that part of his quest is based on his desire for revenge on Savage for murdering his wife and son in 2166. All members agree to aid Hunter, who warns that time will resist against the mission. In Norway 1975, Savage is shown in possession of weapons of mass destruction.",
    "title": "Pilot Part 1",
    "date": "January 21, 2016 ",
    "directed_by": "Glen Winter",
    "views": "3.21",
    "season": "S01",
    "episode": "E01"
  },
  {
    "description": "Still in 1975, the team infiltrates a weapons auction, where Savage intends to sell the nuclear warhead. Savage becomes aware of their presence. They all escape, but not before a piece of Ray's suit is left behind. Angry at the recklessness, Hunter points out what happens and how the technology of Ray's suit will be used to create super weapons that lead to the destruction of Central City in 2016. The team splits up, with Stein, Jax, and Sara retrieving the missing piece of Ray's suit by the help of Stein's younger self while Ray, Leonard, and Mick go in search of the dagger that killed Kendra and Carter in their first life. The dagger turns out to be in the home of Savage, who imprisons them and calls the rest of the team. Kendra and Carter go after Savage while the rest take on Savage's men. During the fight, Savage kills Carter with the dagger, revealing that only Kendra can wield it to kill him. She becomes injured, and the team is forced to retreat and plan a new strategy, determined to stop Savage.",
    "title": "Pilot Part 2",
    "date": "January 28, 2016 ",
    "directed_by": "Glen Winter",
    "views": "2.89",
    "episode": "E02",
    "season": ""
  },
  {
    "description": "While still in 1975, Kendra's injury stops the team from traveling through time, and Sara convinces Rip that another way to stop Savage would be to take away his financial resources. Rip locates the bank where Savage keeps his money and he and Sara go there to steal the funds. They learn that Savage is using Carter's blood to give his own men longer lives. Rip and his team engage Savage and reclaim Carter's body, but Rip inadvertently gives Savage the names of his family members before critically wounding him. Meanwhile, Kendra's condition worsens, requiring Ray to shrink down and enter her bloodstream to save her. Snart attempts to change his own family's fate, but his efforts ultimately change nothing. It is revealed that Rip once traveled to ancient Egypt 4000 years ago to kill Savage, but hesitated and has been known as a nemesis called Gareeb. The team buries Carter and Rip charts a course for 1986, so that the team can intercept Savage again.",
    "title": "Blood Ties",
    "date": "February 4, 2016 ",
    "directed_by": "Dermott Downs",
    "views": "2.32",
    "episode": "E03",
    "season": ""
  },
  {
    "description": "The team arrives in Washington, D.C, 1986 to stop Savage. They infiltrate the Pentagon and retrieve a file that points them toward scientist Valentina Vostok in the Soviet Union. Rip has Sara and Kendra work together to tame the feral nature that resides in each of them. Chronos tracks the team and Rip is forced to use Russian fighter jets to assist in taking down Chronos. While Ray and Snart go after Vostok, Rip tracks a time anomaly outside of Moscow. He finds his mentor, Zaman Druce, who offers to pardon Rip and return his new team to their time if Rip voluntarily surrenders. The pardon is revealed to be a trick and Druce attempts to kill Rip. With help from the team, Rip survives, but Chronos and Druce escape. Stein infiltrates a research lab and discovers Savage is trying to build an army with the same abilities as Firestorm. The former absorbs the energy in Savage's thermal core, which is returned to Rip by Snart; but Stein, Ray, and Mick are captured by the Soviets, with Vostok planning to use Stein for the project.",
    "title": "White Knights",
    "date": "February 7, 2016 ",
    "directed_by": "Antonio Negret",
    "views": "2.39",
    "episode": "E04",
    "season": ""
  },
  {
    "description": "The team brokers a deal with the Bratva to get into the gulag where Ray, Mick, and Stein are being held. Rip secretly tasks Sara with killing Stein, should they fail to rescue him. Savage has Ray and Mick tortured in front of Stein, forcing him to cooperate. Obtaining the formula, Valentina discovers that Stein is the other half of Firestorm. The team arrives at the gulag just as Valentina enters a reactor to start absorbing energy from a new thermal core. Snart rescues Mick and Ray, but Valentina merges with Stein to create a Soviet Firestorm. Jefferson is able to reach Stein's consciousness and force the two to separate. Without Stein or a quantum splicer, Valentina implodes. As the team moves into the time stream, they are attacked by Chronos, who forces them to crash land in a ruined Star City, 2046. They are confronted by a green-hooded archer whom they mistake for Oliver.",
    "title": "Fail-Safe",
    "date": "February 18, 2016 ",
    "directed_by": "Dermott Downs",
    "views": "2.25",
    "episode": "E05",
    "season": ""
  },
  {
    "description": "The archer attacks the team and they retreat back to the Waverider to make repairs and leave 2046. Rip, Sara, Snart, and Mick head to Smoak Industries, the new title of Palmer Tech, to find an essential part needed to repair the ship. Sara follows the vigilante, who turns out to be John Diggle, Jr. under the alias of Connor Hawke. It is revealed that 15 years prior, Grant Wilson, Slade's son, arrived in Star City with an army and took over. While searching through Oliver's old hideout, Sara and Rip find a 61 year old Oliver., who directs them to where they can find the part, but refuses to help in the struggle. In a fight with Grant's men, Connor is taken prisoner. Sara convinces Oliver to resume the Green Arrow mantle. With the rest of Rip's team as backup, Oliver is able to defeat Grant for good. With the ship repaired, the team re-enters the time stream. Meanwhile, Jefferson and Ray develop feelings for Kendra, but realized that she does not want anyone in her life. Mick tells Snart about his desire to see the world burn instead of saving it.",
    "title": "Star City 2046",
    "date": "February 25, 2016 ",
    "directed_by": "Steve Shill",
    "views": "2.47",
    "episode": "E06",
    "season": ""
  },
  {
    "description": "Savage's trail goes cold and Rip is unable to track it without an upgrade to Gideon's software. The team receives a distress call from another time ship, the Acheron, in deep space. Rip decides to steal the ship's A.I. software. The former, Stein, Jefferson, and Mick board the Acheron, where everyone but Stein is captured by time pirates who want the Waverider, on which the pirates fire, damaging the hull. Sara and Snart attempt to fix the hull, but get locked in the room, from which the air is slowly leaking out. As Stein rescues the others, Ray manages to repair the hull. Mick leads the pirates to the Waverider. Rip and the others retake the Acheron while Sara and Snart stop Mick and the pirates on the Waverider. The Acheron's captain provides Gideon's upgrade and a tip on Savage's location. Ray and Kendra develop a romantic relationship. Snart apparently kills Mick at an unknown place and time. In flashbacks to the alternate timeline, Rip's future wife is revealed to be a Time Master. The Time Council finds out about their relationship, which is forbidden for Time Masters; and she resigns in order to save Rip's career.",
    "title": "Marooned",
    "date": "March 3, 2016 ",
    "directed_by": "Gregory Smith",
    "views": "2.28",
    "episode": "E07",
    "season": ""
  },
  {
    "description": "The team arrives in Oregon, 1958 to investigate a series of murders tied to Savage. Infiltrating a mental institution, Sara discovers that Savage is a psychiatrist there under another name. Ray and Kendra pose as a married couple to investigate in the suburbs, but discover that Savage lives there as well. Elsewhere, Jefferson is attacked by humanoid bird-like creatures created by Savage from an Nth metal meteorite similar to the one that gave Kendra and Carter their powers. Jefferson is abducted by the local sheriff and delivered to Savage. The team decides to go after Savage at the institution, where he has already infected Jefferson with the Nth metal and transformed him into one of the creatures. Kendra fails to kill Savage, who escapes. The rest of the team manages to recapture Jefferson. Stein and Gideon create a serum that cures Jefferson and the other victims. Chronos then arrives and storms the ship, forcing the Waverider to quickly leave, stranding Ray, Sara, and Kendra in 1958.",
    "title": "Night of the Hawk",
    "date": "March 10, 2016 ",
    "directed_by": "Joe Dante",
    "views": "2.01",
    "episode": "E08",
    "season": ""
  },
  {
    "description": "Chronos disables the Waverider and flees back into the timestream, taking Snart with him. Rip is forced to reset Gideon to undo Chronos' sabotage, leaving the ship temporarily stranded in the timestream. Meanwhile, two years pass for Ray, Sara, and Kendra. Ray and Kendra build a life together while Sara joins the League of Assassins. Rip and the rest of the team arrive in 1960 and get Ray and Kendra. They travel to Nanda Parbat to rescue Sara, but she is revealed to have fully committed to Ra's al Ghul's mission and turns the team over to him as trespassers to be executed. Rip invokes the trial-by-combat ritual to save the team, with Kendra and Sara named as the champions to fight. Elsewhere, Chronos reveals himself to Snart as Mick, having been found by the Time Masters and trained to be their bounty hunter. Kendra is able to get through to Sara just as Chronos arrives. Ra's frees the team, which successfully stops Chronos and discovers his real identity. Ra's releases Sara and the others. Imprisoning Mick on the Waverider, the team decides to try to reform him. They head to 2147, their last stand against Savage.",
    "title": "Left Behind",
    "date": "March 31, 2016 ",
    "directed_by": "John F. Showalter",
    "views": "1.97",
    "episode": "E09",
    "season": ""
  },
  {
    "description": "The team arrives in Kasnia, 2147. They discover Savage is personally grooming Per Degaton, son of Tor, the ruler. Rip reveals that when Per rises to power, he will unleash a virus that decimates most of the planet and allows Savage to kill Per and conquer the world. The team decides to remove Per from the timeline and prevent Savage's rise to power. The kidnapping does not affect the timeline, so Rip releases Per and implores him not to let Savage influence his decisions. However, Per kills Tor on Savage's advice, accelerating the latter's rise. Meanwhile, Ray finds his suit's technology has been used to create autonomous policing robots that Savage will use to help conquer the world and that the family line of his brother, Sydney, founded the company that created them. After settling his differences with Snart for the moment, Mick reveals that the Time Masters have released a group called the \"Hunters,\" whose sole purpose will be to track down the team and kill each of them, including Mick.",
    "title": "Progeny",
    "date": "April 7, 2016 ",
    "directed_by": "David Geddes",
    "views": "1.88",
    "episode": "E10",
    "season": ""
  },
  {
    "description": "The team travels to Salvation, South Dakota in 1871 to hide out from the Hunters. While Rip decides their next move, the rest of the team goes into town, where they meet Jonah Hex, who knows they are time travelers and once fought alongside Rip in years past. Kendra gets flashbacks from one of her previous lives and goes to investigate, while Ray and the rest of the team head back to town to defend against the Stillwater gang. Kendra and Sara follow the former's visions to an old woman, who turns out to be the Kendra from that time period. The past Kendra warns her future incarnation not to love a different man, as it will always end in either heartbreak or tragedy. The team goes after the Stillwater gang and captures their leader, Jeb, but Jackson is apprehended as they escape. The team sets up a quick draw duel between Rip and Jeb to barter for Jackson's life. Rip wins, but the Hunters arrive before the team can leave. They defeat the Hunters, but not before they learn that the Time Masters have sent the \"Pilgrim\" to kill their younger selves, thus erasing the members from the timeline.",
    "title": "The Magnificent Eight",
    "date": "April 12, 2016 ",
    "directed_by": "Thor Freudenthal",
    "views": "1.98",
    "episode": "E11",
    "season": ""
  },
  {
    "description": "Gideon uses the Pilgrim's temporal distortions to predict her next move. After they successfully rescue Mick and Sara's younger selves, Gideon loses track of the Pilgrim's movements, allowing her to take out any of the team members without them knowing. The Pilgrim goes after Ray in 2014, but the team arrives just in time to save his former self and prevent Ray's death. Rip decides to abduct the rest of the team's infant selves to prevent the Pilgrim from killing any selves of them. They are successful, bringing the infants to Rip's adoptive mother for her to look after until they can stop the Pilgrim. The Pilgrim kidnaps the team members' loved ones, threatening to kill them unless the members give themselves up. Rip agrees to give up his younger self from before he became a Time Master, thus preventing the team's formation, in exchange for everyone's safety. The Pilgrim agrees, but the team sets a trap for her, managing to kill her. Afterward, Ray and Kendra become engaged. Rip says that the only time to stop Savage is in 2166, at the peak of the latter's power.",
    "title": "Last Refuge",
    "date": "April 21, 2016 ",
    "directed_by": "Rachel Talalay",
    "views": "1.78",
    "episode": "E12",
    "season": ""
  },
  {
    "description": "The team travels to London, 2166 to try to eliminate Savage just before he finally takes over the world. While investigating Savage, Kendra notices that one of his female officers is wearing a bracelet that she originally wore when she first died in ancient Egypt. The team plans to retrieve the bracelet, knowing that it will help them kill Savage. They also join forces with local rebels. The officer turns out to be Cassandra, Savage's daughter. Snart kidnaps her and manages to convince her to assist them. Rory helps Kendra melt the bracelet down and coat Carter's mace so that it can be used to kill Savage. Savage's giant robot called the Leviathan attacks the Waverider. While the others go after Savage, Ray reverses the polarity of his suit so that he can grow in size and takes out the Leviathan. The mace works, but Kendra refuses to kill Savage when she learns that he has brainwashed that generation's incarnation of Carter to be his soldier. To save Carter's mind, she and Rip imprison Savage on the Waverider.",
    "title": "Leviathan",
    "date": "April 28, 2016 ",
    "directed_by": "Gregory Smith",
    "views": "1.86",
    "episode": "E13",
    "season": ""
  },
  {
    "description": "Upon the revelation that the Leviathan was technology from the distant future, proving Savage has manipulated time, Rip believes the Time Masters will finally ratify his mission and sets course for the Vanishing Point. Jefferson fixes the damaged time drive, but is exposed to time radiation which ages him prematurely. Stein is forced to send him back to 2016 in the jump ship to reverse the process. Carter, now named Scythian Torvil, is kept prisoner while Kendra tries to restore his memories, causing a rift between her and Ray which effectively ends their relationship. Savage tries to manipulate some of the team members, allowing him to escape his cell. Just as Savage is about to kill Kendra, Scythian regains his memories as Carter and saves her, but is stabbed by Savage before Kendra knocks the latter unconscious. The team arrives at the Vanishing Point, where the Time Masters reveal that they have been working with Savage, who is to be sent back to 2166 to carry on with his plan while Rip and his team are put under arrest.",
    "title": "River of Time",
    "date": "May 5, 2016 ",
    "directed_by": "Alice Troughton",
    "views": "1.63",
    "episode": "E14",
    "season": ""
  },
  {
    "description": "Kendra and Scythian are turned over to Savage as he returns to 2166, when he kills Rip's family again. Sara and Snart, who evaded capture, make plans to rescue the team with the help of Gideon. Druce explains to Rip that the Time Masters helped Savage because an alien race from the planet Thanagar will attack Earth in 2175 and only Savage is able to unite the world and stop them. Druce also reveals the Oculus, which the Time Masters used to manipulate Rip's team among various others to facilitate Savage's rise to power, including orchestrating the murder of Rip's family. Snart and Sara disable the other time ships and rescue the others. The team decides to destroy the Oculus, only to find Druce waiting for them with soldiers. Having recruited Martin's 2016 self to help him, Jefferson returns in the jump ship and evens the odds. But the success of the Oculus' self-destruct costs the life of Snart, who takes Druce out with him. Savage learns of the unpredictability of timeline due to the destruction of the Oculus and decides to make use of the time traveling technology at his disposal.",
    "title": "Destiny",
    "date": "May 12, 2016 ",
    "directed_by": "Olatunde Osunsanmi",
    "views": "1.89",
    "episode": "E15",
    "season": ""
  },
  {
    "description": "Kendra leaves a message for the team alerting them to Savage's presence in France, 1944; but they are unable to stop him and only manage to rescue Scythian. Savage reveals that the Thanagarians sent three meteors to ancient Egypt; and he plans to use Kendra's and Scythian's blood to activate the meteors' alien technology and erase time back to 1700 BC, where he can rule. Stein deduces Savage's method, also concluding that radiation from all three meteors will render Savage mortal, so anyone can kill him. The team breaks up into pairs, traveling to 1958, 1975, and 2021. All three groups kill Savage. Ray and Firestorm destroy two of the meteors, and Rip uses the Waverider to send the last meteor into the sun before it can explode and destroy the Earth. Kendra and Scythian stay behind to defend in 2016 while the others decide to help Rip protect the timeline. Before they can leave 2016, however, Rex Tyler arrives in a future version of the Waverider and warns the team of their impending death.",
    "title": "Legendary",
    "date": "May 19, 2016 ",
    "directed_by": "Dermott Downs",
    "views": "1.85",
    "episode": "E16",
    "season": ""
  },
  {
    "description": "In 2016, historian Nate Heywood enlists Mayor Oliver Queen's help in locating the Waverider after it was caught in a nuclear blast in 1942. The pair find the sunken ship with only Mick aboard in stasis, who tells them what happened after being revived. Rip's team—Mick, Ray, Sara, Jax, and Martin—traveled through time dealing with \"aberrations\" in history. They learned that a nuclear bomb would be detonated in New York City in 1942. The team discovered Damien Darhk, working with the Nazis, was behind the attack. Sara attempted to kill Darhk to prevent Laurel's death, but Darhk escaped and launched his sole atomic bomb toward New York from a U-boat. Rip chose to scatter the team throughout time, except for the injured Mick, to save their lives while he intercepted the bomb with the Waverider and saved New York. In the present, Mick and Nate use the Waverider to travel through time and rescue everyone, but fail to find any trace of Rip. After fixing events in 1942 to prevent the Nazis from making a nuclear bomb, the team is confronted by the Justice Society of America (JSA). Meanwhile, Darhk is shown to be working with Eobard Thawne.",
    "title": "Out of Time",
    "date": "October 13, 2016 ",
    "directed_by": "Dermott Downs",
    "views": "1.82",
    "season": "S02",
    "episode": "E01"
  },
  {
    "description": "The Justice Society captures the team, believing them to be Nazi spies. Nate reveals that he is the grandson of JSA member Commander Steel. After the JSA is assigned a mission to obtain information on Nazi Captain Baron Krieger, they release the team and strongly advise them to leave 1942. The JSA learns that Krieger intends to trade away an amulet in Hitler's possession; his trade partner turns out to be Eobard, who has given him a sample of the serum with which he intends to barter. Nate soon discovers that the JSA dies on this mission, so the team travels back to rescue them. While the teams collect the amulet and fight the Nazis, Krieger uses the serum on himself and turns into a monstrous superhuman. He manages to capture Ray and JSA member Amaya. Ray offers to replicate the formula to save Amaya. The teams then attack the Nazi base, save Ray and Amaya, and take down Krieger. However, hemophiliac Nate is critically injured in the process. Ray saves him by using the modified serum he developed. After the team departs, Eobard appears at the JSA headquarters and stabs Rex Tyler to erase him from the timeline before stealing the amulet. A dying Rex whispers \"time traveler\" to Amaya.",
    "title": "The Justice Society of America",
    "date": "October 20, 2016 ",
    "directed_by": "Michael Grossman",
    "views": "1.80",
    "episode": "E02",
    "season": ""
  },
  {
    "description": "Amaya stows away on the Waverider and attacks Mick, believing him responsible for Rex's death. Nate stops her using his newly-developed ability to convert his body to a steel-like form. Sara convinces Amaya that a rogue time traveller is likely to blame for the murder. An accident during Ray's testing of Nate's abilities throws both men into the time vortex and strands them in 17th-century feudal Japan. Nate is found and cared for by Masako Yamashiro, the betrothed of shogun Tokugawa Iemitsu whose samurai capture Ray. Sara, Amaya, and Mick rescue Ray from Tokugawa, who uses the Atom suit against them. They meet up with a recovered Nate, who does not want to leave Masako to Tokugawa's mercy. They defend Masako's village from the samurai, while Ray and Nate defeat Tokugawa by destroying the Atom suit. Nate and Amaya officially join the team. Meanwhile, Jefferson and Stein discover a hidden armory inside the ship and a secret message from Barry Allen from 2056 intended for Rip and forbidden from the crew.",
    "title": "Shogun",
    "date": "October 27, 2016 ",
    "directed_by": "Kevin Tancharoen",
    "views": "1.75",
    "episode": "E03",
    "season": ""
  },
  {
    "description": "The team learns of a time pirate stranded in the American Civil War. Upon arriving, they encounter a black man, Henry Scott, being chased by Confederate soldiers that have been turned into zombies by a virus carried by the pirate. The team defeats the group of zombies, but Henry is killed. Before his death, Henry reveals he is a Union spy assigned to steal Confederate battle plans for General Grant and asks Jefferson to complete his mission. The team discovers that Mick is infected with the virus and returns him to the Waverider, where Ray and Martin ultimately manage to cure him. Sara and Nate go to warn Grant about the zombies while Jax and Amaya attempt to steal the plans. Jax runs afoul of a plantation owner and is locked up. Amaya frees him and the other black prisoners. They find the plans and burn down the mansion during a zombie attack. Meanwhile, Grant's camp is also attacked by zombies. Sara formulates a successful plan to kill them using Nate's powers. Jax, posing as Henry Scott, gives the plans to Grant, which will ensure a Union battle victory. A grateful Mick gives Leonard Snart's cold gun to Ray.",
    "title": "Abominations",
    "date": "November 3, 2016 ",
    "directed_by": "Michael Allowitz",
    "views": "1.75",
    "episode": "E04",
    "season": ""
  },
  {
    "description": "In 1987, Eobard Thawne offers Damien Darhk an alliance, which Darhk declines. Aboard the Waverider, Nate discovers an aberration in 1987 involving the INF treaty signing. The team infiltrates the White House as tourists and find Darhk there as one of the treaty negotiators. Sara again attempts to kill him, which alerts White House security and forces the team to make a very public escape. They soon learn that Darhk is making his own secret deal with the KGB. Returning to the White House during a State dinner, they discover him making an exchange with KGB agents for a box with an unknown item. The team defeat Darhk's men and the Russians. Sara confronts Darhk, but spares his life. Instead, she reveals his future to torture him: his master plan's failure, his wife's murder, and his own eventual death. Eobard whisks Darhk away, but not before Sara steals the box from him. She realizes the team is up against a time-travelling speedster. Unnerved by Sara's revelation, Darhk insists on teaming up with Eobard, and the two enter the time stream.",
    "title": "Compromised",
    "date": "November 10, 2016 ",
    "directed_by": "David Geddes",
    "views": "1.77",
    "episode": "E05",
    "season": ""
  },
  {
    "description": "The team learns of an aberration in Colorado, 1874, where they save Jonah Hex from execution. He reveals that he is fighting an outlaw boss named Quentin Turnbull. Nate reveals that the aberration is Turnbull leading the Western US in its secession to form the \"Turnbull Country\". The team learns that Turnbull is extracting dwarf star, which Ray used for his A.T.O.M. suit, and that Turnbull is planning to destroy a critical railway connecting the Eastern US to the West, stopping the US Army from marching toward the West. While Sara and Jonah engage Turnbull, Mick and Amaya destroy the mine, and Nate uses his powers to stop the train. Instead of killing Turnbull, Jonah decides to deliver him to the authorities. With the dwarf star taken, Ray plans to rebuild his suit, and shows Nate the suit he has made for the latter. Amaya decides to teach Mick to control his anger. Martin and Jefferson deduce that due to the former's interaction with his past self, he may have altered the past. Sara tells the team that they need to return to 2016 to help their friends.",
    "title": "Outlaw Country",
    "date": "November 17, 2016 ",
    "directed_by": "Cherie Nowlan",
    "views": "1.85",
    "episode": "E06",
    "season": ""
  },
  {
    "description": "\nNate, Mick, Amaya, Felicity and Cisco travel back to the first Dominator invasion of Earth in Oregon, 1951. The Legends successfully capture a Dominator for information, but are themselves captured by federal agents. While in custody, they learn from the Dominator that the aliens arrived to assess the threat humanity posed now that metahumans have appeared. Felicity and Cisco rescue the Legends and help set the Dominator free. Meanwhile in Central City 2016, the team learns that the Dominators know about Barry's manipulation of the timeline, and that they demand his surrender in exchange for peace. After the Legends return, the team discovers that the Dominators' weapon is a bomb that will kill all metahumans on Earth, with millions of collateral human casualties. The teams dissuade Barry from surrendering, with Cisco reconciling with him. They manage to destroy the bomb and force the Dominators to retreat using pain-inflicting nanotechnology. Cisco gives Supergirl a device to travel between their universes. Martin convinces Jefferson not to tell the others that his daughter, Lily, is an aberration of the timeline.\n\nThis episode concludes a crossover that begins on The Flash season 3 episode 8 and continues on Arrow season 5 episode 8.",
    "title": "Invasion!",
    "date": "December 1, 2016 ",
    "directed_by": "Gregory Smith",
    "views": "3.39",
    "episode": "E07",
    "season": ""
  },
  {
    "description": "Eobard, Darhk and Malcolm Merlyn arrive in Chicago, 1927, and ally with Al Capone. Learning of the aberration, the Legends arrive and manage to keep Capone from murdering Eliot Ness. Ness is critically injured, so the team decides to obtain vital information on Capone's operation to secure history. Meanwhile, Mick begins having hallucinations of Snart, who belittles him for acting like his teammates. Sara and Martin are abducted by Eobard during their infiltration and raid on Capone's club. Malcolm offers Sara a chance to change her past in return for the amulet she took from Darhk in 1987, but she refuses. The team rescues the captives, but \"Martin\" turns out to be a disguised Eobard, who searches the Waverider at super-speed for the amulet while Malcolm attacks the ship directly. Eobard barely escapes revenge at Amaya's hand, but Sara surrenders the amulet for Martin's safety. The Legends succeed in correcting the timeline. Eobard later shows his partners that the completed amulet projects a holographic map that can locate the Spear of Destiny, which is able to \"rewrite reality itself\". They must next locate Rip Hunter, who is revealed to be working as a movie director in 1967 Los Angeles.",
    "title": "The Chicago Way",
    "date": "December 8, 2016 ",
    "directed_by": "Ralph Hemecker",
    "views": "2.00",
    "episode": "E08",
    "season": ""
  },
  {
    "description": "During the New York attack, Rip recovered the Spear from the Waverider and used the time drive to escape. In the present, the team learns about the Spear and arrives in Los Angeles, 1967, when they confront Darhk and Malcolm attempting to kidnap Rip, who has no memories of his previous adventures and is training with George Lucas. Both parties escape; and Rip is arrested by the police. The team abducts him from custody and takes him to the Waverider. Nate and Ray are revealed to have lost their specialties and powers since the aberration caused Lucas to quit filmmaking. While Nate, Amaya and Ray meet Lucas to dissuade him, the others learn that Lucas has a fragment of the Spear. Darhk and Malcolm overpower Amaya's party and forces them to search for the fragment in a dumpster. The others arrive and a battle ensues, during which they recover the fragment and the Medallion; but Rip is abducted by Thawne, who intends to torture him to find the other fragments. Lucas returns to filmmaking; and the team vows to rescue Rip. Meanwhile, Mick tells Stein about his hallucinations, which the latter eventually interprets are emotional, not neural.",
    "title": "Raiders of the Lost Art",
    "date": "January 24, 2017 ",
    "directed_by": "Dermott Downs",
    "views": "1.74",
    "episode": "E09",
    "season": ""
  }
]