[
  {
    "description": "\nIn 2166, the immortal warrior Vandal Savage has successfully conquered the entire planet. In an effort to save humanity, Time Master Rip Hunter travels back to 2016 to assemble a group of superheroes and supervillains to team up and stop Savage's rise to power: Ray Palmer, Sara Lance, Jefferson Jackson and Martin Stein, Mick Rory, Leonard Snart, Carter Hall, and Kendra Saunders. Hunter takes them to 1975 to talk to Professor Boardman, a leading expert on Savage. While providing information on Savage, Boardman also reveals that he is the son of Kendra and Carter from one of their past reincarnations. Meanwhile, a time-traveling bounty hunter named Chronos attacks Hunter's ship, the Waverider. The team is able to regroup and escape, but not before Boardman is wounded and dies. The attack forces Hunter to reveal that Chronos is after him for stealing the Waverider and going on the mission against the wishes of the Time Council and that part of his quest is based on his desire for revenge on Savage for murdering his wife and son in 2166. All members agree to aid Hunter, who warns that time will resist against the mission. In Norway 1975, Savage is shown in possession of weapons of mass destruction.",
    "title": "Pilot, Part 1",
    "episode": "E01",
    "season": "S01"
  },
  {
    "description": "\nStill in 1975, the team infiltrates a weapons auction, where Savage intends to sell the nuclear warhead. Savage becomes aware of their presence. They all escape, but not before a piece of Ray's suit is left behind. Angry at the recklessness, Hunter points out what happens and how the technology of Ray's suit will be used to create super weapons that lead to the destruction of Central City in 2016. The team splits up, with Stein, Jax, and Sara retrieving the missing piece of Ray's suit by the help of Stein's younger self while Ray, Leonard, and Mick go in search of the dagger that killed Kendra and Carter in their first life. The dagger turns out to be in the home of Savage, who imprisons them and calls the rest of the team. Kendra and Carter go after Savage while the rest take on Savage's men. During the fight, Savage kills Carter with the dagger, revealing that only Kendra can wield it to kill him. She becomes injured, and the team is forced to retreat and plan a new strategy, determined to stop Savage.",
    "title": "Pilot, Part 2",
    "episode": "E02",
    "season": ""
  },
  {
    "description": "\nWhile still in 1975, Kendra's injury stops the team from traveling through time, and Sara convinces Rip that another way to stop Savage would be to take away his financial resources. Rip locates the bank where Savage keeps his money and he and Sara go there to steal the funds. They learn that Savage is using Carter's blood to give his own men longer lives. Rip and his team engage Savage and reclaim Carter's body, but Rip inadvertently gives Savage the names of his family members before critically wounding him. Meanwhile, Kendra's condition worsens, requiring Ray to shrink down and enter her bloodstream to save her. Snart attempts to change his own family's fate, but his efforts ultimately change nothing. It is revealed that Rip once traveled to ancient Egypt 4000 years ago to kill Savage, but hesitated and has been known as a nemesis called Gareeb. The team buries Carter and Rip charts a course for 1986, so that the team can intercept Savage again.",
    "title": "Blood Ties",
    "episode": "E03",
    "season": ""
  },
  {
    "description": "\nThe team arrives in Washington, D.C., 1986 to stop Savage. They infiltrate the Pentagon and retrieve a file that points them toward scientist Valentina Vostok in the Soviet Union. Rip has Sara and Kendra work together to tame the feral nature that resides in each of them. Chronos tracks the team and Rip is forced to use Russian fighter jets to assist in taking down Chronos. While Ray and Snart go after Vostok, Rip tracks a time anomaly outside of Moscow. He finds his mentor, Zaman Druce, who offers to pardon Rip and return his new team to their time if Rip voluntarily surrenders. The pardon is revealed to be a trick and Druce attempts to kill Rip. With help from the team, Rip survives, but Chronos and Druce escape. Stein infiltrates a research lab and discovers Savage is trying to build an army with the same abilities as Firestorm. The former absorbs the energy in Savage's thermal core, which is returned to Rip by Snart; but Stein, Ray, and Mick are captured by the Soviets, with Vostok planning to use Stein for the project.",
    "title": "White Knights",
    "episode": "E04",
    "season": ""
  },
  {
    "description": "\nThe team brokers a deal with the Bratva to get into the gulag where Ray, Mick, and Stein are being held. Rip secretly tasks Sara with killing Stein, should they fail to rescue him. Savage has Ray and Mick tortured in front of Stein, forcing him to cooperate. Obtaining the formula, Valentina discovers that Stein is the other half of Firestorm. The team arrives at the gulag just as Valentina enters a reactor to start absorbing energy from a new thermal core. Snart rescues Mick and Ray, but Valentina merges with Stein to create a Soviet Firestorm. Jax is able to reach Stein's consciousness and force the two to separate. Without Stein or a quantum splicer, Valentina implodes. As the team moves into the time stream, they are attacked by Chronos, who forces them to crash land in a ruined Star City, 2046. They are confronted by a green-hooded archer whom they mistake for Oliver.",
    "title": "Fail-Safe",
    "episode": "E05",
    "season": ""
  },
  {
    "description": "\nThe archer attacks the team and they retreat back to the Waverider to make repairs and leave 2046. Rip, Sara, Snart, and Mick head to Smoak Industries, the new title of Palmer Tech, to find an essential part needed to repair the ship. Sara follows the vigilante, who turns out to be John Diggle, Jr. under the alias of Connor Hawke. It is revealed that 15 years prior, Grant Wilson, Slade's son, arrived in Star City with a Mirakuru army and took over. While searching through Oliver's old hideout, Sara and Rip find a 61-year-old Oliver, who directs them to where they can find the part, but refuses to help in the struggle. In a fight with Grant's men, Connor is taken prisoner. Sara convinces Oliver to resume the Green Arrow mantle. With the rest of Rip's team as backup, Oliver is able to defeat Grant for good. With the ship repaired, the team re-enters the time stream. Meanwhile, Jax and Ray develop feelings for Kendra, but realized that she does not want anyone in her life. Mick tells Snart about his desire to see the world burn instead of saving it.",
    "title": "Star City 2046",
    "episode": "E06",
    "season": ""
  },
  {
    "description": "\nSavage's trail goes cold and Rip is unable to track it without an upgrade to Gideon's software. The team receives a distress call from another time ship, the Acheron, in deep space. Rip decides to steal the ship's A.I. software. The former, Stein, Jax, and Mick board the Acheron, where everyone but Stein is captured by time pirates who want the Waverider, on which the pirates fire, damaging the hull. Sara and Snart attempt to fix the hull, but get locked in the room, from which the air is slowly leaking out. As Stein rescues the others, Ray manages to repair the hull. Mick betrays the team and leads the pirates to the Waverider. Rip and the others retake the Acheron while Sara and Snart stop Mick and the pirates on the Waverider. The Acheron's captain provides Gideon's upgrade and a tip on Savage's location. Ray and Kendra develop a romantic relationship. Snart apparently kills Mick at an unknown place and time. In flashbacks to the alternate timeline, Rip's future wife is revealed to be a Time Master. The Time Council finds out about their relationship, which is forbidden for Time Masters; and she resigns in order to save Rip's career.",
    "title": "Marooned",
    "episode": "E07",
    "season": ""
  },
  {
    "description": "\nThe team arrives in Oregon, 1958 to investigate a series of murders tied to Savage. Infiltrating a mental institution, Sara discovers that Savage is a psychiatrist there under another name. Ray and Kendra pose as a married couple to investigate in the suburbs, but discover that Savage lives there as well. Elsewhere, Jax is attacked by humanoid bird-like creatures created by Savage from an Nth metal meteorite similar to the one that gave Kendra and Carter their powers. Jax is abducted by the local sheriff and delivered to Savage. The team decides to go after Savage at the institution, where he has already infected Jax with the Nth metal and transformed him into one of the creatures. Kendra fails to kill Savage, who escapes. The rest of the team manages to recapture Jax. Stein and Gideon create a serum that cures Jax and the other victims. Chronos then arrives and storms the ship, forcing the Waverider to quickly leave, stranding Ray, Sara, and Kendra in 1958.",
    "title": "Night of the Hawk",
    "episode": "E08",
    "season": ""
  },
  {
    "description": "\nChronos disables the Waverider and flees back into the timestream, taking Snart with him. Rip is forced to reset Gideon to undo Chronos' sabotage, leaving the ship temporarily stranded in the timestream. Meanwhile, two years pass for Ray, Sara, and Kendra. Ray and Kendra build a life together while Sara rejoins the League of Assassins. Rip and the rest of the team arrive in 1960 and get Ray and Kendra. They travel to Nanda Parbat to rescue Sara, but she is revealed to have fully committed to Ra's al Ghul's mission and turns the team over to him as trespassers to be executed. Rip invokes the trial-by-combat ritual to save the team, with Kendra and Sara named as the champions to fight. Elsewhere, Chronos reveals himself to Snart as Mick, having been found by the Time Masters and trained to be their bounty hunter. Kendra is able to get through to Sara just as Chronos arrives. Ra's frees the team, who successfully stops Chronos and discovers his real identity. Ra's releases Sara and the others. Imprisoning Mick on the Waverider, the team decides to try to reform him. They head to 2147, their last stand against Savage.",
    "title": "Left Behind",
    "episode": "E09",
    "season": ""
  },
  {
    "description": "\nThe team arrives in Kasnia, 2147. They discover Savage is personally grooming Per Degaton, son of Tor, the ruler. Rip reveals that when Per rises to power, he will unleash a virus that decimates most of the planet and allows Savage to kill Per and conquer the world. The team decides to remove Per from the timeline and prevent Savage's rise to power. The kidnapping does not affect the timeline, so Rip releases Per and implores him not to let Savage influence his decisions. However, Per kills Tor on Savage's advice, accelerating the latter's rise. Meanwhile, Ray finds his suit's technology has been used to create autonomous policing robots that Savage will use to help conquer the world and that the family line of his brother, Sydney, founded the company that created them. After settling his differences with Snart for the moment, Mick reveals that the Time Masters have released a group called the \"Hunters,\" whose sole purpose will be to track down the team and kill each of them, including Mick for his failure.",
    "title": "Progeny",
    "episode": "E10",
    "season": ""
  },
  {
    "description": "\nThe team travels to Salvation, South Dakota in 1871 to hide out from the Hunters. While Rip decides their next move, the rest of the team goes into town, where they meet Jonah Hex, who knows they are time travelers and once fought alongside Rip in years past. Kendra gets flashbacks from one of her previous lives and goes to investigate, while Ray and the rest of the team head back to town to defend against the Jeb Stillwater gang. Kendra and Sara follow the former's visions to an old woman, who turns out to be the Kendra from that time period. The past Kendra warns her future incarnation not to love a different man, as it will always end in either heartbreak or tragedy. The team goes after the Stillwater gang and captures their leader, Jeb, but Jax is apprehended as they escape. The team sets up a quick draw duel between Rip and Jeb to barter for Jax's life. Rip wins, but the Hunters arrive before the team can leave. They defeat the Hunters, but not before they learn that the Time Masters have sent a bounty hunter with temporal powers known as the \"Pilgrim\" to kill their younger selves, thus erasing the members from the timeline.",
    "title": "The Magnificent Eight",
    "episode": "E11",
    "season": ""
  },
  {
    "description": "\nGideon uses the Pilgrim's temporal distortions to predict her next move. After they successfully rescue Mick and Sara's younger selves, Gideon loses track of the Pilgrim's movements, allowing her to take out any of the team members without them knowing. The Pilgrim goes after Ray in 2014, but the team arrives just in time to save his former self and prevent Ray's death. Rip decides to abduct the rest of the team's infant selves to prevent the Pilgrim from killing any selves of them. They are successful, bringing the infants to Rip's adoptive mother for her to look after until they can stop the Pilgrim. The Pilgrim kidnaps the team members' loved ones, threatening to kill them unless the members give themselves up. Rip agrees to give up his younger self from before he became a Time Master, thus preventing the team's formation, in exchange for everyone's safety. The Pilgrim agrees, but the team sets a trap for her, managing to kill her. Afterward, Ray and Kendra become engaged. Rip says that the only time to stop Savage is in 2166, at the peak of the latter's power.",
    "title": "Last Refuge",
    "episode": "E12",
    "season": ""
  },
  {
    "description": "\nThe team travels to London, 2166 to try to eliminate Savage just before he finally takes over the world. While investigating Savage, Kendra notices that one of his female officers is wearing a bracelet that she originally wore when she first died in ancient Egypt. The team plans to retrieve the bracelet, knowing that it will help them kill Savage. They also join forces with local rebels. The officer turns out to be Cassandra, Savage's daughter. Snart kidnaps her and manages to convince her to assist them. Rory helps Kendra melt the bracelet down and coat Carter's mace so that it can be used to kill Savage. Savage's giant robot called the Leviathan attacks the Waverider. While the others go after Savage, Ray reverses the polarity of his suit so that he can grow in size and takes out the Leviathan. The mace works, but Kendra refuses to kill Savage when she learns that he has brainwashed that generation's incarnation of Carter to be his soldier. To save Carter's mind, she and Rip imprison Savage on the Waverider.",
    "title": "Leviathan",
    "episode": "E13",
    "season": ""
  },
  {
    "description": "\nUpon the revelation that the Leviathan was technology from the distant future, proving Savage has manipulated time, Rip believes the Time Masters will finally ratify his mission and sets course for the Vanishing Point. Jax fixes the damaged time drive, but is exposed to time radiation which ages him prematurely. Stein is forced to send him back to 2016 in the jump ship to reverse the process. Carter, now named Scythian Torvil, is kept prisoner while Kendra tries to restore his memories, causing a rift between her and Ray which effectively ends their relationship. Savage tries to manipulate some of the team members, allowing him to escape his cell. Just as Savage is about to kill Kendra, Scythian regains his memories as Carter and saves her, but is stabbed by Savage before Kendra knocks the latter unconscious. The team arrives at the Vanishing Point, where the Time Masters reveal that they have been working with Savage, who is to be sent back to 2166 to carry on with his plan while Rip and his team are put under arrest.",
    "title": "River of Time",
    "episode": "E14",
    "season": ""
  },
  {
    "description": "\nKendra and Carter are turned over to Savage as he returns to 2166, when he kills Rip's family again. Sara and Snart, who evaded capture, make plans to rescue the team with the help of Gideon. Druce explains to Rip that the Time Masters helped Savage because an alien race from the planet Thanagar will attack Earth in 2175 and only Savage is able to unite the world and stop them. Druce also reveals the Oculus, which the Time Masters used to manipulate Rip's team among various others to facilitate Savage's rise to power, including orchestrating the murder of Rip's family. Snart and Sara disable the other time ships and rescue the others. The team decides to destroy the Oculus, only to find Druce waiting for them with soldiers. Having recruited Martin's 2016 self to help him, Jax returns in the jump ship and kills the soldiers. But the success of the Oculus' self-destruct costs the life of Snart, who takes Druce out with him. Savage learns of the unpredictability of the timeline due to the destruction of the Oculus and decides to make use of the time traveling technology at his disposal.",
    "title": "Destiny",
    "episode": "E15",
    "season": ""
  },
  {
    "description": "\nKendra leaves a message for the team alerting them to Savage's presence in France, 1944; but they are unable to stop him and only manage to rescue Carter. Savage reveals that the Thanagarians sent three meteors to ancient Egypt; and he plans to use Kendra's and Carter's blood to activate the meteors' alien technology and erase time back to 1700 BC, where he can rule. Stein deduces Savage's method, also concluding that radiation from all three meteors will render Savage mortal, so anyone can kill him. The team breaks up into pairs, traveling to 1958, 1975, and 2021. All three groups capture Savage and then kill him. Ray and Firestorm destroy two of the meteors, and Rip uses the Waverider to send the last meteor into the Sun before it can explode and destroy the Earth. Kendra and Carter stay behind to defend in 2016 while the others decide to help Rip protect the timeline. Before they can leave 2016, however, Rex Tyler arrives in a future version of the Waverider and warns the team of their impending death.",
    "title": "Legendary",
    "episode": "E16",
    "season": ""
  },
  {
    "description": "\nIn 2016, historian Nate Heywood enlists Mayor Oliver Queen's help in locating the Waverider after it was caught in a nuclear blast in 1942. The pair find the ship in an ocean with only Mick aboard in stasis, who tells them what happened after being revived. Rip's team—Mick, Ray, Sara, Jax, and Martin—traveled through time dealing with \"aberrations\" in history. They learned that a nuclear bomb would be detonated in New York City in 1942. The team discovered Damien Darhk, working with the Nazis, was behind the attack. Sara attempted to kill Darhk to prevent Laurel's death, but Darhk escaped and launched his sole atomic bomb toward New York from a U-boat. Rip chose to scatter the team throughout time, except for the injured Mick, to save their lives while he intercepted the bomb with the Waverider and saved New York. In the present, Mick and Nate use the Waverider to travel through time and rescue everyone, but fail to find any trace of Rip. After fixing events in 1942 to prevent the Nazis from making a nuclear bomb, the team is confronted by the Justice Society of America (JSA). Meanwhile, Darhk is shown to be working with Eobard Thawne.",
    "title": "Out of Time",
    "episode": "E01",
    "season": "S02"
  },
  {
    "description": "\nThe JSA captures the team, believing them to be Nazi spies. Nate reveals that he is the grandson of JSA member Commander Steel. After the JSA is assigned a mission to obtain information on Nazi captain Baron Krieger, they release the team and advise them to leave 1942. The JSA learns that Krieger intends to trade away an amulet in Adolf Hitler's possession; his trade partner turns out to be Eobard, who has given him a sample of the serum with which he intends to barter. Nate soon discovers that the JSA dies on this mission, so the team returns to rescue them. While the teams collect the amulet and fight the Nazis, Krieger uses the serum on himself and turns into a monstrous superhuman. Krieger captures Ray and Amaya. Ray offers to replicate the formula to save Amaya. The teams are able to rescue Ray and Amaya, and defeat Krieger. However, Nate, a hemophiliac, is injured in the fighting. He is saved with a modified version of the serum created by Ray. Before the team departs, Eobard infiltrates JSA headquarters and stabs Rex Tyler with his vibrating hand before stealing the amulet. A dying Rex whispers \"time traveler\" to Amaya.",
    "title": "The Justice Society of America",
    "episode": "E02",
    "season": ""
  },
  {
    "description": "\nAmaya stows away on the Waverider and attacks Mick, believing him responsible for Rex's death. Nate stops her using his newly-developed ability to convert his body to a steel-like form. Sara convinces Amaya that a rogue time traveler is likely to blame for the murder. An accident during Ray's testing of Nate's abilities throws both men into the time vortex and strands them in 17th-century feudal Japan. Nate is found and cared for by Masako Yamashiro, the betrothed of shogun Tokugawa Iemitsu whose samurai capture Ray. Sara, Amaya, and Mick rescue Ray from Tokugawa, who uses the Atom suit against them. They meet up with a recovered Nate, who does not want to leave Masako to Tokugawa's mercy. They defend Masako's village from the samurai, while Ray and Nate defeat Tokugawa by destroying the Atom suit. Nate and Amaya officially join the team. Meanwhile, Jax and Stein discover a hidden armory inside the ship and a secret message from Barry Allen from 2056 intended for Rip and forbidden from the crew.",
    "title": "Shogun",
    "episode": "E03",
    "season": ""
  },
  {
    "description": "\nThe team learns of a time pirate stranded in the American Civil War. Upon arriving, they encounter a black man, Henry Scott, being chased by Confederate soldiers that have been turned into zombies by a virus carried by the pirate. The team defeats the group of zombies, but Henry is killed. Before his death, Henry reveals he is a Union spy assigned to steal Confederate battle plans for General Grant and asks Jax to complete his mission. The team discovers that Mick is infected with the virus and returns him to the Waverider, where Ray and Martin ultimately manage to cure him. Sara and Nate go to warn Grant about the zombies while Jax and Amaya attempt to steal the plans. Jax runs afoul of a plantation owner and is locked up. Amaya frees him and the other black prisoners. They find the plans and burn down the mansion during a zombie attack. Meanwhile, Grant's camp is also attacked by zombies. Sara formulates a successful plan to kill them using Nate's powers. Jax, posing as Henry Scott, gives the plans to Grant, which will ensure a Union battle victory. A grateful Mick gives Leonard Snart's cold gun to Ray.",
    "title": "Abominations",
    "episode": "E04",
    "season": ""
  },
  {
    "description": "\nIn 1987, Eobard Thawne offers Damien Darhk an alliance, which Darhk declines. Aboard the Waverider, Nate discovers an aberration in 1987 involving the INF Treaty signing. The team infiltrates the White House as tourists and finds Darhk there as one of the treaty negotiators. Sara again attempts to kill him, which alerts White House security and forces the team to make a very public escape. They soon learn that Darhk is making his own secret deal with the KGB. Returning to the White House during a state dinner, they discover him and H.I.V.E. making an exchange with KGB agents for a box with an unknown item. The team defeats the H.I.V.E soldiers and the Russians. Sara confronts Darhk, but spares his life. Instead, she reveals his future to torture him: his master plan's failure, his wife's murder, and his own eventual death. Eobard whisks Darhk away, but not before Sara steals the box from him. She realizes the team is up against a time-traveling speedster. Unnerved by Sara's revelation, Darhk insists on teaming up with Eobard and the two enter the time stream.",
    "title": "Compromised",
    "episode": "E05",
    "season": ""
  },
  {
    "description": "\nThe team learns of an aberration in Colorado, 1874, where they save Jonah Hex from execution. He reveals that he is fighting an outlaw boss named Quentin Turnbull. Nate reveals that the aberration is Turnbull leading the Western US in its secession to form \"Turnbull Country\". The team learns that Turnbull is extracting dwarf star, which Ray used for his A.T.O.M. suit, and that Turnbull is planning to destroy a critical mountain pass connecting the Eastern US to the West, stopping the US Army from supplying the West. While Sara and Jonah engage Turnbull, Mick and Amaya destroy the mine and Nate uses his powers to stop the train. Instead of killing Turnbull, Jonah decides to deliver him to the authorities. With the dwarf star reappropriated, Ray plans to rebuild his suit and shows Nate the suit he has made for the latter. Amaya decides to teach Mick to control his anger. Martin and Jax deduce that, due to the former's interaction with his past self, he may have altered the past. Sara tells the team that they need to return to 2016 to help their friends.",
    "title": "Outlaw Country",
    "episode": "E06",
    "season": ""
  },
  {
    "description": "\nNate, Mick, Amaya, Felicity, and Cisco travel back to the first Dominator invasion of Earth in Redmond, Oregon, 1951. The Legends successfully capture a Dominator for information, but are themselves captured by the MIB as well as the Dominator. While in custody, they learn from the Dominator that the aliens arrived to assess the threat humanity posed now that metahumans had appeared. Felicity and Cisco rescue the Legends and help set the Dominator free. Meanwhile in Central City 2016, the team learns that the Dominators know about Barry's manipulation of the timeline and that they demand his surrender in exchange for peace. After the Legends return, the team discovers that the Dominators' weapon is a bomb that will kill all metahumans on Earth with millions of collateral human casualties. The team dissuades Barry from surrendering and Cisco reconciles with him. They manage to destroy the bomb and force the Dominators to retreat using pain-inflicting nanotechnology. Cisco gives Supergirl a device to travel between their universes. Martin convinces Jax not to tell the others that his daughter, Lily, is an aberration of the timeline.\n\n\nThis episode concludes a crossover event that begins on The Flash season 3 episode 8, and continues on Arrow season 5 episode 8.",
    "title": "Invasion!",
    "episode": "E07",
    "season": ""
  },
  {
    "description": "\nEobard, Darhk and Malcolm Merlyn arrive in Chicago, 1927, and ally with Al Capone and his empire. Learning of the aberration, the Legends arrive and manage to keep Capone from murdering Eliot Ness. Ness is critically injured, so the team decides to obtain vital information on Capone's operation to secure history. Meanwhile, Mick begins having hallucinations of Snart, who belittles him for acting like his teammates. Sara and Martin are abducted by Eobard during their infiltration and raid on Capone's club. Malcolm offers Sara a chance to change her past in return for the amulet she took from Darhk in 1987, but she refuses. The team rescues the captives, but \"Martin\" turns out to be a disguised Eobard, who searches the Waverider at super-speed for the amulet while Malcolm and Capone's men attack the ship directly. Eobard barely escapes revenge at Amaya's hand, but Sara surrenders the amulet for Martin's safety. The Legends succeed in correcting the timeline. Eobard later shows his partners that the completed amulet projects a holographic map that can locate the Spear of Destiny, which is able to \"rewrite reality itself\". They must next locate Rip Hunter, who is revealed to be working as a movie director in 1967 Los Angeles.",
    "title": "The Chicago Way",
    "episode": "E08",
    "season": ""
  },
  {
    "description": "\nDuring the New York attack, Rip recovered the Spear of Destiny from the Waverider and used the time drive to escape. In the present, the team learns about the spear and arrives in Los Angeles, 1967, where they find Darhk and Malcolm attempting to kidnap Rip, who has no memories of his previous adventures and is filming with George Lucas. Both parties escape and Rip is arrested by the police as they believe he started the fight. The team springs him from custody and takes him to the Waverider. Nate and Ray are revealed to have lost their specialities and powers since the aberration caused Lucas to quit filmmaking. While Nate, Amaya, and Ray meet Lucas to dissuade him from dropping out of school, the others learn that Lucas had a fragment of the spear. Darhk and Malcolm overpower Amaya's party and force them to search for the fragment in a dumpster. The others arrive and a battle ensues during which they recover the fragment and the Medallion. Rip, however, is abducted by Eobard and threatened with torture by Malcolm and Darhk. Lucas returns to filmmaking and the team vows to rescue Rip. Meanwhile, Mick tells Stein about his hallucinations, but the latter eventually interprets them to be emotional, not neural.",
    "title": "Raiders of the Lost Art",
    "episode": "E09",
    "season": ""
  },
  {
    "description": "\nIn Star City 2016, Eobard and Damien recruit Malcolm just hours after the 2016 Damien is killed by Oliver. The Legion's attempts to extract information from Rip fail repeatedly, exacerbating tensions within the group. Eobard disappears after insisting on his superiority, assigning Malcolm and Damien to access Rip's bank safe deposit box in Switzerland 2025, the number of which Damien found engraved on Rip's tooth. Meanwhile, Martin recruits Lily to help the team decode the amulet. She finds out that she is an aberration and gets angry with Martin. After a failed robbery, Malcolm and Damien decide to work together against Eobard. The Legends realize that the mystery speedster is Eobard and that he needs the spear to undo his removal from existence. Damien and Malcolm break into the bank vault, finding a record of Rip's memories. They force Eobard to tell the truth about his disappearances. He reveals that Hunter Zolomon, now the undead speedster Black Flash, has been chasing him since Flashpoint. They manage to trap the pursuing speedster in the vault and escape, with Eobard agreeing to treat the duo as his equals. Lily returns home after she and Martin reconcile, while the Legion restores Rip's memories, albeit with \"adjustments\". In New Jersey on Christmas Day 1776, Rip kills George Washington.",
    "title": "The Legion of Doom",
    "episode": "E10",
    "season": ""
  },
  {
    "description": "\nRip has been brainwashed into working for the Legion. The Legends, who feel the subsequent timequake, head to Christmas Eve 1776, to protect Washington. As Sara and Mick escort Washington to safety, Rip arrives with British troops who have been armed with modern-day assault rifles. Rip disables the team's technology and shoots Sara in the chest, opting to take Mick and Washington prisoner. Rip then heads to the Waverider with British soldiers to retrieve the Legends' piece of the spear. The team takes out the British. Jax holds off Rip while a shrunken Ray works to fix the Waverider. Amaya and Nate share a tender moment in the wilderness and are attacked by Hessians though they manage to defeat them.. After Mick hears that Washington will be executed in the morning, he formulates an escape plan and teaches the General what it means to be an American. Rip uses Sara's life as leverage to get Jax to give him the spear fragment before strangling her anyway. The Waverider's power is restored and Sara is revived in time to stop an enraged Jax from murdering Rip. Nate and Amaya save Mick and Washington, who goes on to lead his soldiers to victory in the American Revolution. Amaya tells Nate they should remain friends and the team celebrates Christmas on the Waverider.",
    "title": "Turncoat",
    "episode": "E11",
    "season": ""
  },
  {
    "description": "\nRip finds former JSA member Dr. Mid-Nite in Detroit, 3000, killing him and taking his spear fragment. Gideon locates the next fragment in Medieval England, 507 A.D., the age of King Arthur. Amaya recognizes Merlin as Stargirl, her former comrade in the JSA. She explains that Hunter joined the JSA on their final mission to secure the spear. He divided it into four pieces for more safety. The Legion abducts Arthur and controls his mind using a device taken from 3000 in order to enter Camelot, threatening to destroy it unless the spear is brought to them. Sara persuades Guinevere to help them fight back while Amaya convinces Stargirl, who is in love with Arthur, to entrust her with the fragment. Upon learning that Ray has joined Guinevere's army, the team devises a plan to reverse the effects of the device and Arthur subdues Rip. Ray engages Damien and gets shot, but survives due to his suit's armor. In the changed history, Ray is revealed to have become a knight. Imprisoned in the brig, Rip contacts Gideon, whose programming maintains loyalty to him.",
    "title": "Camelot/3000",
    "episode": "E12",
    "season": ""
  },
  {
    "description": "\nRip issues an override order to Gideon to activate the Waverider's self-destruct sequence, but the team manages to reboot Gideon and stop it. They crash land in the Cretaceous period and Ray, Amaya, and Nate venture out to recover a lost timeship part. Mick suggests using a Time Master method of mental programming to travel inside Rip's mind and discover the location of Commander Steel and the final piece of the spear. Sara and Jax travel inside Rip's mind, encountering Savage's men, evil versions of themselves, Gideon in human form, and a trapped Rip. Ray, Nate, and Amaya retrieve the missing part with Amaya using her abilities to stop a dinosaur from attacking them. Nate and Amaya start to develop mutual feelings, but Ray advises against this, reminding Nate that Amaya's granddaughter will eventually inherit her abilities. Sara, Jax, and Gideon free Rip's consciousness before Sara and Jax return to reality. Rip shares a kiss with the human Gideon before returning to reality and resuming his role as Captain, informing the team that he does know the location of Commander Steel and the last piece of the spear. Meanwhile in 1970, Jack Swigert, Apollo 13's Command Module Pilot, has a meeting with a doctor revealed to be Eobard Thawne.",
    "title": "Land of the Lost",
    "episode": "E13",
    "season": ""
  },
  {
    "description": "\nThe Legends head to NASA in 1970, where Henry Heywood works as a consultant. Henry reveals that he hid his spear fragment in the flag left by Apollo 11 on the moon and that the Apollo 13 mission is going exactly as planned. Thawne, posing as Jack Swigert, incapacitates the other astronauts. Ray boards the Apollo command module and restrains Thawne before retrieving the spear fragment. The Waverider is damaged when Sara uses the ship to shield the Apollo craft from meteors, stranding Ray on the moon. Ray and Thawne launch themselves off the moon and are caught by the Waverider. The team return to Earth intact after Henry sacrifices himself by opening one of the Waverider's outer hatches, being sucked outside the ship. Nate, disappointed that he wasn't able to create a potentially better life for his family, passes on a message from Henry to his teenage father. Sara and Rip seem to clash over how to captain the ship, but eventually reach an understanding. Amaya asks Gideon to show her the fate of her village and her family, revealing the destruction of her village and existence of her granddaughter Mari, the present-day Vixen.",
    "title": "Moonshot",
    "episode": "E14",
    "season": ""
  },
  {
    "description": "\nThe Legends steal the remaining spear fragment. Upon it becoming whole again, the spear's writings reveal it can be destroyed by the blood of Jesus Christ. Rip prevents the Waverider from traveling to the Crucifixion, warning that going back to such a significant event is too risky. Nate reveals that J. R. R. Tolkien researched Sir Gawain, who supposedly possessed some of Christ's blood. They find Tolkien at the Battle of the Somme. Tolkien takes the Legends to a grave, where they are attacked by Darhk and a past version of Snart, who has been recruited to the Legion. Tolkien acquires a map before escaping with the others. Amaya, tempted by the Spear's power, suggests using the spear to erase the Legion from reality, but the idea is rejected. Using the map and the spear, the blood is tracked to no man's land. Rip creates a temporary ceasefire, during which the Legends acquire the blood. They are confronted by Darhk and Snart, who convince Mick to give them the spear and join the Legion. Snart retriggers the battle, allowing for their escape and the destruction of the blood. The Legends manage to escape back to the Waverider and discuss the possibility that the Legion may not know how to use the Spear. Malcolm returns to the Legion with the Kalebros Manuscript which they must use to activate the spear.",
    "title": "Fellowship of the Spear",
    "episode": "E15",
    "season": ""
  },
  {
    "description": "\nIn the new reality, Thawne is the CEO of S.T.A.R. Labs and has captured the Black Flash, Darhk is the corrupt mayor of Star City, Merlyn gets his hand back and his family is alive, and Snart and Rory control Central City but still answer to Thawne as their superior. Ray, Stein, and Jax work in S.T.A.R. Labs where Jax abuses Stein. Sara and Amaya work as Darhk's enforcers and Nate is a conspiracy theorist. A depressed Rip is held prisoner onboard the Waverider by Thawne and is the only member of the Legends unaffected by the changes to the timeline. Mick, unsatisfied with this reality, takes Nate to re-assemble the Legends, using a gun Ray created to restore the Legends’ memories. Stein, in an effort to stand up to Jax, breaks the gun after the latter attempts to use it on him. The Legends attempt to reclaim the Spear before Thawne can use Stein's incinerator to destroy it, cementing the new reality. Darhk, Merlyn, and Snart ally against Thawne to take the Spear for themselves. In the ensuing fight, Amaya is killed by Snart while attempting to restore reality. Thawne destroys the Spear, trapping everyone in his reality. The Legends decide to stop the Legion by travelling to 1916 and taking the Spear before the Legion does. At S.T.A.R. Labs, Rip and the Waverider are shown to be miniaturized on Thawne's desk.",
    "title": "Doomworld",
    "episode": "E16",
    "season": ""
  },
  {
    "description": "\nThe Legends regain contact with Rip and the Waverider, which Ray de-miniaturizes. The team returns to 1916 to steal the Spear before the Legion can use it. Thawne arrives from the altered reality. He destroys the blood of Christ, kills \"future Ray,\" and informs the past Legion members about the future Legends. The Legends end up interacting with their past selves. The resulting time storm prevents the use of the past Waverider to escape. Shortly after, they are ambushed by Merlyn, Darhk, and Snart. During the subsequent battle, the future Legends are killed by the Legion except Sara and Rip, while the Legion is incapacitated by the past Legends. Thawne arrives with numerous time remnants of himself to fight the team, killing future Rip. Sara takes the Spear and consults a manifestation of Laurel. Eobard steals and attempts to use the Spear, only to learn Sara depowered the Spear and released the Black Flash. Eobard is erased from existence, along with the Spear of Destiny, while future Sara fades from existence. Nate convinces Amaya to stay, while Rip leaves the team. The Legends leave the Legion in their respective places throughout the timeline and, at Mick's request, set off for Aruba. However, they arrive in Los Angeles, with dinosaurs in the streets and buildings present from other points of history.",
    "title": "Aruba",
    "episode": "E17",
    "season": ""
  },
  {
    "description": "\nIn the altered Los Angeles, the Legends encounter Rip, who reveals that he has created the \"Time Bureau\" to replace the Time Masters' Council. Bureau agents fix the \"anachronisms\" and Rip disbands the Legends. Six months later, the Legends are living normal lives, nostalgic for their previous adventures. In Aruba, Mick captures Julius Caesar and informs Sara, who takes Ray and Nate on a quest to prove their worth to the Bureau. After delivering the wrong man and being dismissed by Rip, the Legends, joined by Jax and a reluctant Stein, steal the Waverider and capture the real Caesar. When Rip demands they deliver Caesar to the Bureau and let the Bureau fix the anachronism, the Legends choose to return Caesar to 49 BC themselves. During the return, Caesar steals Nate's history book and uses this knowledge to conquer the world. The Bureau arrives and seizes control of the operation. During an excursion to retrieve the book, Agent Sharpe is captured, forcing Rip to allow the Legends to fix the anachronism. Later, Rip tells Sharpe that the Legends could be useful in neutralizing \"Mallus.\" In 1942 Zambesi, Amaya, with significantly improved powers, attacks a group of poachers.",
    "title": "Aruba-Con",
    "episode": "E01",
    "season": "S03"
  },
  {
    "description": "\nSix months ago, Amaya learnt of Mari's vigilantism and suddenly left Nate. In the present, the Legends head to a petty anachronism in 1870 Wisconsin, when they come across a circus fronted by P.T. Barnum, who has captured an extinct sabertooth tiger. Ray's shrinking device malfunctions, leading to the enlargement and escape of the sabertooth. Sara visits Amaya and convinces her to return, much to Nate's displeasure. While Nate, Ray, and Jax visit an inn, Amaya and Sara shrink and capture the sabertooth. Intoxicated due to his depression over his relationship with Amaya, Nate tells Barnum about their powers. Intending to use them for his shows, Barnum captures Ray and Jax while Nate informs the Legends. Amaya tells him that she had to leave 2017 in order to preserve Mari's existence. While Sara engages with Sharpe on the Waverider, the Legends attack the show and rescue their teammates, removing the anachronism. Nate reconciles with Amaya, who tells the Legends that she has begun to lose control of her animal powers, resulting in psychopathic behavior. Sara tells the Legends about the Mallus threat, which they do not take seriously considering their previous accomplishments. A follower of Mallus summons Kuasa, Mari's sister.",
    "title": "Freakshow",
    "episode": "E02",
    "season": ""
  },
  {
    "description": "\nIn Seattle, 2042, Time Bureau Agent Gary discovers hydrokinetic assassin Kuasa pursuing Zari, a hacktivist, and sends a distress signal. The Legends receive it and find Seattle under martial law imposed by A.R.G.U.S., which is hunting down metahumans. They find Zari, who demands help in rescuing her brother from prison in exchange for finding Kuasa. Amaya is uncertain about her powers, so Stein and Nate seek a solution, with Nate synthesizing a Zambesi hallucinogen. She uses it to have a vision with an ancestor, who advises her to trust the increasing strength. While Jax initiates an unplanned prison break, Zari retrieves her brother's amulet, admitting his murder by A.R.G.U.S., and ditches the team. Ray pursues her to a campsite where her family was to rendezvous. Kuasa attacks the duo while Sharpe pursues the Waverider in the timestream. The Legends arrive and Amaya, now in control of her powers, defeats Kuasa, who vanishes using a mystical item and implies she is a descendant of hers. Sharpe warns Sara that, if the Legends are arrested, they would be banished to the \"dawn of time.\" Amaya decides to stay and recruits Zari to the team. In 1988, a young Ray encounters an unknown creature.",
    "title": "Zari",
    "episode": "E03",
    "season": ""
  },
  {
    "description": "\nRay suddenly disappears from the Waverider and Gideon reveals that he died around Halloween of 1988. The Legends travel to 1988, when Ray reappears and finds his younger self has adopted a baby Dominator. Eventually, N.S.A. agents take the baby Dominator, leading Ray, young Ray, and Zari to break in and rescue it while Sara, Nate, and Amaya discover the Dominator's mother has returned to retrieve her child. The baby uses mind control to distract the agents and the Legends get it back to its mother, who leaves in peace. When young Ray gets picked on by bullies on Halloween, the Legends show up and defend him. Meanwhile, Jax and Mick learn that Stein is anxious to be present for the birth of his grandchild and help him with it, \"borrowing\" the Waverider. Later, Jax asks Ray to help him figure out a way to split Firestorm so that Stein may have a normal life.",
    "title": "Phone Home",
    "episode": "E04",
    "season": ""
  },
  {
    "description": "\nNate discovers a pattern to the anachronisms, with two \"outliers\": Kuasa's attack and a suspected vampire attack in Victorian London. The Legends arrive and meet up with Rip, who is investigating a conspiracy involving Mallus, an ancient archenemy of the Time Masters; he believes that the outlying anachronisms are examples of Mallus' work. They discover Darhk's body – which apparently fell through a temporal rift into this time period – and Zari encounters a follower of Mallus, Madame Eleanor, who steals her amulet while working with a Victorian occult society that includes Stein's ancestor, Sir Henry Stein, among its members. Rip traps the Legends aboard the Waverider to protect them before attending Darhk's resurrection, which Eleanor achieves using the amulet. The Legends arrive and engage Darhk and Eleanor, but they escape. Sara reports Rip to the Bureau and they promptly arrest him in exchange for re-legitimizing the Legends. Rip warns Sara about Mallus' importance. Meanwhile, Jax has Ray attempt to sever his psychic connection with Stein as a precursor to breaking their physical link as Firestorm, but suffers a side effect of short-term memory loss. Stein finds out and eventually decides to help them.",
    "title": "Return of the Mack",
    "episode": "E05",
    "season": ""
  },
  {
    "description": "\nMartin, Jax and Ray attempt to transfer Firestorm to Jax. It fails and causes a body swap. The Legends track an anachronism to 1937 Hollywood, revealed to be Helen of Troy. While attempting to extract Helen at a party, the team encounter Darhk, Eleanor, and Kuasa. Darhk tells Sara that he will spare the Legends' lives if they cease time travel. Meanwhile, Stein meets Hedy Lamarr and the other male Legends start a fight over Helen. The female Legends privately confront Helen. She refuses to return to Troy, citing the misery of men dying over her. The female Legends eventually obtain Helen. The Waverider breaks down. Lamarr's switch from actress to operator means she no longer invents FHSS. To fix this, Stein goes to Lamarr's workplace which results in a confrontation with Darhk. Amaya and Zari guard the Waverider while the remaining Legends assist Stein. Sara duels Dahrk while the remaining Legends are beaten by Eleanor. Lamarr tells Jax and Stein to merge which will allow them to return to their bodies. Firestorm defeats Darhk and Eleanor. On the ship, Amaya and Helen defeat Kuasa. The three retreat. A sympathetic Zari takes Helen to Themyscira instead of Troy.",
    "title": "Helen Hunt",
    "episode": "E06",
    "season": ""
  },
  {
    "description": "\nWith Sara still in a coma, the Legends choose to investigate creature attacks during the Vietnam War. Zari, Ray, and Amaya, posing as journalists, meet a woman who shows them the creature, revealed to be a time displaced Gorilla Grodd. Meanwhile, Nate and Mick are captured by a squad led by Mick's father, Dick Rory.[7] On the Waverider, Stein discusses how to separate Firestorm with Isaac Newton. Jax walks in on their discussion and learns that Firestorm can be separated, but it would depower Jax. The anachronism increases in intensity, revealing Grodd's plan to wipe out humanity by killing President Johnson and starting World War III. Jax, inspired by a powerless Sara's abilities, saves Johnson from a minefield. After failing to capture Grodd, Amaya uses her powers to negotiate with him, but is thwarted when Dick's squad attacks. Grodd decides to steal the Waverider and wipe humanity from the timeline. His attempt fails and he seemingly falls to his death. Back at Grodd's compound, Mick stops his father from massacring Grodd's prisoners and comes to terms with his relationship with his father. The team returns to the ship as Sara emerges from her coma. In 2017, Grodd is approached by Darhk.",
    "title": "Welcome to the Jungle",
    "episode": "E07",
    "season": ""
  },
  {
    "description": "\nOn Earth-X, Stein activates the temporal gateway's portal before succumbing to his injuries. Jax bonds with Stein to get him through the portal, along with Barry, Oliver, Sara, Alex, Ray Terrill, and Leo Snart (Leonard Snart's Earth-X doppelgänger). Members of all the teams face off against Earth-X Metallo, while Felicity and Kara are cornered by Dark Arrow before Oliver saves them. Jax is also affected by Stein's wounds; Stein severs their link and dies. Dark Arrow attempts to negotiate for Kara, but Oliver refuses and the team battles Dark Arrow's forces. Caitlin, Amaya, and Zari infiltrate the Nazis' timeship Wellenreiter to disable its shields so that Harry and Cisco can destroy it with the Waverider. Barry defeats Thawne, but allows him to escape, resuming their feud. Supergirl battles Overgirl, flying her into space to detonate away from the Earth when she goes nuclear. Oliver fights and kills Dark Arrow. Terrill returns to Earth-X, but Snart chooses to stay for the meantime and joins the Legends. The team holds a funeral for Stein. The Legends, Kara, and Alex depart back to their own lives. Barry and Iris are officially married by John Diggle, who also marries Oliver and Felicity.\n\n\nThis episode concludes a crossover event that begins on Supergirl season 3 episode 8 and Arrow season 6 episode 8, and continues on The Flash season 4 episode 8.",
    "title": "Crisis on Earth-X, Part 4",
    "episode": "E08",
    "season": ""
  },
  {
    "description": "\nThe team tracks down another anachronism, which turns out to be a young Martin Stein displaced in the time of the Vikings. Martin was buying a talking Beebo toy as a Hanukkah present for his daughter when he was displaced, causing the Vikings to believe that Beebo is the God of War. Damien Darhk shows up, worrying Sara, but the team eventually manages to set time right again. Jax attempts to tell young Stein of his future self's death, but Stein had already deduced it based on his counterpart's absence. Stein, not wanting to cheat death and aware that he has a wonderful future, decides not to learn the details of his impending death, accepting his fate and resolving to spend the years he has left dedicated to his loved ones. With the present Stein dead and his Firestorm powers gone, Jax chooses to leave the team, but not before an impromptu Christmas celebration. Sara and Jax part on good terms and Jax departs for new pastures. On returning to the Waverider, Sara is greeted by John Constantine, who claims that he needs her and her team's help with a demon who knows her name and is controlling a little girl.",
    "title": "Beebo the God of War",
    "episode": "E09",
    "season": ""
  },
  {
    "description": "\nJohn Constantine explains to the Legends about the demon, which Sara reveals to him is Mallus. While John insists they leave it to him, Sara proclaims that they are coming as well. The little girl is Damien Darhk's daughter Nora, and is being held in an insane asylum in 2017 and while they try and help Nora she is possessed by Mallus and sends the trio of Sara, John and Leo to 1969. While possessed by Mallus, Nora is revealed to have extraordinary abilities, prompting Sara to once again enter Mallus' realm to rescue Nora while trapped in 1969 and they try to recreate the symbol that Mallus created that sent them through time to successfully return home. Nora is promptly reclaimed by Damien Darhk, claiming she will soon be used for his full resurrection. With the demon dealt with, Constantine departs from the Waverider, thanking Sara for her help. Leonard also departs, thanking Mick for the adventure. Sara calls up Ava to compare notes, only to be told by Ava that Rip Hunter has escaped from the Time Bureau. Throughout this episode, Amaya tries to talk with Kuasa, but when Nate intervenes, a fight breaks out, which ends in her escape.",
    "title": "Daddy Darhkest",
    "episode": "E10",
    "season": ""
  },
  {
    "description": "\nA mission goes wrong, causing the crew to yell at each other. Zari attempts to repair the ship, but gets covered in goo and seemingly activates a program that blows up the Waverider, before seemingly re-experiencing events from earlier that day. The day seemingly keeps repeating, with Zari experiencing the same events over and over, learning mysterious secrets about the team, such as Mick's writing ability. Eventually, the team discover Time Agent Gary on board, who has been causing the repetitions. Mick destroys Gary's device, but Gary tells them the repeats were the only thing saving them from death. When the ship is next set to explode, Zari seals herself in the study and uses her powers to try and contain the blast. She reappears in an empty Waverider, where she encounters Gideon's human form, who reassures her that she's in the med bay and alive. She tells Zari that she transported her into her program to show her she can't save 2042 without the Legends. Zari admits to Sara that she was researching historical loop holes to see if she could save her brother, which Sara reassures her might be possible. In Yunnan Province, China, the recently escaped Rip Hunter tracks down Wally West.",
    "title": "Here I Go Again",
    "episode": "E11",
    "season": ""
  },
  {
    "description": "\nThe team reviews the list of totems and decides to find the Fire Totem first; however, Damien Darhk retrieves it first, making it a tie where each side has two totems. Sara goes on a date with Ava. While she is away, the team takes the Waverider to 1700s Bahamas, landing in the Bermuda Triangle. There they encounter a pirate crew, led by Edward Teach, which includes Darhk, who steals Amaya's totem. After learning of the team's trouble, Sara abandons her date with Ava to help them. The Waverider is attacked by cannonballs and boarded by Blackbeard and his crew, though Ava comes to help Sara fight them off. Most of the team escapes; however, Ray wracked with guilt, returns in hopes of making up a wrong he did towards Nora Darhk, in exchange for Amaya's totem. Ray is captured by the Darhks. Wally helps Rip neutralize a Time Agent, and gets Rip's trench coat back from the Time Bureau. The two get drunk and sing karaoke in 1992. Rip tells Wally that maybe it's time he went out to seek adventure.",
    "title": "The Curse of the Earth Totem",
    "episode": "E12",
    "season": ""
  },
  {
    "description": "\nDamien instructs Nora and a hostage Ray to travel to 1962 Berlin to retrieve information about cold fusion, which can be used to fix the Fire Totem. Rip brings Wally to the Legends, and they try to work out their next move. Nora corrupts Amaya's totem, and the Legends learn that the Darhks are creating anachronisms to weaken Mallus' cage to eventually free him into the world. Damien saves Nora from his younger self, and she gains control over the totem. When cornered by Nora, Ray blasts a hole in the Berlin Wall, causing another anachronism, allowing the Legends to locate him. Wally rescues Ray and takes the Fire Totem. Director Bennett is murdered by Grodd, making Ava the senior officer at the Time Bureau, allowing Rip to return to work. Wally intends to go with Rip and Ava, but Sara convinces him to stay with the Legends, which Rip congratulates him on. Before leaving, Rip instructs Gideon to delete Ava's file, claiming Sara must never know Ava's secret. Mallus gains control over Nora behind Damien's back.",
    "title": "No Country for Old Dads",
    "episode": "E13",
    "season": ""
  },
  {
    "description": "\nWally moves into the Waverider, and proceeds to annoy everyone with his superspeed. The team soon discover differences aboard the ship, such as Nate's hair, Mick's rat's name and Zari's game. Tracking the anachronism, they find that mass panic was caused in Memphis in 1954, during a performance by Elvis Presley. Once there, they discover that Presley's guitar contains the final totem, the Death Totem. Things start to go wrong, when Presley admits he might be considering quitting music after the death of his brother. The team bring the guitar back to the Waverider, but start seeing a ghostly presence. Eventually, they are able to secure the Death Totem, and convince Elvis to continue pursuing music. Amaya plays Nate some music from Zambesi. The sealed box containing the Death Totem seems to shake.",
    "title": "Amazing Grace",
    "episode": "E14",
    "season": ""
  },
  {
    "description": "\nSara is enticed to open the box and wear the Death Totem, her body once again falling under the control of Mallus, while her mind is trapped in his realm, with a vision of Nora. The team try to fight her off, but her new mystical abilities prove difficult to contain. Upon learning of Sara's situation, Ava and Gary track down John Constantine to try and help. Meanwhile, one by one the legends try to stop Sara, but are each taken out, leaving Nate, Amaya, and Rory to stop her. While in Mallus’ domain, Sara sees visions of what made her the woman she is at the same time as Nora tries to convince her to join Mallus. Nate tries to get to the Earth Totem to use it, but is confronted by Sara, and defeated. Learning that Sara is using the Death Totem, John attempts to enter Mallus' realm, but Mallus blocks him. Mallus tries to trick John into sacrificing Sara to save the little girl Astra, but John sees through the ruse. Amaya convinces Mick to wield the Fire Totem, which is enough to stun Sara, allowing Constantine and Ava to release her from Mallus' control. Fearing that she might hurt Ava, Sara breaks up with her in order to protect her.",
    "title": "Necromancing the Stone",
    "episode": "E15",
    "season": ""
  },
  {
    "description": "\nSara contemplates leaving the team after her breakup with Ava, only to find out from Gary that Ava hasn't been to work in a few days. Sara, Ray and Gary travel to Ava's home, only to find that Ava's parents are actors, paid to play a constant role. The three travel to 2213, where they find Ava is actually a clone mass produced by a conglomerate. The three are apprehended by multiple Ava clones, but are saved by the original Ava. Zari teaches Mick to use the Fire Totem. Amaya, with a temporary truce with Kuasa, manages to reclaim her totem, but Nate is captured and \"tortured\" by Damien Darhk. However, it is revealed that Darhk misses how his little girl used to be before Mallus. He is later caught by his daughter faking the torture.  Amaya, Wally and Kuasa rescue Nate and confront Nora, but Nora rips the Water Totem out of Kuasa, killing her. Driven by grief and guilt, Amaya goes back to 1992 Zambesi to change her family's fate. Ava and Sara realize Rip deleted Ava's file from the Bureau and decide to find out why.",
    "title": "I, Ava",
    "episode": "E16",
    "season": ""
  },
  {
    "description": "\nThe Legends stop Gorilla Grodd from killing future president Barack Obama in the 1980s, preventing another anachronism and further delaying Mallus's release. Damien realizes that Nora will be killed when Mallus is released from his prison, causing him to temporarily ally himself with the Legends. By getting actor John Noble to impersonate the voice of Mallus, the team tricks Nora onto the Waverider and contains her. Ava asks Rip if he knew that she was a clone; Rip reveals that she is the 12th Ava clone he has recruited, because she is such a talented agent. Amaya returns to 1992 Zambesi to change history and secure her family's future. Nate, rather than try to convince her to return, elects to help her instead. Sara decides to allow this to happen, causing the final anachronism that will free Mallus, having concluded that the only way to stop the demon is to release him. She gives Damien the Death Totem, while the rest of the team chooses to wield their own individual totems. Damien realizes that Nora is still alive within Mallus and releases Grodd to destroy Zambesi, preventing Mallus' release. Nate subdues Grodd with the Earth Totem. Mallus breaks free from his prison, revealing his frightening true form.",
    "title": "Guest Starring John Noble",
    "episode": "E17",
    "season": ""
  },
  {
    "description": "\nMallus demands the Legends hand over the six totems. Rip sacrifices himself to allow the team to get away, fleeing to the town of Salvation in the Old West. An army of Romans, Vikings, and pirates soon arrives, threatening to destroy the town unless the Legends surrender the totems. Ray and Damien travel to when Mallus was released from Nora; Damien frees Nora from Mallus' hold, causing Mallus to possess and kill Damien in order to be released. Back in the Old West, the Legends ally with Jonah Hex, along with Helen of Troy, Jax, Nora, and an alternate Kuasa. The team saves the town from the army. Mallus arrives for the totems; Sara, Mick, Amaya, Nate, Zari, and Wally combine the totems' energies to create the ultimate warrior: an enlarged Beebo. Beebo battles and kills Mallus. In the aftermath, Nora is arrested by the Time Bureau, but Ray gives her the Time Stone so that she can escape. Amaya returns to Zambesi in order to live her life, but chooses not to wipe her memories. The Legends' vacation in 2018 Aruba is interrupted when John Constantine arrives, revealing that Mallus was not the only demon that was released.",
    "title": "The Good, the Bad, and the Cuddly",
    "episode": "E18",
    "season": ""
  },
  {
    "description": "\nThe Legends and the Time Bureau celebrate a job well done, with Zari chastising Ray for allowing Nora Darhk to escape. Ava and Sara rekindle their relationship together. John Constantine tries to warn Sara about the darkness coming, but Sara dismisses him claiming that they have searched the timeline and nothing is out of place for five months. The Legends end up at Woodstock where they see an unicorn impale someone and eat their heart. It then releases magical goo at Mick, Ray, Nate, and Zari, making them hallucinate. Realizing he was right, Sara locates Constantine and informs him of the situation, and they make a counter-drug against the unicorn's goo and cure the affected Legends. The unicorn will feast on the flesh of a virgin, so Constantine and the Legends use Time Bureau member Gary as bait to lure the unicorn before Constantine uses a spell to send the unicorn to hell. Meanwhile, Nate and Rory go an adventure leading to Nate attempting to reconnect with his distant father. Back at his accommodation, Constantine experiences a dark form of magic throwing him about the place, before it writes in blood that it is coming for him.",
    "title": "The Virgin Gary",
    "episode": "E01",
    "season": "S04"
  },
  {
    "description": "\nThe Legends wire up the magical detection bones into the Waverider to allow them to track magical fugitives. Constantine joins the Legends as a magical consultant, with their first mission leading them to the Salem Witch Trials. When an innocent woman is accused of witchcraft, her daughter's Fairy Godmother attacks the townsfolk. Zari fights to save the mother, who was executed in the original history, while Constantine and the Legends try to separate the daughter and the Fairy Godmother so Constantine can banish her to hell. However, the Fairy Godmother turns Ray and Mick into pigs and seals Constantine's mouth shut, but when the daughter releases her, the Legends return to normal. Once they succeed, Constantine offers the Fairy Godmother the chance to be her new magical conduit, but she refuses, knowing what's in store for him, so he sends her to hell instead. Nate discovers his father is overseeing the committee that funds the Time Bureau and struggles to prove that magic is real so the Bureau will stay funded and open. He is able to do so when Ray turns back to normal in his arms. Ava offers Nate a place at the Bureau and Nate accepts.",
    "title": "Witch Hunt",
    "episode": "E02",
    "season": ""
  },
  {
    "description": "\nThe team track another magical fugitive to London, with a new punk rock band favored by the queen, called \"The Smell.\" Constantine hypothesizes that the fugitive is a leprechaun, and is posing as a member of the band. The team attempt to scope out The Smell, with Ray earning their trust by stealing one of the Queen's prized corgis, and discovers that instead of a leprechaun the fugitive turns out to be a shapeshifter and the band's lead singer Charlie. Fearing imprisonment, Charlie knocks Ray unconscious (despite him preparing to defend her) and steals his A.T.O.M. suit, using it to try and kill Sara, Zari, Mick, and Constantine when they attempt to catch her and banish her to hell. Eventually, Ray wakes up and saves the group by dismembering his suit via voice activation, and Charlie is caught. However as Constantine attempts to banish her, she shapeshifts to resemble each of them and ending with Amaya while calling them out for not acting like heroes, causing Zari to feel sympathy for it. Out of annoyance, Constantine casts a spell that renders Charlie unable to shapeshift ever again, leaving her trapped in Amaya's form. They decide to keep her as prisoner on board the Waverider.",
    "title": "Dancing Queen",
    "episode": "E03",
    "season": ""
  },
  {
    "description": "\nAva briefly joins the team to help with an investigation into kids disappearing at a summer camp in 1995. The team pose as camp councilors, while they track down a swamp creature that has been kidnapping the kids. Ava and Sara take a potion that turns them into children in an attempt to lure the creature out. Charlie attempts to escape the Waverider, but is stopped and comforted by Mick. The team are able to locate the monster, known as a Shtriga, and its victims. John uses a spell to banish the Shtriga, but one of the kids remains unresponsive. John uses another spell to heal the child, and he is revived, though John is injured. Ray and John are subsequently rescued by the campers. Charlie agrees to help the Legends, officially joining the team, on the condition that they do not lock her up again. Gideon cannot save Constantine, but Ray claims to know someone who might be able to. Nora Darhk is revealed to be working at a Renaissance Fair.",
    "title": "Wet Hot American Bummer",
    "episode": "E04",
    "season": ""
  },
  {
    "description": "\nWith Constantine still injured, Sara has Gideon look for Nora Darhk in 2018, with Gideon quickly finding a match. Ray goes to find her at a Renaissance Fair, to ask for her help in saving Constantine. Nora agrees and is able to use her magic to heal him. Ray tells her to run and not to tell them where she went, but Nora uses the time stone to travel to the Time Bureau, wishing to repent for her actions. The other Legends meanwhile investigate a fugitive in 1950s Tokyo, discovered to be a giant Octopus creature that has appeared on a film set. The creature, named Tagumo, was brought to life by a magical book, which used the imagination of the filmmaker. Sara and Charlie manage to partially shrink it, but the Tagumo still attacks the set. Mick uses the book and his own imagination to create a heroine named Garima that battles the Tagumo, eventually defeating it. The Legends confiscate the book. The fugitives almost escape the Bureau, but Nate and Gary manage to find a way to contain them with food. Ava joins the Heywood family for Thanksgiving. In secret, Hank tells someone the fugitives are controllable and gives them permission to execute \"Project Hades\".",
    "title": "Tagumo Attacks!!!",
    "episode": "E05",
    "season": ""
  },
  {
    "description": "\nNate invites Hank to the Waverider and gives him a tour on the ship. The Legends attempt to keep Nate from Charlie, because she looks like Amaya, but fail. The Waverider detects a fugitive in Paris, 1927. Ray visits the Bureau in an attempt to see Nora but Ava rejects the visitation although Mona sneaks in a letter to Nora from Ray which Nora refuses to read and triggers her. This grabs the attention of Ava who tries to restrain Nora but they end up getting locked in the prison cell. The Legends are joined by Ernest Hemingway to hunt for the fugitive who appears to be a Minotaur. During the fight with the Minotaur, Hank is injured. Nate and Constantine calm the Minotaur down but Hemingway attacks it, angering the Minotaur. Nate confronts the Minotaur who prevents his Steel powers. Hanks picks up the guitar and sings the Minotaur to sleep. Meanwhile, Ray rescues Mona, Ava and Nora. Ava shows humanity in the prisoners thanks to Mona. Nate officially leaves the Legends team.",
    "title": "Tender Is the Nate",
    "episode": "E06",
    "season": ""
  }
]