[
  {
    "description": "Chilean drug chemist Cockroach brings his product to Colombian smuggler Pablo Escobar. DEA agent Steve Murphy joins the war on drugs in Bogota.",
    "title": "Descenso",
    "date": "August 28, 2015 ",
    "episode": "E01",
    "season": "S01"
  },
  {
    "description": "Communist radical group M-19 makes a move against the narcos, while Murphy gets an education in Colombian law enforcement from his new partner Peña.",
    "title": "The Sword of Simón Bolivar",
    "date": "August 28, 2015 ",
    "episode": "E02",
    "season": ""
  },
  {
    "description": "Murphy encounters the depths of government corruption when he and Peña try to derail Escobar's political ambitions by proving he's a narco.",
    "title": "The Men of Always",
    "date": "August 28, 2015 ",
    "episode": "E03",
    "season": ""
  },
  {
    "description": "Despite a new extradition treaty, the U.S. puts more money into fighting communism, creating new challenges for Murphy and Peña in the hunt for Pablo.",
    "title": "The Palace in Flames",
    "date": "August 28, 2015 ",
    "episode": "E04",
    "season": ""
  },
  {
    "description": "Pablo's extreme methods put the narcos on the brink of war with Carillo and the government. Peña tries to protect his witness.",
    "title": "There Will Be a Future",
    "date": "August 28, 2015 ",
    "episode": "E05",
    "season": ""
  },
  {
    "description": "Peña and Carillo close in on Gacha. Murphy tries to protect pro-extradition candidate Gaviria from a notorious assassin connected to Pablo.",
    "title": "Explosivos",
    "date": "August 28, 2015 ",
    "episode": "E06",
    "season": ""
  },
  {
    "description": "Pablo goes into hiding as the political tide turns against him, but he finds a way to strike back. Murphy and Peña finally get the CIA to help them.",
    "title": "You Will Cry Tears of Blood",
    "date": "August 28, 2015 ",
    "episode": "E07",
    "season": ""
  },
  {
    "description": "A tragic mistake forces the government to change tactics in the fight against Pablo. But Pablo faces bigger threats from inside his empire.",
    "title": "La Gran Mentira",
    "date": "August 28, 2015 ",
    "episode": "E08",
    "season": ""
  },
  {
    "description": "The hunt for Pablo seems to be over after he makes a deal with the government, but Murphy and Peña - and the Cali Cartel - have other plans.",
    "title": "La Catedral",
    "date": "August 28, 2015 ",
    "episode": "E09",
    "season": ""
  },
  {
    "description": "Pablo's activities in prison provoke the government into taking extreme action. Murphy and Peña face a situation of their own.",
    "title": "Despegue",
    "date": "August 28, 2015 ",
    "episode": "E10",
    "season": ""
  },
  {
    "description": "In the aftermath of a massive military effort to take Pablo into custody, the family reunites while enemies worry. Steve and Connie fight about safety.",
    "title": "Free at Last",
    "date": "September 2, 2016 ",
    "episode": "E01",
    "season": "S02"
  },
  {
    "description": "Tata gets impatient with life on the run. Pablo responds to President Gaviria's reward offer. Steve and Javier meet their new boss.",
    "title": "Cambalache",
    "date": "September 2, 2016 ",
    "episode": "E02",
    "season": ""
  },
  {
    "description": "President Gaviria has a new job for an old colleague Carrillo. The Search Bloc's new tactics shake up Pablo, but also unsettle Steve and Javier.",
    "title": "Our Man in Madrid",
    "date": "September 2, 2016 ",
    "episode": "E03",
    "season": ""
  },
  {
    "description": "The Cali cartel discusses moving in on Pablo's territory. Limón proposes a plan to Maritza. Tata gets a gun for protection.",
    "title": "The Good, the Bad, and the Dead",
    "date": "September 2, 2016 ",
    "episode": "E04",
    "season": ""
  },
  {
    "description": "The Search Bloc gets a new leader following the death of Carrillo. Javier loses faith in the system. Pablo brings Tata's brother Carlos down from Miami to cheer her up.",
    "title": "The Enemies of My Enemy",
    "date": "September 2, 2016 ",
    "episode": "E05",
    "season": ""
  },
  {
    "description": "The newly-formed Los Pepes want to destroy Pablo and his empire. Tata's brother urges her to leave and seek safety with her children.",
    "title": "Los Pepes",
    "date": "September 2, 2016 ",
    "episode": "E06",
    "season": ""
  },
  {
    "description": "As the danger intensifies for the Escobars, Pablo sends his family to another country. Gaviria weighs the opportunity to use them as leverage.",
    "title": "Deutschland 93",
    "date": "September 2, 2016 ",
    "episode": "E07",
    "season": ""
  },
  {
    "description": "Colombia begins to turn on Escobar after his latest terrorist attack. Tata receives help from an unlikely ally. Quica gets increasingly anxious.",
    "title": "Exit El Patrón",
    "date": "September 2, 2016 ",
    "episode": "E08",
    "season": ""
  },
  {
    "description": "Pablo is reunited with an estranged family member. Judy Moncada's life is put in danger. The DEA and CIA clash over how to handle Los Pepes.",
    "title": "Nuestra Finca",
    "date": "September 2, 2016 ",
    "episode": "E09",
    "season": ""
  },
  {
    "description": "Javier deals with the repercussions from Judy's interview. Tata tries to convince Pablo to surrender for the sake of his children.",
    "title": "Al Fin Cayó!",
    "date": "September 2, 2016 ",
    "episode": "E10",
    "season": ""
  },
  {
    "description": "The Gentlemen of Cali gather their associates together for a big surprise announcement about the future of their business. To retire from Business.",
    "title": "The Kingpin Strategy",
    "date": "September 1, 2017 ",
    "episode": "E01",
    "season": "S03"
  },
  {
    "description": "A gas incident threatens to destroy the agreement between Cali and the government and requires Jorge's help. Peña has problems with his old contact in Los Pepes.",
    "title": "The Cali KGB",
    "date": "September 1, 2017 ",
    "episode": "E02",
    "season": ""
  },
  {
    "description": "The Rodríguez brothers are hiding during the negotiations. Pacho meets the Lord of the Skies in Mexico. Peña's new DEA team visits Cali.",
    "title": "Follow the Money",
    "date": "September 1, 2017 ",
    "episode": "E03",
    "season": ""
  },
  {
    "description": "Peña hatches a plan to try to capture Cali leader Gilberto Rodriguez. Amado proposes a business idea to Pacho. Maria Salazar and her son are reunited and form a family with Miguel Rodriguez.",
    "title": "Checkmate",
    "date": "September 1, 2017 ",
    "episode": "E04",
    "season": ""
  },
  {
    "description": "Rodriguez is in jail. Paranoid about leaks, Miguel cracks down on his security. Colonel Martinez needs to resign, as false evidence about him accepting bribes has come up. Calderón, the dirty cop, is being blamed for the mistakes that led to Rodriguez' arrest. Pacho makes a decision about his new offer. Peña tries to convince the US citizen Christina to make her husband, Franklin Jurado, the main money launderer for the Cali Cartel, flip. Gilberto is shocked by his son's words of not being able to surrender anymore.",
    "title": "MRO",
    "date": "September 1, 2017 ",
    "episode": "E05",
    "season": ""
  },
  {
    "description": "Jorge takes a dangerous risk collaborating with the DEA. An accident in New York threatens to expose Chepe. Peña travels to Curacao to arrest Franklin Jurado. Miguel and the Cali Cartel suffer a deadly attack by the North Valley Cartel during the party.",
    "title": "Best Laid Plans",
    "date": "September 1, 2017 ",
    "episode": "E06",
    "season": ""
  },
  {
    "description": "Peña plans another secret operation to topple a member of the Cali Cartel but may run out of time while looking for him.",
    "title": "Sin Salida",
    "date": "September 1, 2017 ",
    "episode": "E07",
    "season": ""
  },
  {
    "description": "David seeks revenge on behalf of his father and puts Enrique in danger. Peña asks Don Berna for help on a rescue mission.",
    "title": "Convivir",
    "date": "September 1, 2017 ",
    "episode": "E08",
    "season": ""
  },
  {
    "description": "David follows his suspicions. Peña is shocked to discover the depth of corruption in the Colombian government. Miguel is sought after once again.",
    "title": "Todos Los Hombres del Presidente",
    "date": "September 1, 2017 ",
    "episode": "E09",
    "season": ""
  },
  {
    "description": "David and Peña are in a race against each other to find Pallomari. Peña makes a serious decision about the future of his career.",
    "title": "Going Back to Cali",
    "date": "September 1, 2017 ",
    "episode": "E10",
    "season": ""
  }
]