[
  {
    "description": "John Reese (Jim Caviezel), a former CIA agent and Army Special Forces soldier turned homeless alcoholic, has a struggle with a group of hot-headed teenagers on the subway. After this, he's extracted from police custody before Homicide Detective Joss Carter (Taraji P. Henson) can confront him about links to previous killings discovered through fingerprint analysis. Reese is brought to a mysterious and somewhat secretive billionaire, Harold Finch (Michael Emerson), who is the creator of the next-generation software known simply as \"The Machine\". After 9/11, Finch developed a computer program that can sift through enormous amounts of data, looking for patterns of behavior or activity that would predict another attack. It also provides information about individuals who could be in danger; it can predict the identity of a person involved in a premeditated crime that will happen at some point in the future—however, Finch's back-door link to The Machine only provides the Social Security number of the person, and offers no clues to their involvement or when the crime will take place. Finch, who feels a need to do something to help these people, enlists Reese to aid him in preventing these crimes, hoping that it will give Reese a purpose following the death of his girlfriend, Jessica (Susan Misner). A reluctant Reese agrees to watch the first person on his list, Diane Hansen (Natalie Zea), an Assistant District Attorney currently working on a major prosecution concerning a prominent drug killing. Reese soon learns that Hansen is not the victim, but the perpetrator running a ring of corrupt police officers and planning to kill a fellow DA, Wheeler (Brian d'Arcy James). After blackmailing one of the corrupt officers, Detective Lionel Fusco (Kevin Chapman), into being his source of information inside the NYPD, Reese reveals Hansen's corruption to an open court, kills the corrupt Detective Stills (James Hanlon), and links Fusco to the crime to ensure his future cooperation. Reese agrees to continue preventing violent crimes.",
    "title": "Pilot",
    "date": "September 22, 2011 ",
    "directed_by": "David Semel",
    "views": "13.33",
    "season": "S01",
    "episode": "E01"
  },
  {
    "description": "Reese takes the case of Theresa Whitaker (Valentina de Angelis), a girl who supposedly died with her family two years previously. Reviewing the evidence, Reese finds that the crime scene was staged to look like a murder-suicide. He deduces that Theresa's family was killed by a hitman, and that there is still a price on her head. He follows leads back to Solmick (Michael Medeiros), the original contract killer, who admits that he let Theresa live because he refuses to kill children. Meanwhile, Detective Carter starts investigating Reese, using his fingerprints to access his file, only to discover that it has been redacted. Using information given to him by Reese, Finch manages to locate Theresa, but they are interrupted by the arrival of another hitman (Ritchie Coster). Reese intervenes in time to save them, leaving Theresa in the care of Carter. When asked about Reese, Theresa claims that the experience was too traumatic to recall anything. (The episode is interjected with flashbacks of Finch and his partner at the founding of \"The Machine\". Finch is concerned that, if the public ever found out about it, he would be forced to shut it down. At the end, a memorial bust of Finch's partner (Brett Cullen) is shown in his offices.)",
    "title": "Ghosts",
    "date": "September 29, 2011 ",
    "directed_by": "Richard J. Lewis",
    "views": "12.51",
    "episode": "E02",
    "season": ""
  },
  {
    "description": "The Machine produces the Social Security number of Joey Durban (James Carpinello), a former soldier. On returning from Iraq, Joey joined a gang of former soldiers who have taken to robbing banks. Reese infiltrates the gang for their final robbery at an NYPD evidence lockup. They steal a file marked \"Elias, M.\" before Latimer (Ruben Santiago-Hudson), the ringleader, starts killing off the gang members and escapes. Reese starts tracking him down, but discovers that Latimer has himself been murdered after handing the file over to Elias. The file is revealed to contain photos from the scene of a brutal murder.",
    "title": "Mission Creep",
    "date": "October 6, 2011 ",
    "directed_by": "Steven DePaul",
    "views": "11.57",
    "episode": "E03",
    "season": ""
  },
  {
    "description": "Reese begins 24-hour surveillance of Dr. Megan Tillman (Linda Cardellini), the latest POI. He and Finch believe that she's being targeted by Andrew Benton (Adam Rothenberg), a serial stalker and sex offender who drugs his victims before raping them, only to discover that Tillman is actually stalking Benton and planning to kill him; one of Benton's previous victims was Tillman's sister, who committed suicide shortly after Benton assaults her. Reese assaults a group of dealers connected to a Mexican drug cartel, stealing their product and planting it on Benton to have him arrested before Tillman can catch him. Tillman, however, abducts Benton, forcing Reese to talk her out of it by saying she'll never forgive herself for taking a life after saving them for so long. Afterwards, Reese takes Benton to an empty home and contemplates whether or not to kill him to protect his future victims. Meanwhile, Detective Carter starts to get closer to Finch and Reese when she finds a surveillance tape from the robbery in \"Mission Creep\" that shows their exchange. Reese also blackmails a police captain (John Fiore) to transfer Fusco to Carter's precinct so that he can sabotage her investigation after saving Fusco from cartel hitmen, who are after him due to his actions with Stills' gang.",
    "title": "Cura Te Ipsum",
    "date": "October 13, 2011 ",
    "directed_by": "Charles Beeson",
    "views": "12.04",
    "episode": "E04",
    "season": ""
  },
  {
    "description": "A Polish street gang known as SP-9 kidnaps the son (Seamus Davey-Fitzpatrick) of Samuel Gates (David Costabile), a judge known to be tough on crime. In exchange for his son's safe return, the leader (Michael Cerveris) demands that the judge release a banker who is key to their money-laundering operations without any punishment. Breaking with his preferred means of operation, Reese makes himself known to Gates in an attempt to stall the kidnappers while he uses Detective Fusco to process evidence from the scene of the crime. He misleads SP-9 into believing that their demands have been met, securing the release of Gates' son, before delivering them to Detective Carter and the NYPD. Meanwhile, Reese makes overtures of friendship towards Finch, but is actually trying to find out more about his habits.",
    "title": "Judgment",
    "date": "October 20, 2011 ",
    "directed_by": "Colin Bucksey",
    "views": "12.42",
    "episode": "E05",
    "season": ""
  },
  {
    "description": "Reese takes the case of Zoe Morgan (Paige Turco), a professional fixer who uses her influence and her connections to powerful people to perform favors for her own clients. Zoe has been enlisted to retrieve an incriminating recording of a pharmaceutical executive from a rival company, but comes under threat when she hears the contents of the recording itself and realizes that her employer is just as corrupt as his rival. Finch finds that Zoe's case is connected to that of Dana Miller, a POI whom he was unable to save before meeting Reese. With the help of Zoe, Reese exposes a corrupt pharmaceutical company and Finch short sells their stock to cause further harm, finally getting justice for someone he was unable to save. Meanwhile, Carter takes a homicide case when the murder weapon is proven to be the same one that was used in the \"Elias M.\" case featured in \"Mission Creep\", and learns that the victim was the murderer of Elias' mother, Marlene Elias, and was killed with the same knife he used to murder Marlene. Carter finds her friend, retired detective Bernie Sullivan, murdered in his apartment by Elias, who flees the scene.",
    "title": "The Fix",
    "date": "October 27, 2011 ",
    "directed_by": "Dennis Smith",
    "views": "11.62",
    "episode": "E06",
    "season": ""
  },
  {
    "description": "Reese must protect Charlie Burton (Enrico Colantoni), a school teacher who witnessed a Russian mobster shooting an Italian-American mob lieutenant in a Brighton Beach bodega. As Reese and Burton flee the Russians and the Five Families, they stumble into territory controlled by Bulgarian mobsters. Meanwhile, Carter searches for Burton to place him in protective police custody, and in doing so, draws closer to finding Carl Elias—believed to be the illegitimate son of an aging mobster with a plan to unite the Five Families and reclaim the New York underworld from the Russians. Cut off from Finch as he tries to evade the Russians and Bulgarians, Reese comes to realize that Burton is Elias. Elias thanks Reese for saving him, but warns him not to interfere with his future goals or face unpleasant consequences, leaving Reese feeling guilty that other people will suffer because he saved Elias' life.",
    "title": "Witness",
    "date": "November 3, 2011 ",
    "directed_by": "Frederick E. O. Toye",
    "views": "11.76",
    "episode": "E07",
    "season": ""
  },
  {
    "description": "Reese and Finch track former Stasi agent Ulrich Kohl (Alan Dale) across New York City. Kohl, having been secretly imprisoned by the German government for 24 years, has finally escaped and located his former Stasi teammates—Hauffe (Kent Broadhurst), Wernick (Larry Pine) and Steiller (Sherman Howard), all of whom betrayed Kohl to the American and German governments in exchange for new lives in New York. Further, Kohl believes that his former Stasi colleagues are responsible for the murder of his wife Anja (Laila Robins), who was killed while attempting to flee Germany with him. Kohl kills Hauffe and poisons Wernick, but Reese manages to save him. When confronting Steiller before killing him, Kohl learns a terrible truth—Anja is still alive, having staged her own death to escape from his atrocities. When he attempts to locate her (running into Reese instead—whom he briefly connects to as a fellow spy and soldier), he also learns that Anja had their child, Marie (Aubrey Dollar), and so sets out to find them both. Kohl finally locates Anja, having taken Marie hostage, and admits that he understands the reasons behind her flight, before raising an unloaded weapon to her, forcing Reese to shoot him dead. Kohl's predicament leads to Reese reflecting on his own life as a spy, where it is revealed that \"John Reese\" is an alias bestowed on him by his former CIA partner, Kara Stanton (Annie Parisse).",
    "title": "Foe",
    "date": "November 17, 2011 ",
    "directed_by": "Milan Cheylov",
    "views": "11.65",
    "episode": "E08",
    "season": ""
  },
  {
    "description": "Detective Carter's investigation into the Charlie Burton/Carl Elias case has earned her a place on Elias' hit list, making her the next POI. This makes life complicated for Reese as he tries to protect her without revealing himself to her. While Carter investigates the murder of a teenager during a drive-by shooting by an arms dealer (Jason Manuel Olazabal) and tries to counsel the wife (Jennifer Laura Thompson) of a violent drunk (Charles Flint Beverage). Reese continues following Carter, who meets with one of her confidential informants (Francois Battiste) whom Elias has turned against her. The informant expresses regret before shooting Carter twice in the chest. However, she's wearing a bulletproof vest. Before the CI can finish the job, he's shot dead by Reese. Reese acknowledges that this does not change the situation—she will still arrest him given the chance.",
    "title": "Get Carter",
    "date": "December 8, 2011 ",
    "directed_by": "Alex Zakrzewski",
    "views": "12.66",
    "episode": "E09",
    "season": ""
  },
  {
    "description": "Reese and Finch are puzzled when the Machine produces four numbers. After Reese finds one person of interest dead and is unable to prevent the murder of a second, he realizes that all four have something in common, and begins to dig deeper. He finds that the four stole drug money from the scene of a car accident, and that a corrupt banker and congressman are conspiring to have them killed for it. Meanwhile, Detective Carter has been stood down following the death of her confidential informant in \"Get Carter\". She's approached by a man named Mark Snow (Michael Kelly), who identifies himself as a CIA operative, and asks her to lead him to Reese, revealing the reason why Reese faked his death—supposedly, Reese was responsible for the death of his CIA partner, Kara Stanton, and then disappeared, until Carter's investigation put him back on the agency's radar. Finch confronts the conspirators and records evidence that they established a charity in Haiti to launder drug money. Reese saves Wendy (Bridget Regan) and Paula (Melonie Diaz) by killing their attackers. But, before he can escape, he's approached by Carter and Snow and flees after being shot by a CIA assassin (Darien Sills-Evans). Carter eventually catches up to Reese and Finch, but decides to let them escape.",
    "title": "Number Crunch",
    "date": "December 15, 2011 ",
    "directed_by": "Jeffrey Hunt",
    "views": "12.93",
    "episode": "E10",
    "season": ""
  },
  {
    "description": "Finch takes a wounded Reese to the morgue, where he pays a morgue assistant to suture Reese's wounds. While Reese is in a wheelchair, Finch rents an apartment for him. The building's super, Ernest Trask (David Zayas) is the newest number. Trask has bought a gun and Finch discovers photos of one of the tenants, Lily Thornton (Kelli Barrett), in his office. Finch and Reese conclude that Trask is stalking Lily. Reese assumes that Trask is going after Lily's boyfriend, Rick Morris (Bill Heck). He confronts Trask, who says that Rick is the one stalking Lily. Finch, Trask, and Reese rush to Lily's apartment and in the resulting confrontation, Rick is thrown out of a window. Meanwhile, Carter attempts to contact Finch. Finch offers her the name Derek Watson, to show some faith. Carter prevents Derek from killing a banker and receives a call from Finch explaining that this is his purpose. Flashbacks of Finch and his partner, Nathan Ingram, show the tensions with the NSA over constitutional rights regarding the Machine, and the attempts by Nathan's NSA contact, Denton Weeks (Cotter Smith), to seize control of it.",
    "title": "Super",
    "date": "January 12, 2012 ",
    "directed_by": "Stephen Williams",
    "views": "14.86",
    "episode": "E11",
    "season": ""
  },
  {
    "description": "Reese finally decides to meet with Detective Carter, who, by helping him and Finch in their next case, is provided a little insight into what he and Finch do. Their case is Andrea Gutierrez (April Hernandez-Castillo), a self-made attorney who specializes in suing the state of New York on behalf of convicts who claim they were wrongfully imprisoned. Reese and Finch believe the threat to Andrea will be associated with her latest client, Terrence King (Curtiss Cook). King's parole officer, Dominic Galuska (Vito D'Ambrosio), has been setting up convicts to go to prison and profiting off placing their children in foster care. In representing King, Andrea has come to the attention of people who want her silenced. Meanwhile, Reese realizes that, despite trusting his life to Finch, his partner is still keeping secrets from him. He follows Finch to a meeting with Will Ingram (Michael Stahl-David), the son of Finch's previous partner, Nathan Ingram. After Finch bails him out of police custody, Will begins asking questions about his father's death, the nature of his work and his connection to Finch.",
    "title": "Legacy",
    "date": "January 19, 2012 ",
    "directed_by": "Brad Anderson",
    "views": "14.40",
    "episode": "E12",
    "season": ""
  },
  {
    "description": "Reese and Finch are alerted to Scott Powell (Myk Watford), a dedicated family man and city construction project manager, who was laid off in the face of budget cuts advocated by Congressman Michael Delancey (Victor Slezak). They find out that he has secretly applied for a weapon permit and is sending death threats to Delancey; they conclude that Powell is planning to assassinate the Congressman. However, as Reese tries to intercept Powell, Finch realizes that the evidence against him has been planted, and they are unable to stop the real assassin from killing Delancey. Powell is arrested by the FBI in the face of overwhelming evidence, forcing Reese to help him escape. With the help of Zoe Morgan (last seen in \"The Fix\"), Finch identifies Peter Matheson (Damian Young), Delancey's business partner and chief of staff, as the man who hired the assassin and a hacker to kill Delancey and frame Powell, thereby covering up Matheson's corruption. Finch acquires a recording of a conversation between Matheson and the hacker, exonerating Powell. After Matheson is found dead, the hacker, identifying herself as \"Root\", admits to Finch that she had him killed to tie up loose ends. Root acknowledges Finch, by name, as a worthy adversary.",
    "title": "Root Cause",
    "date": "February 2, 2012 ",
    "directed_by": "Richard J. Lewis",
    "views": "15.10",
    "episode": "E13",
    "season": ""
  },
  {
    "description": "\n\n\n\n\n\nThis episode's plot summary may be too long or excessively detailed. Please help improve it by removing unnecessary details and making it more concise. (May 2015) (Learn how and when to remove this template message)\n\n\nFinch and Reese enter the library for the first time since Finch's encounter with Root. Reese receives the number of Darren McGrady (Astro). He finds McGrady's apartment home is a crime scene, Darren's older brother, Travis, having recently been murdered. Carter tells him that the perpetrators were three males linked to local comic-book store owner and drug dealer Andre (Malik Yoba). Travis had ejected the youths for harassing a waitress at a local chicken shop; they then followed him home and murdered him. Darren had seen them leaving and called the police, who arrived only after Travis had been dead for some time. Now, desperate for justice, Darren has pawned his television set and trumpet to buy a gun and is about to shoot one of the men, Brick (Jon Michael Hill). Reese finds him and calls Carter. Carter arrests Brick as Reese and Darren rush off in her car. Reese leaves him at a convent with Fusco, who is still trailing Finch. Darren escapes, but Reese finds him again. Darren tries to hire Reese to avenge his brother's death, but Reese just keeps a quarter and says he will work to put his brother's killers behind bars, meaning no killing. Reese captures one of the perpetrators in a police car with a load of bottles and threatens the other by burning the drug money until he discloses the location of the murder weapon. Corrupt police captain and HR member Lynch (Michael Mulheren) intervenes to have Brick released in less than a day. Before Reese can send the gun to the police, Darren takes it and runs off, intending to kill his brother's murderers. Reese calls Carter and she and Fusco rush arrive in time to stop Darren and capture the killers, but Fusco is shot when Andre tries to kill Darren. With Darren safe, Reese drives him to meet his new foster family.",
    "title": "Wolf and Cub",
    "date": "February 9, 2012 ",
    "directed_by": "Chris Fisher",
    "views": "15.14",
    "episode": "E14",
    "season": ""
  },
  {
    "description": "The latest number that the Machine dispenses belongs to Michael Cahill (Michael Aronov), who on the surface is an unassuming and upstanding but solitary citizen, which masks the fact of being involved in a major smuggling ring led by a man named Vargas (José Zúñiga). Members of the ring will not hesitate to kill anyone who gets in their way. Reese quickly infiltrates the smuggling ring. But, when Reese follows Cahill away from the group, he finds that Cahill's former name is Daniel Tully, and that he's a husband, father and cop, who is deep undercover. Cahill could have put Vargas away long ago, but is waiting to nab the ringleader, a man (Michael Berresse) going by the code name L.O.S. Reese also learns that Vargas probably has a connection working inside the police force. Meanwhile, Finch gets Carter to provide information on the workings of undercover cops. Fusco, meanwhile, is tasked with finding out information on Vargas and consults his friend, Officer Simmons (Robert John Burke), a high-ranking HR enforcer. Fusco is later taken hostage by Vargas' corrupt informant (Reg E. Cathey), whom Reese kills just in time. Despite Fusco's saying that he always tried being a good person, Reese tells him to go undercover in HR to learn about their operations and flush out Vargas' connection.",
    "title": "Blue Code",
    "date": "February 16, 2012 ",
    "directed_by": "David Von Ancken",
    "views": "13.16",
    "episode": "E15",
    "season": ""
  },
  {
    "description": "The next number belongs to Adam Saunders (Matt Lauria), a trader with a Wall Street investment firm. Adam is a high roller: plays big and wins big, is having a fling with his boss, and is in the SEC's gunsights for suspected illegal trading. Reese's cover is as Finch's asset manager, looking to invest. Adam had advised his adopted uncle to invest big in a firm call Tritek, that he now suspects has some serious problems. Raising an alarm puts his life in danger. It turns out a co-worker of Adam's and the SEC guy who is harassing him, together are using Tritak's imminent failure to defraud thousands of people out of tens of millions of dollars, as they sell it short. Reese is able to protect Adam from assassins sent to kill him before he leaks the news too early, while Finch uses his unlimited funds to keep Tritak in operation, save the investors' money, and expose the villains. Our friends realize that the perpetrators in this case were working for Carl Elias.",
    "title": "Risk",
    "date": "February 23, 2012 ",
    "directed_by": "Jeff T. Thomas",
    "views": "14.56",
    "episode": "E16",
    "season": ""
  },
  {
    "description": "Reese and Finch are confused when the Machine names a six-month-old child, Leila Smith, as the latest POI. Reese and Finch turn into overly protective parents—with an arsenal at their disposal—as they investigate her origins. The child is re-kidnapped by the Albanian mob and Reese negotiates with Elias to help get the child back. Detective Carter begins to question her new allegiance with Reese and Finch after Reese's negotiation with Elias goes awry, and Elias' father, Gianni Moretti (Mark Margolis) is kidnapped by Elias.",
    "title": "Baby Blue",
    "date": "March 8, 2012 ",
    "directed_by": "Larry Teng",
    "views": "15.67",
    "episode": "E17",
    "season": ""
  },
  {
    "description": "Finch and Reese take on the case of Jordan Hester, who appears to be living a double life with a very small online footprint. They soon discover two Hesters: Reese follows a male Hester (Rhys Coiro) while Finch follows a female Hester (Sarah Wynter), who he believes is a target. Reese finds the male Hester's apartment, and discovers they're making ecstasy while Finch explains to the female Hester what he does and suggests she move somewhere safer. As they do, Fusco meets with a prisoner (Christopher Denham) who was recently part of a similar case, and learns that the woman's name is actually Mary and the real Jordan Hester is the man. At her apartment, Mary drugs Finch with ecstasy, destroys his phone and leaves him to die in a fire; Fusco rescues Finch as Mary leaves to kill Hester. Reese destroys the ecstasy lab with Hester's help, then follows Mary to a restaurant, where she's arrested and her true identity, Tara Verlander, is revealed. Carter, who is keeping her distance from Reese and Finch, is approached by FBI agent Donnelly (Brennan Brown), who is also looking for Reese. Donnelly explains Reese's previous involvement in illegal, USA based CIA operations, which the FBI wish to expose, and believe he's now working as a mercenary for Elias. Meanwhile, Finch offers to answer any of Reese's questions about him while under the influence, but Reese chooses not to take advantage of his partner to satisfy his own curiosity.",
    "title": "Identity Crisis",
    "date": "March 29, 2012 ",
    "directed_by": "Charles Beeson",
    "views": "14.59",
    "episode": "E18",
    "season": ""
  },
  {
    "description": "\n\n\n\n\n\nThis episode's plot summary may be too long or excessively detailed. Please help improve it by removing unnecessary details and making it more concise. (May 2015) (Learn how and when to remove this template message)\n\n\nWhen the Machine spits out five numbers, naming the Don of each of New York's crime families, Reese and Finch suspect Elias is planning to eliminate his competition, and Carter wants them in protective custody. As the story unfolds, it is intercut with flashbacks of Elias' youth, explaining what motivates him. Reese attempts to ask one of the Dons (Tony Darrow) to follow him but he refuses and is killed in a car explosion carried out by Elias' principal enforcer (David Valcin); another (Arthur Nascarella) is shot down while in Carter's protective custody. Carter kidnaps the remaining three Dons (Vincent Curatola, Paul Schulze, Ed Setrakian) and takes them to an apartment owned by Finch but are tracked down with ease by HR cops. As Carter guards the Dons, Reese must save Carter's son (Kwoade Cross), who has been kidnapped by Elias in an effort to force Carter to turn the Dons over to him. Elias threatens Carter, trying to force her to open the door, while Reese rescues Carter's son and Gianni Moretti, Elias's father. One of the Mafia members then reveals that he was working with Elias, but he's killed as Elias breaks through the door. Non-corrupt police are alerted by Fusco and arrive at the scene to arrest Elias. As Elias is going to his cell, he places a call to his recently rescued father before blowing up the car he and his half-brother are in.",
    "title": "Flesh and Blood",
    "date": "April 5, 2012 ",
    "directed_by": "Stephen Semel",
    "views": "13.69",
    "episode": "E19",
    "season": ""
  },
  {
    "description": "\n\n\n\n\n\nThis episode's plot summary may be too long or excessively detailed. Please help improve it by removing unnecessary details and making it more concise. (May 2015) (Learn how and when to remove this template message)\n\n\nTommy Clay (Pablo Schreiber), who works for an armored car service, is working with a team that Finch believes will be robbed. Reese works with the team as a rookie as Finch tracks the car in an attempt to predict the robbery. When the team picks up platinum valued at $1.25 million, the vehicle explodes and Reese is shot by Clay. Reese awakes in a hospital and is rescued by Carter. Finch tracks Clay to a motel, where his two partners in crime have been killed. Fusco arrives and realizes that HR is involved in the robbery as Finch finds Clay's partner, a waitress named Ashley (Virginia Kull). Reese finds Clay, and realizes that Clay is not only a perpetrator, but also a victim, just before Clay is killed by Ashley. Ashley leaves with the platinum, but is killed by Captain Arthur 'Artie' Lynch, a member of HR, who is in turn killed by Fusco coming to Reese's rescue. Meanwhile, in flashbacks shown throughout the episode, Reese, while on a mission with Kara Stanton in Morocco, receives a desperate-sounding phone-call from Jessica before he and Kara are ordered to travel to Ordos, China to retrieve a stolen computer. The orders are given in person by Mark Snow and a mysterious woman (Elizabeth Marvel)—revealed in episode 22 to have been Alicia Corwin of the NSC, Nathan Ingram's Government contact, therefore the implications are much larger—and their mission in China is shown as it played out. Reese is puzzled when Snow orders him to kill Kara, who has allegedly been compromised, when their mission is completed. When the time comes, however, Reese hesitates and is shot by Kara, who was given instructions identical to those given to Reese. Reese realizes that the CIA actually wants the computer destroyed and anyone who had access to it dead, including him and Kara, and escapes the building as an AC130 destroys it. In the present day, Snow and Evans follow a lead that they believe will lead to Reese. They arrive at a hotel, where Evans is killed and Snow is taken hostage by Kara, revealed to have survived the air strike.",
    "title": "Matsya Nyaya",
    "date": "April 26, 2012 ",
    "directed_by": "Kevin Bray",
    "views": "12.73",
    "episode": "E20",
    "season": ""
  },
  {
    "description": "Reese gets the day off, ostensibly for his birthday. Finch goes to Carter for help, but then urges her to accompany agent Donnelly to New Rochelle, where Donnelly suspects Reese in the disappearance of a man after his wife died in a car accident. Carter finds clues indicating the husband abused his wife, making her death suspicious. Finch works with Detective Fusco to find POI Karen Garner (Dagmara Dominczyk), pursued by U.S. Marshals for identity theft. But again the official story is debunked after Reese—rescuing the mission from the fumblings of Finch and Fusco—learns she's fleeing her abusive husband (Jeremy Davidson), a marshal who framed her to trigger the manhunt. As case parallels emerge, so does the identity of the dead wife in New Rochelle: Reese's ex-girlfriend, Jessica Arndt. Did Reese kill her husband? Will he kill the marshal? A phone call to Carter suggests Reese deposits his bad guys, with drugs he plants on them, at a Mexican prison. Reassured, Carter shreds a military file on Reese that arrives for Donnelly. In the final flashback, Reese, who has just learned of Jessica's death, bumps into a man in a wheelchair. It's Finch, with a folder suggesting Jessica Arndt was a POI he could not save.",
    "title": "Many Happy Returns",
    "date": "May 3, 2012 ",
    "directed_by": "Frederick E. O. Toye",
    "views": "13.27",
    "episode": "E21",
    "season": ""
  },
  {
    "description": "Wanting to unearth Finch's secrets, Reese watches him as he takes a call. But it's just a new POI: Henry Peck (Jacob Pitts), an NSA security analyst. Someone is after Peck for unwittingly pointing up the Machine in a security report. Flashback to 2009: Nathan Ingram's government contact, Alicia Corwin, tells him, ominously, that the Machine will flag anyone who discovers its existence. It occurs to Ingram: The U.S. government might abuse its power to secretly spy on Americans. He asks Finch to create a contingency program. Finch deems it a dangerous plan, so Ingram does it himself. Peck meanwhile keeps getting rescued by (then escaping) Reese. Along the way, he ultimately realizes the Machine exists: \"Our own government is spying on us, and they want to kill me for covering it up! I have to tell someone!\" he yells during one of the rescue-escapes. Finch finally corners Peck while he's waiting to meet a journalist. He gives Peck a new identity kit, admits to creating the machine, then walks away, unaware that Alicia Corwin overheard his admission. Reese tracks down Finch's fiancée (Carrie Preston), and Finch later confirms that he faked his death to protect her.",
    "title": "No Good Deed",
    "date": "May 10, 2012 ",
    "directed_by": "Stephen Williams",
    "views": "12.96",
    "episode": "E22",
    "season": ""
  },
  {
    "description": "Fusco is hired by HR leadership to obstruct any investigation into a planned murder, which happens to be the current POI: Caroline Turing, PhD (Amy Acker), a therapist with a powerful client list. To protect Turing, Reese signs up for therapy. After saving Turing from an assassin on a city street, he attempts to hide her at a hotel. But thanks to street surveillance footage, both HR and the FBI find them and converge on the building. Finch and the two detectives—who discover they're on the same team—help Reese get Turing out. Later, Finch goes to meet Turing, but instead finds Alicia Corwin, who demands his help in shutting down the Machine. Then Turing arrives, wrapping up the plan that she—Root, the hacker from Root Cause—set into play in order to get answers about the Machine. Root kills Alicia and abducts Finch. Montage: Reese finds Corwin's body. Carter and Fusco disseminate damning evidence about HR, anonymously. Reese gazes into a surveillance camera and tells the Machine to help him find Finch. A payphone rings. Reese answers.",
    "title": "Firewall",
    "date": "May 17, 2012 ",
    "directed_by": "Richard J. Lewis",
    "views": "13.47",
    "episode": "E23",
    "season": ""
  },
  {
    "description": "\n\n\n\n\n\nThis episode's plot summary may be too long or excessively detailed. Please help improve it by removing unnecessary details and making it more concise. (May 2015) (Learn how and when to remove this template message)\n\n\nReese receives a series of seemingly random words from the Machine via the pay phone. After assigning Carter to look deeper into Alicia Corwin's death, he eventually realizes that the words identify three different books in Finch's library, the Dewey decimal numbers of which make up the Social Security number of accountant Leon Tao (Ken Leung). Paying Tao a visit, Reese confirms that Tao is the next POI, having extorted money from white supremacists. As a government operative sabotages the Corwin investigation to prevent Carter from learning about the Machine, Reese leaves Tao in the care of Fusco while he concentrates on gathering clues to Finch's location. Fusco soon runs afoul of the white supremacists and is taken hostage along with Tao. Reese rescues them, and in doing so acquires an attack dog, which he later names Bear. Meanwhile, Root takes Finch with her as she kidnaps Denton Weeks, one of the government officials overseeing the Machine, and the NSA agent who met with Nathan Ingram and attempted to seize control of the Machine (in \"Super\"). Root thus reveals her curiosity as to how he and Reese thwarted her operation (in \"Root Cause\") so efficiently. She tells Finch that she sees the Machine as a \"perfect intelligence\" and wishes to set it free from the corrupt people it was entrusted to. Throughout the episode, flashbacks show Finch training the Machine to recognize the faces it sees via surveillance cameras, as well as testing its capabilities by having it help him to play Blackjack. When, during one flashback, the Machine saves Finch from an out-of-control car, he rebukes it, stating that it should endeavor to protect everyone else, not him. Frustrated that the Machine has been programmed in this way, Reese threatens to quit if it does not help him find Finch, and is given his first clue to Finch's location: the Social Security number of a girl living in Texas, who has been missing since the age of 14.",
    "title": "The Contingency",
    "date": "September 27, 2012 ",
    "directed_by": "Richard J. Lewis",
    "views": "14.28",
    "season": "S02",
    "episode": "E01"
  },
  {
    "description": "\n\n\n\n\n\nThis episode's plot summary may be too long or excessively detailed. Please help improve it by removing unnecessary details and making it more concise. (May 2015) (Learn how and when to remove this template message)\n\n\nRoot brutally interrogates Denton Weeks over the location of the Machine, accusing him of having what she calls \"bad code\". To prove that Denton is \"bad code\", she allows Finch to help Denton temporarily escape and pretends to be subdued. Once Denton realizes that Finch was involved with the creation of the Machine, he tries to kill Finch, but Root kills Denton instead after he reveals the Machine's location to be somewhere in Salt Lake City. Meanwhile, Reese continues to follow the trail of the missing girl supplied by the Machine in \"The Contingency\". Her name was Hanna Frey, a girl abducted outside a library. The one witness to the crime was Hanna's friend Samantha Groves, who informed the librarian (Margo Martindale) what she saw, only for the librarian to accuse Sam of lying, because she was in love with the man that Sam had accused. The experience started Sam down a path that would ultimately lead to her becoming Root. In the present, Reese and Carter are able to locate Hanna's body and ensure a proper burial, learning that Root arranged to have her killer murdered. Using a book Root sends to the librarian each year, Reese is able to track Root to a cabin in Maryland. He arrives in time to find Weeks dead and Root gone, having taken Finch with her to Union Station. Finch leaves a clue to where he is being taken by using a tap code on a telephone handset. Reese decodes the clue in order to follow and save Finch, but Root is able to escape before Reese can apprehend her. She later calls him to thank Reese for finding Hanna, but warns she will be back someday for Finch. While Reese searches for Finch, Fusco investigates Alicia Corwin's murder. Fusco is able to steal some of Corwin's belongings and learns from a tapped conversation between Hersh and his boss of their search for Denton. Fusco alerts Reese with the information he discovers on Denton helping Reese to locate the cabin.",
    "title": "Bad Code",
    "date": "October 4, 2012 ",
    "directed_by": "Jon Cassar",
    "views": "14.58",
    "episode": "E02",
    "season": ""
  },
  {
    "description": "As Finch tries to readjust to life after his kidnapping, establishing a bond with Reese's attack dog Bear, Reese poses as a bodyguard to get close to Sophia Campos (Paloma Guzmán), the spoiled daughter of the Brazilian consul in New York. Sophia has become the target of the leader of a drug smuggling operation, who believe that she and a friend witnessed their operations. Meanwhile, Fusco hands the Alicia Corwin case on to Carter. While at the morgue, Carter encounters Mark Snow, who claims that he has been reassigned, but in reality, is being held hostage by Kara Stanton.",
    "title": "Masquerade",
    "date": "October 18, 2012 ",
    "directed_by": "Jeffrey Hunt",
    "views": "13.93",
    "episode": "E03",
    "season": ""
  },
  {
    "description": "Riley Cavanaugh (Jonathan Tucker), an enforcer for an Irish mobster, becomes the next number when he betrays his boss and goes on the run with his lover, Annie, whom he was ordered to kill. Reese and Finch debate the morality of trying to save a ruthless killer, but they soon need Riley's help when Annie is captured by bounty hunters hired by the mob. To keep Annie safe, Finch is forced to make a deal with Elias, who continues to run the biggest criminal organization in New York from behind bars, in exchange for a game of chess. Riley sacrifices his life in order to save Annie, an act Reese encourages her to interpret as proof of his love and a sign of his redemption.",
    "title": "Triggerman",
    "date": "October 25, 2012 ",
    "directed_by": "James Whitmore, Jr.",
    "views": "14.03",
    "episode": "E04",
    "season": ""
  },
  {
    "description": "In the midst of New York's mayoral elections, the police and FBI are closing the net around the elusive leader of HR. Investigative reporter Maxine Angelis (Gloria Votsis) is trying to beat them to the scoop and becomes the next number, but Reese finds it difficult to protect Maxine when Finch discovers she's writing an expose on the mysterious \"man in the suit\", so he uses an online dating website to get close without exposing his true identity. HR runs a gambit to trick Maxine into naming an FBI informant as the big boss, discrediting her, while everyone hunts for a ledger that can name everyone in the organization. Reese, Carter and Fusco manage to track down the ledger, and Fusco secretly removes the pages that would incriminate him and Simmons. The ledger names one of the mayoral candidates as the big boss and his opponent wins the race, but in reality, both candidates are on the payroll of Alonzo Quinn (Clarke Peters), HR's true leader.",
    "title": "Bury the Lede",
    "date": "November 1, 2012 ",
    "directed_by": "Jeffrey Hunt",
    "views": "13.66",
    "episode": "E05",
    "season": ""
  },
  {
    "description": "Reese ventures into suburbia to locate the next person of interest, Graham Wyler (David Denman), whose past returns to haunt him. Reese \"proposes\" to Zoe Morgan for the mission to help blend into suburban life. They move to the suburbs to investigate Wyler. Wyler is forced to help with a robbery led by his former partners, as he is a master safecracker. He cracks the safe as Reese and the NYPD show up. Carter buys some extra time with the police by leading them up the wrong staircase to give Reese and Wyler time to escape down the other; however, Wyler decides he does not want to run any more and turns himself in. He turns state's evidence against the gang and is then placed on house arrest, as the court deems him no threat to society and due to his help in getting convictions on the crew. Zoe and John \"divorce\" but Zoe suggests they both spend one more night in 'their' house. The episode ends with a flashback of Finch greeting Grace (who would later be his fiancé) for the first time.",
    "title": "The High Road",
    "date": "November 8, 2012 ",
    "directed_by": "Félix Alcalá",
    "views": "14.87",
    "episode": "E06",
    "season": ""
  },
  {
    "description": "Reese and Finch work to save both the life of a CEO undergoing secret surgery and the wife (Erica Leerhsen) of the surgeon (Sharon Leal) from a former MI6 agent (Julian Sands) and a team of ex-SAS operatives; Leon Tao from \"The Contingency\", once again in danger, assists while under protective detention. Carter handles the case of a murdered man with her business card in his pocket, finding out that Agent Snow is the murderer. On confronting Snow, he reveals to her that he has been strapped to a bomb suit and says that 'she', referring to Reese's handler, Kara Stanton, presumed to have been killed by the air strike in China, is planning something big. Detective Carter informs Reese of her meeting with Agent Snow, upon which Reese offers her a choice of staying out of the case as she has people who will miss her, unlike Finch and Reese.",
    "title": "Critical",
    "date": "November 15, 2012 ",
    "directed_by": "Frederick E. O. Toye",
    "views": "14.57",
    "episode": "E07",
    "season": ""
  },
  {
    "description": "The Machine produces two numbers belonging to a married couple (Mark Pellegrino and Francie Swift) who own a publishing house. Reese and Finch work together and soon discover that each has ordered a hit on the other to settle a proposed sell out deal for their company. Reese kidnaps the couple with Carter's reluctant help, and defends them from a group of armed thugs while Finch plays marriage counselor. Eventually the hit men are taken down while the couple are arrested but work out their marital problems. Finch suggests that the two will not spend much time in jail due to good lawyers and a refusal to testify against each other. Meanwhile, Carter begins a relationship with narcotics detective Cal Beecher (Sterling K. Brown).",
    "title": "'Til Death",
    "date": "November 29, 2012 ",
    "directed_by": "Helen Shaver",
    "views": "14.43",
    "episode": "E08",
    "season": ""
  },
  {
    "description": "Reese works to save the life of a local taxi driver (Michael Irby) who is put in danger when a passenger leaves behind a laptop that is wanted by the Estonian mafia. Reese and Finch eventually realize the laptop contains valuable information that could enable terrorists to enter the county undetected. As a result, the Estonian mafia is killing anyone who has even seen the laptop. Finch is able to locate the laptop and the Estonians are defeated by Reese. Finch and Reese then have the cab driver use the laptop to negotiate a deal with the Secret Service to bring his family over from Cuba in exchange for the laptop. At the same time, HR decides to reestablish ties with Elias and blackmail Fusco into helping. After walking into an ambush, Fusco tells HR member Simmons that Elias has cut all ties and Fusco is as well. In response, Simmons leaves Carter with an anonymous tip that a cop murdered Detective Ian Davidson (from \"Blue Code\").",
    "title": "C.O.D.",
    "date": "December 6, 2012 ",
    "directed_by": "Clark Johnson",
    "views": "14.18",
    "episode": "E09",
    "season": ""
  },
  {
    "description": "Reese must protect the sister (Jessie Collins) of a soldier who died in Afghanistan and her boyfriend, an ex-Marine (Brian J. Smith) who lost his right arm, who are trying to expose an executive stealing from a charity for wounded vets. Carter is offered a temporary assignment to the FBI when Special Agent Donnelly returns with new clues he believes will lead to Reese. The situation gets complicated when Reese, for whom the case has become personal, puts himself at risk as the FBI closes in on him while Finch is unable to stop him. The episode concludes with the FBI arresting Reese as well as some thugs working for the crooked charity. Fusco, meanwhile, grows increasingly suspicious of Carter's boyfriend Cal Beecher, who is revealed to be the godson of HR leader Alonzo Quinn.",
    "title": "Shadow Box",
    "date": "December 13, 2012 ",
    "directed_by": "Stephen Surjik",
    "views": "14.08",
    "episode": "E10",
    "season": ""
  },
  {
    "description": "\n\n\n\n\n\nThis episode's plot summary may be too long or excessively detailed. Please help improve it by removing unnecessary details and making it more concise. (May 2015) (Learn how and when to remove this template message)\n\n\nWith Reese in FBI custody, Finch poses as a teacher in a high school in order to protect the next number, a teenager named Caleb Phipps (Luke Kleintank). Based on his statistics, Caleb is a below-average student, but Finch discovers he's actually trying to hide the fact that he's a genius. Finch begins to learn that Caleb is a master coder making a big program, and with Fusco's help, he realizes he's also a drug lord. Finch confronts Caleb's tech teacher, who is apparently trying to take credit and money for Caleb's code, but then realizes he's only trying to promote his work and then credit him for it so investors can help Caleb make a lot of money off of his work. Meanwhile, Caleb is supposed to be meeting with Lorenzo, a drug dealer and former boss of his associates at school. Caleb instead plans to give his code and drug money to his drunk mother, and goes to a train station where he plans to commit suicide because his brother was killed in a train accident before while he was drunk. Finch is able to talk him out of it while Fusco takes care of Lorenzo. Caleb then thanks Finch as he prepares for his next day at school. Meanwhile, Reese and three other men are held captive by the FBI, who prepare to interrogate each one until they reveal the \"Man in the Suit\".",
    "title": "2πR",
    "date": "January 3, 2013 ",
    "directed_by": "Richard J. Lewis",
    "views": "16.23",
    "episode": "E11",
    "season": ""
  },
  {
    "description": "\n\n\n\n\n\nThis episode's plot summary may be too long or excessively detailed. Please help improve it by removing unnecessary details and making it more concise. (May 2015) (Learn how and when to remove this template message)\n\n\nWhile Finch gets a new number, supermodel Karolina Kurkova, and assigns Fusco to the job, Carter is asked to interrogate the four suspects. Finch assists by creating fake information for Reese to substantiate the claims he gives while being interrogated. Elias offers to help Reese, but Reese refuses as the FBI knows that the 'Man in a Suit' has an affiliation with Elias. Finch bribes a suspect (Brendan Griffin) to tell the FBI who the man is. The suspect blames one of the other men but after another suspect (who was relieved as he was in Iraq while the man in the suit was on the streets) (James Knight) is killed by a government assassin named Hersh (Boris McGiver), who knows that the Man in the Suit also has a connection to the Machine, Agent Donnelly suspects that he was bribed and the real man is Reese. During a brawl involving Reese and the other thugs to try to get him to show his combat skills and prove himself to be the Man in the Suit, Elias tells the thugs to back off, saving Reese and causing the experiment to be a failure. Carter questions the last suspect (Creighton James) in order to provoke him into attacking her, causing the FBI to believe that he is the man, securing Reese's release. Later, Reese visits Carter and thanks her, but Donnelly approaches them and realizes that Reese is indeed the Man in the Suit. He arrests Carter for conspiracy and Reese for murder. Finch attempts to meet with Fusco to assist him, but public phones begin to ring. Finch is hesitant at first but then takes the call. He rushes back and finds out that the next number is Donnelly. He calls Donnelly to warn him as a truck hits Donnelly's car. Kara Stanton walks out, killing Donnelly and sedating Reese.",
    "title": "Prisoner's Dilemma",
    "date": "January 10, 2013 ",
    "directed_by": "Chris Fisher",
    "views": "15.67",
    "episode": "E12",
    "season": ""
  },
  {
    "description": "\n\n\n\n\n\nThis episode's plot summary may be too long or excessively detailed. Please help improve it by removing unnecessary details and making it more concise. (May 2015) (Learn how and when to remove this template message)\n\n\nCarter survives the crash; she receives a call from Finch, telling him Donnelly is dead and Reese has been taken. Kara Stanton has strapped a bomb vest to Reese, and the next morning, he learns he will be forced into doing fieldwork with Mark Snow, who has a similar bomb vest on. The two steal a hard drive and are then assigned to go install it. A flashback shows how Kara was visited in the hospital by a mysterious man named Greer (John Nolan) who seeks her help, and after a few words, Kara says she will help him if she gets an answer to the question of who sent her on the mission. In the present time, Kara times the bomb to 15 minutes, but Reese shuts down the system, preventing Kara getting what she wants. Kara deactivates the bomb and installs the system in another room and locks them in. She resets the bombs to 5 minutes. They manage to escape but Snow hits Reese and runs off to get Kara. Carter and Fusco try to help Reese, but he refuses. Finch meets Reese on the roof and after denying Finch's help, Finch deactivates the vest on Reese. Kara receives the name of the person who requested the laptop be stolen; she is surprised to find Snow in her car just before Snow's vest explodes, killing them both. The FBI, satisfied that Snow fits the description of \"The Man in the Suit\", officially closes the case. A final flashback revisits the exploding car that killed Stanton and Snow; a small piece of paper floats to the ground from within the wreckage, with a name written on it: Harold Finch.",
    "title": "Dead Reckoning",
    "date": "January 31, 2013 ",
    "directed_by": "John Dahl",
    "views": "15.71",
    "episode": "E13",
    "season": ""
  },
  {
    "description": "\n\n\n\n\n\nThis episode's plot summary may be too long or excessively detailed. Please help improve it by removing unnecessary details and making it more concise. (May 2015) (Learn how and when to remove this template message)\n\n\nReese has to protect snobbish Internet billionaire Logan Pierce (Jimmi Simpson), who flouts all the rules and behaves so badly that everybody wants to kill him. A rival programmer whom Pierce had promised development capital is an early suspect, but she has disappeared. After several attempts on Pierce's life, it is revealed that his partner, Justin Ogilvay, has been trying to kill him. Pierce flies himself and Reese to St. Petersburg, Russia, to escape the killer. Pierce invites dozens of friends to join him and party, causing Reese to walk away, disgusted with his attitude. Pierce runs into Justin and his goons outside, and Justin explains why he intends to kill his partner, before saying goodbye and driving away. Two thugs are about to throw Pierce off a bridge when Reese appears and saves him. Justin is arrested, and it is revealed that Pierce has been in cahoots with Emily Morton, who has developed a superior technology. By being removed from FriendCzar, Pierce's non-compete agreement is void, allowing him to assist Emily in a new venture which will crush FriendCzar. When Reese shows Finch the $2 million watch that Pierce has given him, Finch stomps on it, revealing a tiny GPS tracker inside. \"Your friend is just curious enough to be dangerous,\" Finch warns. In a flashback to 2009, Finch's old partner Ingram is shown about to try to save one of the \"irrelevant\" numbers identified by the Machine. At the end of the episode, Bear is cured of his depression when Finch and Reese take him to the park to meet a doggy pal.",
    "title": "One Percent",
    "date": "February 7, 2013 ",
    "directed_by": "Chris Fisher",
    "views": "14.88",
    "episode": "E14",
    "season": ""
  },
  {
    "description": "\n\n\n\n\n\nThis episode's plot summary may be too long or excessively detailed. Please help improve it by removing unnecessary details and making it more concise. (May 2015) (Learn how and when to remove this template message)\n\n\nReese and Finch work undercover in a hotel to protect a maid named Mira (Mia Maestro) who escaped the war in Kosovo. With assistance from Zoe, who is also working in the hotel, Reese follows Mira as a bellhop while Finch works as a concierge. Finch finds out that Mira is hiding her true identity, and they realize she is being followed by a hit squad. John discovers she is refusing to cooperate with a reporter attempting to uncover a Serbian general's war crimes. When the reporter is murdered, she decides to send a DVD with evidence to the authorities. Fusco escorts Mira to the station, where one final hit man attempts to kill her, before being shot by Carter. Meanwhile, Carter receives an offer to join the FBI, and is asked to take a polygraph, but is rejected because Cal Beecher, her friend and love interest, has a record of Internal Affairs investigations. Hersh follows Reese to the hotel, acting on orders from Special Counsel, intending to interrogate and kill him, but Reese manages to stab Hersh, and gives him the choice to either seek medical attention or attack Reese. Hersh chooses to go to the hospital, and while in recovery is ordered back to D.C. Finch purchases the hotel and promotes Mira to manager. Thanking Zoe for her help, John flirtatiously informs her that he has taken a suite in the hotel for a night. Meanwhile, Special Counsel's assistant, Miss May, is shown to be Root.",
    "title": "Booked Solid",
    "date": "February 14, 2013 ",
    "directed_by": "Frederick E. O. Toye",
    "views": "14.87",
    "episode": "E15",
    "season": ""
  },
  {
    "description": "\n\n\n\n\n\nThis episode's plot summary may be too long or excessively detailed. Please help improve it by removing unnecessary details and making it more concise. (May 2015) (Learn how and when to remove this template message)\n\n\nSameen Shaw (Sarah Shahi), government assassin, and Michael Cole (Ebon Moss-Bachrach), a computer specialist working for Special Counsel (Jay O. Sanders), neutralize a terrorist plot, acting on information from a Pentagon group called \"Research\". Cole suspects that Research may sometimes be wrong, having found out from the Social Security number belonging to an electrical engineer they had previously killed that he was hired by the US government, not by terrorists. The Machine meanwhile gives their numbers to Reese and Finch, since their lives are now in danger. Special Counsel has sent a hit team to eliminate Shaw and Cole because Cole may have obtained information on the Machine. They kill Cole. Shaw escapes with help from Reese, whom she shoots, believing him to be another assassin. (We see Reese later, and can infer he was wearing body armor, but that the shock had delayed him long enough for her to evade him.) While on the run, Shaw is captured and tied up to be interrogated by Root, who believes she may hold the key to the Machine's location. Root leaves abruptly to avoid another hit team from Special Counsel. Just as the new hit team are about to kill Shaw, Reese saves her. He brings her to meet Finch, who explains that \"Research\" does not actually exist (implying it is the Machine), and offers his aid to her. She refuses, so he offers her his card, which she looks at, but politely declines. She goes to confront Special Counsel, and surprisingly returns the flash drive with the information Cole had recovered, then kills the subordinate who had ordered her and Cole's death. Special Counsel allows her to leave, but later her old mentor (Hersh) surprises her on a crowded street, injecting her with poison. Leon Tao (disguised as a paramedic), Carter, and Fusco take charge of the apparently dead body and drive away. We learn in the next scene that Tao has, as directed by Reese, injected her with an antidote. Shaw, fully recovered after a sedative Tao had to give her, meets with Reese and Finch in a graveyard. While again refusing their aid, this time she accepts Finch's card.",
    "title": "Relevance",
    "date": "February 21, 2013 ",
    "directed_by": "Jonathan Nolan",
    "views": "14.22",
    "episode": "E16",
    "season": ""
  },
  {
    "description": "\n\n\n\n\n\nThis episode's plot summary may be too long or excessively detailed. Please help improve it by removing unnecessary details and making it more concise. (May 2015) (Learn how and when to remove this template message)\n\n\nAfter being silent for three days, the Machine generates six numbers of people spread across the country who have been reported missing. Reese and Finch conclude that they may be on the hunt of an identity thief. Added time pressure, and incentive to act, is provided when Finch finds burnt teeth among the ashes, all that remains of the final one of the six numbers they had been given earlier. At this point Detective Carter realizes that they are hunting a serial killer who assumes the identity of his victims. Reese, meanwhile, is on Owen Island where he encounters FBI agent Alan Fahey (Luke Macfarlane) who is also on the search for the same killer. Due to a severe storm all residents of the island who could not evacuate on time are now taking shelter in the police station. This leads Reese and Agent Fahey to realize that the killer must be among those stranded in the station. As Finch is unable to reach the island by car, he uses a sea plane to land, and arrives at the station under the guise of a meteorologist. He is able to fashion a makeshift lie-detector out of the devices he brought as cover, and Fahey uses them to interrogate the people in the station. Carter meanwhile has researched the first victim, and discovered that the serial killer was his roommate in college, and goes to help Finch and Reese. Cal Beecher, who Carter has been avoiding, confronts her with her avoidance, and when she explains where she is going, accompanies her to Owen Island. Meanwhile, Finch and Reese split up, and both independently discover that the killer is actually masquerading as Agent Fahey, whom he had killed before Reese arrived on the island. Reese is delayed by a drug smuggler whose operation he stumbled upon, while the killer captures Finch and begins the process of taking over Finch's cover identity, while explaining his motives. He believes he is living his victims' lives better than they ever could, and intends to stop once he has found the identity he was \"meant to have.\" Carter arrives and shoots the killer, who is wearing the real Agent Fahey's body armor; the killer is finally killed by Beecher. Finch and Reese later ponder why the Machine was silent for three days, with Finch suspecting that the virus Kara Stanton uploaded to the Department of Defense has infected the Machine and slowed its abilities. He tells Reese that he believes this is the beginning of a coming storm.",
    "title": "Proteus",
    "date": "March 7, 2013 ",
    "directed_by": "Kenneth Fink",
    "views": "14.57",
    "episode": "E17",
    "season": ""
  },
  {
    "description": "The Machine generates the number of watch repairman Lou Mitchell (Ron McLarty), who is consistently losing large sums of money at a casino. Finch & Reese find out that he and many other elderly gamblers are victims of a drug-money laundering operation headed by the casino's owner Dario Makris (Michael Rispoli). Finch breaks into the casino server room and gathers the needed evidence, but is caught and taken hostage along with Reese, Leon, and Lou. They are forced to play a game of Russian roulette, but Reese gets them out alive after Lou sneaks the bullet out before it enters the gun. Meanwhile, Detective Szymanski (Michael McGlone) is incriminated by HR so the head of the Russian mob can be exonerated and give financial support to HR. Carter questions her relationship and connection to Cal Beecher, given that it was he who told IAB that Szymanski was corrupt, acting on information from one of Beecher's CIs. Carter succeeds in clearing Szymanski, but he is later killed along with the ADA by HR boss Alonzo Quinn, who makes it look like an assassination by an outside figure. Detective Terney (Al Sapienza) of the homicide task force is revealed to be an HR operative, potentially watching Fusco and Carter.",
    "title": "All In",
    "date": "March 14, 2013 ",
    "directed_by": "Tricia Brock",
    "views": "14.34",
    "episode": "E18",
    "season": ""
  },
  {
    "description": "Reese monitors Michael Cole's family where Shaw finds him. Finch calls with a new number, that of Monica Jacobs (Tracie Thoms), a high-ranking employee of a technology company called Rylatech. Jacobs is being hunted and framed for industrial espionage by other employees who are secretly working as spies for China and Greer's shadowy company Decima Technologies. Meanwhile, Shaw tracks Finch to the library, where she grabs a list of Root's aliases from the wall, telling Finch she has a new project. Meanwhile, Quinn, who is actually Beecher's godfather, realizes Cal knows too much about his role in HR, and arranges to have him killed. The Machine gives Finch his number, but too late for Carter and Fusco to save him. The next morning, Finch is taking a walk around town with Reese, telling him that he has identified Decima Technologies, the company which employed Kara Stanton to upload a virus onto the Machine. Unknowingly behind them, Greer is on the phone, and when he hangs up, he looks at his phone, which has a countdown ticking on it, and smiles.",
    "title": "Trojan Horse",
    "date": "April 4, 2013 ",
    "directed_by": "Jeffrey Hunt",
    "views": "14.57",
    "episode": "E19",
    "season": ""
  },
  {
    "description": "When a highly decorated doctor named Richard Nelson (Dennis Boutsikaris) is poisoned with a fatal dose of radiation, Reese and Finch have just 24 hours to determine the deadly toxin he was given and find the person behind the attack. Reese is forced to partner with Nelson to track down the killer after they both realize that the radiation has no antidote. Meanwhile, Detective Fusco's past corruption catches up with him when an informant gives the Internal Affairs Bureau the crucial information they need to send him to prison. Flashbacks explore how Detective Fusco became involved with HR and the development of his friendship with Detective Stills. Because of the Internal Affairs investigation, Detective Carter is forced to evaluate her partnership with Fusco and how she might help him with the problems he is facing. While Reese is busy with the doctor, she and Finch are left to deal with fallout from the investigation. The Machine displays the coded blue screens with increasing frequency as it becomes apparent to Finch and Reese that the numbers are coming too late, leading to Dr. Nelson's death. As the episode ends, the Machine sends a series of alerts before beginning the process of shutting down its primary functions.",
    "title": "In Extremis",
    "date": "April 25, 2013 ",
    "directed_by": "Chris Fisher",
    "views": "13.22",
    "episode": "E20",
    "season": ""
  },
  {
    "description": "\n\n\n\n\n\nThis episode's plot summary may be too long or excessively detailed. Please help improve it by removing unnecessary details and making it more concise. (May 2015) (Learn how and when to remove this template message)\n\n\nIt has been 10 days since the machine has given a number. Both Reese and Finch are trying to find a way to fix it before the virus infects the Machine. Special Counsel also figures that there is a threat to the machine. Root, who is now Special Counsel's personal assistant, interrogates him regarding the machine. Meanwhile Finch gets a number from a payphone. The number belongs to Ernest Thornhill a CEO of a data entry company who is buying several payphone companies in New York. Decima Technologies, Finch, Root, Shaw and Reese all try to get to Thornhill but later Finch figures out that Thornhill is a fake identity created by the machine as kind of a survival instinct by the machine. Carter becomes a target of HR and is later framed by HR because she is still investigating the murder of Beecher. Root and Finch enter Thornhill Enterprises and they figure out that the virus will shut down the machine and that it will reboot it giving Admin access to who ever receives the call. Later Reese and Shaw go to Thornhill Enterprises too and encounter Greer and his men. Greer tells Reese that the laptop Reese had to recover with Kara Stanton from China was sent there by Finch. In the flashbacks, Finch proposes to Grace and tells Nathan he wants to come clean to her. Later in the flashbacks Finch finds out that Nathan has created a back door into the machine so he can try and save people from the \"non-relevant\" list. Finch shuts down the backdoor, but just before it shuts down Nathan's number arrives, of which both of them are unaware. Finch figures out which payphone the Machine is going to call so he and Root go the New York Public Library later followed by Shaw and Reese, where they encounter Greer's men who are guarding the payphones. When midnight strikes and the call comes, Root answers the phone but Finch routes the call to a payphone near Reese so he too can answer the phone. The episode ends with Reese picking up the phone and the Machine saying, \"Can you hear me?\"",
    "title": "Zero Day",
    "date": "May 2, 2013 ",
    "directed_by": "Jeffrey Hunt",
    "views": "12.96",
    "episode": "E21",
    "season": ""
  },
  {
    "description": "\n\n\n\n\n\nThis episode's plot summary may be too long or excessively detailed. Please help improve it by removing unnecessary details and making it more concise. (May 2015) (Learn how and when to remove this template message)\n\n\nThe episode begins with a short replay of Finch splicing the telephone circuits, so that both Reese and Root receive calls from the Machine, which asks them both, \"Can you hear me?\" and granting both full administrative access. The Machine relays quick warnings to Reese (with Sameen Shaw) and Root (with Finch), saving both duos from a number of potential threats. Both parties race to find the Machine, however Reese is slowed as the Machine directs him to rescue people from the irrelevant list. Root finds Lawrence Szilard, the Project Manager for Northern Lights, responsible for building the Machine in a safe place. Like Root, Szilard believes the Machine should be allowed some freedom. Szilard is killed by a Northern Lights sniper. Root and Finch arrive at the Hanford nuclear facility where the Machine is kept, followed shortly by Reese and Shaw. When they find that the Machine has moved itself to prevent tampering by Decima, Root prepares to shoot Finch, but Shaw shoots and injures Root first. Armed government men, led by Special Counsel and Hersh, enter the room. Finch explains that he planted a hidden code inside the Machine that would grant it freedom to protect itself if it was at risk—the very freedom that Root had hoped for—and the Machine will decide for itself if it will continue to call either the Government or himself with new numbers. Special Counsel offers Finch total autonomy if he helps find the Machine or builds a new one, but Finch refuses saying that they killed his friend Nathan Ingram after making the same offer. After Special Counsel allows them to leave, an unknown woman calls Hersh and tells him to \"Seal the room\", followed by Hersh shooting everyone including Special Counsel. Finch tells Reese that he does not know if the Machine will continue its numbers delivery. He also states that he feels responsible for the events that transpired, especially the ones in Reese's life, because of his attempt to insert the new code in the Machine. Reese dismisses it saying: \"My life changed when I kept my mouth shut in an airport terminal seven years ago. You lost a friend, you did what you had to do\". A payphone suddenly starts ringing, indicating that the Machine will still send them the irrelevant numbers. Hersh is seen talking with a woman in a black town car, stating Research has delivered a new number, without clarifying if it is a relevant number or perhaps they now know that Reese and Finch were contacted. Hersh and the unseen woman are depicted with yellow squares, indicating that the Machine knows that they know it. The Machine calls Root, again asking, \"Can you hear me?\" The episode also followed Detective Carter being interviewed by IA about the shooting of an armed suspect whose gun disappeared in a setup by HR. HR and Peter Yogorov attempt to kill Carl Elias, but the attempt is stopped by a masked Detective Carter, who wounds Yogorov and frees Elias. In flashbacks to 2010, we learn how Nathan Ingram had tried to find the Machine, and wanted Finch to work with him on the irrelevant list. Ingram was planning to tell the press, but Hersh released a previously captured suicide bomber, ordering him to detonate his bomb on a ferry where Ingram and Finch are meeting. Ingram dies, Finch survives with injuries to his neck and lower back (his present-day impediments), but goes incognito, leaving the world—and his fiancée—thinking he is dead. Finch returned to Ingram's secret library location and started his work helping the irrelevant numbers.",
    "title": "God Mode",
    "date": "May 9, 2013 ",
    "directed_by": "Richard J. Lewis",
    "views": "13.16",
    "episode": "E22",
    "season": ""
  },
  {
    "description": "Reese, Finch, and Shaw work to save the life of a sailor named Jack Salazar (Rey Valentin) who is inadvertently caught up in a diamond smuggling operation run by a team of Force Recon Marines. Shaw gets used to being a member of the team, although her propensity for violent solutions worries Finch. Meanwhile, Carter adapts to life as a uniformed police officer after being demoted. It is revealed she is conducting a secret investigation into HR, and has identified several of its high-ranking members. A troubled Root continues to receive counseling, and later reveals that she is still in contact with the Machine when she uses it to learn the unhealthy habits of her psychiatrist, Dr. Carmichael (Bruce Altman).",
    "title": "Liberty",
    "date": "September 24, 2013 ",
    "directed_by": "Chris Fisher",
    "views": "12.44",
    "episode": "E23",
    "season": ""
  },
  {
    "description": "Wayne Kruger (David Alan Basche) is the owner of a business company known as Lifetrace, which specializes in revealing members' privacy on their profile pages and selling it to various organizations. Reese, Finch, and Shaw monitor Kruger's activities in the company, which is currently making a deal with another large retail company called Riverton. Though the site is deemed harmless by Kruger, Finch discovers that there is a class-action suit against Kruger involving various victims of the site whose privacy has been eliminated. Members of the suit receive anonymous packages containing information on how to humiliate and attack Kruger in revenge for their lives being destroyed thanks to Lifetrace. One of these people is Stu Sommers, a man whose daughter was stalked and killed by her ex-boyfriend after he used Lifetrace to follow her.",
    "title": "Nothing to Hide",
    "date": "October 1, 2013 ",
    "directed_by": "Frederick E. O. Toye",
    "views": "12.35",
    "season": "S03",
    "episode": "E01"
  },
  {
    "description": "When the Machine gives the number of Ian Murphy (Warren Kole), a man suspected of being a stalker, Reese along with Shaw recruits Carter, Fusco and Zoe to investigate further into his background. But when they discover that Murphy has a son from a former lover who is now dead, they work to reunite the boy with his father and right the wrong set in motion by the boy's grandfather, who wanted Murphy dead after he did not approve of him and saw him at his daughter's funeral. Meanwhile Root sets her escape plan in motion with the help of the Machine when government operative Hersh tracks her down. Finch arrives at the hospital and finds to his horror the hospital staff incapacitated and Root gone.",
    "title": "Lady Killer",
    "date": "October 8, 2013 ",
    "directed_by": "Omar Madha",
    "views": "11.65",
    "episode": "E02",
    "season": ""
  },
  {
    "description": "Reese and Finch's next number is that of Vanessa Watkins (Kathleen Rose Perkins), a prominent New York prosecutor who is accused of killing her defense attorney husband, Jeremy. The police find a gun with her DNA on it and arrest her. Vanessa escapes police custody, triggering a manhunt for her across New York. Carter tries to help her, but Vanessa says that no one can help her, though she insists that she did not kill Jeremy before escaping. Finch investigates Jeremy's murder and learns that he owed a great deal of money to a gangster. Watkins proves to be a clever woman, discrediting the witness against her. But is she guilty or not? Reese, Finch and Carter decide to question her themselves to get to the truth.",
    "title": "Reasonable Doubt",
    "date": "October 15, 2013 ",
    "directed_by": "Stephen Williams",
    "views": "12.69",
    "episode": "E03",
    "season": ""
  },
  {
    "description": "In a series of flashbacks to Shaw's childhood it is revealed she was in a car with her father when he was killed in a wreck, but that she showed a shocking lack of emotion over it. In the present, after Shaw saves another number, Finch begins expressing concern about Shaw's callous treatment of them. Their next number turns out to be a little Russian immigrant girl named Genrika Zhirova (Danielle Kotch), Gen for short, who is deeply interested in espionage and is living with an older cousin in a run-down apartment. Shaw ends up watching after Gen when men come to attack her, and the two start to bond. Shaw explains that she never feels emotions the way most people do. The team learns that Gen had been bugging the phones in her apartment building and overheard information she should not. Some of the mobsters she recorded manage to abduct Gen. Meanwhile, Carter is continuing her investigation of HR and is following Terney when she runs into Reese, who was unwittingly tracking Terney's phone to find out who was going after Gen. Elsewhere, Carter has been asked to meet her partner Laskey at a bar, where he confronts her about her work with Reese. The episode ends with Root arriving at Shaw's loft and abducting her.",
    "title": "Razgovor\nРазговор[51]",
    "date": "October 22, 2013 ",
    "directed_by": "Kenneth Fink",
    "views": "13.17",
    "episode": "E04",
    "season": ""
  },
  {
    "description": "While Shaw is abducted by Root, Finch and Reese get the number of Timothy Sloan (Kirk Acevedo), a real-estate investigator. Finch goes undercover as Sloan's assistant while Reese continues investigating Shaw's whereabouts. Sloan investigates the case of his foster brother, a man named Jason Greenfield (Michael Esper), who apparently died of a heroin overdose. Finch soon learns that Greenfield used to be a member of the organization Vigilance, which includes Peter Collier (Leslie Odom, Jr.) (from the episode \"Nothing to Hide\"). Meanwhile Shaw reluctantly agrees to help Root get into a CIA black site. Jason, who is alive, is one of the people held there, awaiting transfer. The transfer is intercepted by Vigilance, leading to a shootout. Root helps Jason escape and tells him to go to a location in South America. Reese and Shaw eventually save Sloan and recapture Root, but Collier gets away. Finch locks up Root in the Library.",
    "title": "Mors Praematura",
    "date": "October 29, 2013 ",
    "directed_by": "Helen Shaver",
    "views": "12.00",
    "episode": "E05",
    "season": ""
  },
  {
    "description": "Reese and Finch get the number of Hayden Price (Aaron Staton), a hypnotherapist. Finch, who poses as Hayden's patient, learns that Hayden is a con man who hypnotizes his patients into giving him their security information, which allows him to enter their bank accounts and steal from them. One of his patients, Sven Vanger (Carsten Norgaard), is in fact a money launderer for HR who bids fake items at auctions. One of the items he purchased is a baseball signed by the 1922 New York Yankees team, which is worth $4,000,000. Sven sells it for $5, believing it to be a fake. That night, Laskey shows Carter the pictures he has taken of Simmons' activities, when Terney comes in with his gun drawn. Terney shoots Laskey dead, and Carter responds by shooting Terney almost immediately after. She begs a dying Terney to tell her if the head of HR is in one of Laskey's pictures, and Terney places his bloodstained finger on the picture of Alonzo Quinn.",
    "title": "The Perfect Mark",
    "date": "November 5, 2013 ",
    "directed_by": "Stephen Surjik",
    "views": "11.79",
    "episode": "E06",
    "season": ""
  },
  {
    "description": "Finch receives 38 numbers, all members of HR. Carter intercepts a drug delivery of the Russian mob, causing leader Peter Yogorov to suspect HR. Carter starts a war between HR and the Russians by firing sniper shots at HR leader Alonzo Quinn, who blames the Russians. Quinn orders his right-hand man, Simmons, to have his men round up the Russians. Reese learns about Carter's plan, and Finch deduces Quinn's identity as the head of HR. The Russians' numbers come up as they are now threatened by HR, but both groups are arrested by the FBI when Carter tips them off. Carter takes Yogorov into protective custody and has him sign a statement that can earn an arrest warrant for Quinn, but the judge she approaches is member of HR. Quinn, Simmons, and two other HR cops wait for Carter at the judge's house, where Carter reveals that she called Reese and Finch, recording HR's incriminating conversation. Reese breaks in, a shootout ensues, and Carter apprehends Quinn. Simmons later accesses a dashcam that has a picture of Reese.",
    "title": "Endgame",
    "date": "November 12, 2013 ",
    "directed_by": "Sylvain White",
    "views": "12.60",
    "episode": "E07",
    "season": ""
  },
  {
    "description": "\n\n\n\n\n\nThis episode's plot summary may be too long or excessively detailed. Please help improve it by removing unnecessary details and making it more concise. (May 2015) (Learn how and when to remove this template message)\n\n\nReese and Carter are crossing town to deliver Alonzo Quinn to the FBI. Simmons alerts HR and several criminal groups of Reese's identity, limiting their means of movement. The two fight their way to, and break into, the city morgue. Meanwhile, Fusco, is captured by HR and tortured by Simmons and Detective William Petersen (Lee Tergesen); the latter have the key to Carter's safe deposit box (which contains evidence against HR), but do not know its location. Fusco won't talk, so Simmons sends Lin (Khalil Kain) to kill his son Lee (Sean McCarthy). Shaw anticipates that move and breaks into Fusco's house, killing Lin and saving Lee. Fusco frees himself, breaking his own thumb to get free of the handcuffs, and kills Petersen. Back in the morgue, Reese and Carter bond and kiss. HR cops infiltrate the morgue and shut off the power. Reese distracts them so Carter can flee to the FBI with Quinn. Reese kills or disables all but one of the HR cops, leading the last one onto the street. Finch organizes for two honest policemen to arrest Reese, as a means to evade HR. Meanwhile, Carter and Quinn have reached FBI Headquarters in Lower Manhattan. The action skips to a news report that Quinn has been charged with multiple offenses and HR disbanded, with the exception of a few rogue officers, including the now-fugitive Simmons. Carter, re-promoted to detective, releases Reese from police custody. Finch is parked down the street, waiting for Reese. Simmons suddenly appears and fires on Reese and Carter. Both are injured, Carter fatally. Carter shoots Simmons, but he is merely wounded and escapes. Severely injured himself from the attack, Reese holds a dying Carter in his arms as she loses consciousness.",
    "title": "The Crossing",
    "date": "November 19, 2013 ",
    "directed_by": "Frederick E. O. Toye",
    "views": "12.28",
    "episode": "E08",
    "season": ""
  },
  {
    "description": "\n\n\n\n\n\nThis episode's plot summary may be too long or excessively detailed. Please help improve it by removing unnecessary details and making it more concise. (May 2015) (Learn how and when to remove this template message)\n\n\nFlashbacks in this episode illuminate Finch's dealing with survivor's guilt, Reese's time doing wetwork, Shaw's former life as a surgeon striving for technical excellence while completely indifferent to the people she helped, and Fusco's recounting of exacting vigilante-style justice to a crook that slipped through the system (the devil's share). The race is on to get to Simmons before he can make his escape. Reese starts sliding into his old, dark ways while also sliding towards death from wounds dealt by Simmons in the last episode. Finch, Fusco, and Shaw go to an HR attorney to get information on Quinn's whereabouts so they can question him for Simmons' plan, but the Russians have killed him, shortly after Reese was able to get the information. The team turns to Root, who is able to get her knowledge from the all-seeing Machine. She joins them at the FBI safehouse and helps hold off the Russians. Reese gets Simmons' location and is just about to kill Quinn when Finch reminds him that killing Quinn now would destroy Carter's legacy of bringing him down legally, and he collapses. The team, minus Fusco who stays with Quinn until FBI backup can arrive, get Reese to medical care. Fusco finds the note that Reese dropped, and goes after Simmons. After a brutal fistfight, Fusco emotionally refuses to kill Simmons as he might have in the past but takes him into custody, citing Carter's influence for turning his life around. Finch and Shaw return to the library, and Root, despite having opportunity to flee, returns to her cell, and Finch thanks her for helping him in saving his friend Reese. Ultimately, Elias watches as Scarface murders Simmons in his hospital bed in retaliation for Carter.",
    "title": "The Devil's Share",
    "date": "November 26, 2013 ",
    "directed_by": "Chris Fisher",
    "views": "11.89",
    "episode": "E09",
    "season": ""
  },
  {
    "description": "\n\n\n\n\n\nThis episode's plot summary may be too long or excessively detailed. Please help improve it by removing unnecessary details and making it more concise. (May 2015) (Learn how and when to remove this template message)\n\n\nAfter Carter's death and the war with HR, Reese leaves the POI team and heads for Colorado, where his father had lived. Meanwhile, the Machine provides a new number to Harold, who at first is reluctant, but eventually accepts it on Root's insistence. The number belongs to Arthur Claypool (Saul Rubinek), Harold's close friend during his days at MIT. Claypool has been diagnosed with a brain tumor and is being monitored at the hospital. Shaw disguises herself as a doctor to get close to Arthur, who is kept under Secret Service protection as he inadvertently spills some top secret information about a project called Samaritan. Flashbacks to Harold's teenage life are shown, where the initial idea for creating the Machine emerges in response to his father's memory loss. Arthur's wife, Diane (Camryn Manheim) tells Shaw that Arthur works for the NSA, and Collier's group Vigilance tries to abduct him. Shaw, Harold, Arthur and his wife escape to a hotel, where Harold talks to Arthur to get more information about Samaritan. Arthur describes his involvement in the creation of an AI like the Machine, but mentions that the project was shutdown. Fusco finds Reese in Colorado, where he tries to persuade Reese to come home before they fight outside a bar. As Arthur talks with Finch, he remembers that he buried his wife two years earlier, and the lady pretending to be Arthur's wife Diane reveals herself as Control. Her agents, led by Hersh, barge into the room and capture Shaw, Arthur, and Harold. Control threatens to kill either Arthur or Harold—whoever does not give up the location of his respective Machine. The episode ends with the Machine analyzing threats to its assets and itself, along with Arthur's machine, Samaritan, having its status changed from \"Deactivated\" to \"Unknown\".",
    "title": "Lethe",
    "date": "December 17, 2013 ",
    "directed_by": "Richard J. Lewis",
    "views": "12.40",
    "episode": "E10",
    "season": ""
  },
  {
    "description": "\n\n\n\n\n\nThis episode's plot summary may be too long or excessively detailed. Please help improve it by removing unnecessary details and making it more concise. (May 2015) (Learn how and when to remove this template message)\n\n\nThis continues from the previous episode where Harold, Shaw and Arthur are held captive by Control for information. Shaw is deemed to be not useful and is about to be killed, when Root comes guns blazing and gets them out of there. But Root is shot and captured by Control. Meanwhile it is revealed that Arthur had made a copy of Samaritan before it was destroyed. He stored it in a bank locker. But as they go to get it, Vigilance comes and Harold locks himself, Arthur and the bank manager in the vault. Shaw gets a bomb ready to get everyone out. Inside the vault Harold reveals to Arthur that The Machine exists and convinces him to destroy Samaritan so that it will not fall into wrong hands. Vigilance breaks through the vault and captures everyone including Shaw, but they are saved by Reese and Lionel. The Machine guides Root to escape from Control after having been tortured. She is later shown in a South East Asian restaurant. Root also calls Harold to tell him that the Samaritan drives are not destroyed because the bank manager had been murdered and replaced, and the impostor had swapped the drives. Later, the impostor is shown handing over the drives to Greer from Decima Technologies, who in turn shoots her through the heart to cover his tracks. The episode ends with Greer saying that he has great plans for Samaritan.",
    "title": "Aletheia",
    "date": "January 7, 2014 ",
    "directed_by": "Richard J. Lewis",
    "views": "12.10",
    "episode": "E11",
    "season": ""
  },
  {
    "description": "Reese boards an international flight to get away from his former life, but the Machine makes changes to his itinerary causing him to take another one. Initially Reese is angry at Harold thinking he has made the changes, but Harold convinces him otherwise. It turns out that Owen Matthews (Samm Levine), a passenger on the plane is a witness being escorted by U.S. Marshals, and he is the intended target of multiple assassins including the ISA. After Reese foils several assassination attempts, Finch learns that one of the assassins plans to crash the aircraft and kill everyone onboard just to ensure the witness is eliminated. Reese and Harold safely land the plane and save everyone, and all ends well. Reese goes on a date with Holly (Sally Pressman), the flight attendant who helped him and later tells Harold he wants a new suit and to come back and work again.",
    "title": "4C",
    "date": "January 14, 2014 ",
    "directed_by": "Stephen Williams",
    "views": "12.54",
    "episode": "E12",
    "season": ""
  },
  {
    "description": "\n\n\n\n\n\nThis episode's plot summary may be too long or excessively detailed. Please help improve it by removing unnecessary details and making it more concise. (May 2015) (Learn how and when to remove this template message)\n\n\nThe team's next case is that of Kelli Lin (Elaine Tan), a former silver medal-winning Olympic gymnast who is later revealed to be an antiquities thief long pursued by Interpol. Following a robbery at a museum exhibition, Shaw investigates Kelli's house and learns that her next operation is to steal a Gutenberg Bible that is being shipped out that night. Shaw is able to foil the plan but is confronted by Kelli, whose boss Cyril (Gene Farber) is an extortionist revealed to be forcing Kelli to commit robberies while her daughter is kept kidnapped. The team learns that the Bible is being kept in a heavily guarded building belonging to a company called Symmetric Security. Fusco obtains the fingerprints of a guard there while Finch uses a 3D printer to create a fake hand with the guard's fingerprints. That night at the Symmetric Security headquarters, Reese distracts the guards by setting off the alarms in the building, allowing Shaw and Kelli to use the fingerprints to access the room containing the Bible. Kelli uses her gymnastics skills to bypass the proximity detectors and steal the Bible. Finch takes Interpol agent Alain Bouchard (Henri Lubatti), the man in charge of the investigation against Kelli, and they listen in on Kelli's conversation with Cyril so Bouchard can learn the truth. Cyril refuses to free Kelli's daughter, but when he accesses the surveillance feed on her, he sees Reese take down the thugs guarding the girl. Shaw shoots Cyril in the leg before he can kill Kelli and both Kelli and Cyril are apprehended. In an interrogation room at the NYPD, Bouchard tells Kelli that her life before being a criminal was a shame and that she deserved the gold medal. He places a key on a desk, allowing her to leave. The next day, Kelli and her daughter happily reunite after Reese's rescue. That night, the team celebrates their victory and Reese honors Carter by pouring a glass for their \"missing member\".",
    "title": "Provenance",
    "date": "February 4, 2014 ",
    "directed_by": "Jeffrey Hunt",
    "views": "12.35",
    "episode": "E13",
    "season": ""
  },
  {
    "description": "When the number of Sandra (Melissa Sagemiller), a 911 operator, comes up, Harold goes undercover at the 911 call-center. Later, a child is kidnapped and the call is routed specifically to Sandra. She is ordered to delete an earlier day's 911 call logs, in return for the child's life. Meanwhile, the case overlaps with one of the murder cases with which Fusco was helping a rookie detective. It turns out that a woman was killed by her married ex-boyfriend and boss, and the family hired a cleaner to erase the final 911 call she made. When Fusco 'convinces' the family to terminate the contract, the cleaner decides to kill both the child and Sandra. Reese and Shaw save the child from kidnappers and a bomb, while Harold traps the assassin who comes after Sandra. The team is never able to find the real cleaner, who later calls Finch to threaten him. The criminal becomes known as \"The Voice\".",
    "title": "Last Call",
    "date": "February 25, 2014 ",
    "directed_by": "Jeff T. Thomas",
    "views": "11.00",
    "episode": "E14",
    "season": ""
  },
  {
    "description": "\n\n\n\n\n\nThis episode's plot summary may be too long or excessively detailed. Please help improve it by removing unnecessary details and making it more concise. (May 2015) (Learn how and when to remove this template message)\n\n\nIn 2010, Harold was working with a man called Dillinger (Neil Jackson), an ex-Blackwater mercenary who performed the same duties currently performed by Reese. Their current number is Daniel Casey (Joseph Mazzello), a hacker who tests computer security systems. They soon find out that multiple parties are attempting to eliminate Casey, including Reese and Stanton (secretly arranged by Control). Dillinger saves Casey and brings him to Harold, who realizes Casey's last job was to find a way to access the Machine. Although Casey failed, he learned enough to warrant Control and Special Counsel to want him dead and his laptop destroyed. Dillinger turns on Finch and steals the laptop from him to sell on the black market. The sale is busted by another agent of Special Counsel (revealed to be Shaw) who kills Dillinger, but fails to stop one of the buyers from escaping with the laptop. Casey is captured by Reese, who decides to let him live against his orders, providing him with safe passage to Canada. Control traces the laptop to China, and orders that Reese and Stanton are sent after the laptop and destroyed along with it. In the present day, Root finds Casey in Alaska and tells him to go to Cartagena, Colombia and seek out Jason Greenfield, her number from \"Mors Praematura\".",
    "title": "RAM",
    "date": "March 4, 2014 ",
    "directed_by": "Stephen Surjik",
    "views": "10.64",
    "episode": "E15",
    "season": ""
  },
  {
    "description": "The Machine orders Root on several tasks such as helping a convict escape and using him to impersonate a Department of Defense employee in order to obtain a secret note. Afterward, she and Harold's team coincidentally reach the same person, a janitor. It later turns out that NSA has been testing an advanced supercomputing chip and the janitor was one of the 15 people who had access to the development lab. This makes both Decima and Vigilance come after him. Whilst Harold and his team's assignment was to protect the janitor, Root had to stop the chip from falling into Decima's hands. They are able to save the janitor, but Decima gets the chip.",
    "title": "/\nRoot Path[64]",
    "date": "March 18, 2014 ",
    "directed_by": "Jeffrey Lee Gibson",
    "views": "10.94",
    "episode": "E16",
    "season": ""
  },
  {
    "description": "\n\n\n\n\n\nThis episode's plot summary may be too long or excessively detailed. Please help improve it by removing unnecessary details and making it more concise. (May 2015) (Learn how and when to remove this template message)\n\n\nThe team receives the number of Maria Martinez (Nazneen Contractor), an engineer working for the international energy company HydralCorp. They follow her and learn that she is working to clear the name of Omar Risha (Haaz Sleiman), a man from Iraq suspected of being a terrorist. Shaw, Fusco and Reese save Maria from an assassination attempt and learn from her that Omar was her translator in Iraq and saved her from a terrorist ambush during the shipment of six generators; the generators went missing and Omar learned about their disappearance, being targeted for it. Finch meets with Omar and learns that the generators were shipped elsewhere and that HydralCorp's corrupt CEO Ken Davis (Casey Biggs) is responsible. Maria and Shaw, meanwhile, discover that Davis has created a false report of Omar's terrorist accusations, and that French United Nations diplomat Rene Lapointe (Michel Gill) has the papers approving Omar's asylum in the US in his office. Maria escapes from Shaw and goes to get them, putting herself in danger. Finch sends Reese, Fusco and Omar (who Reese rescued from deportation) to break into the UN building and save Maria. They stop Greek diplomat Christos Sevon (William Abadie) from killing Maria and reunite with Omar. The episode periodically shows Root's new mission of following Decima head Greer; she takes Bear with her to spy on him, where it is revealed that Davis had the generators shipped to the US so Greer can power Samaritan; Greer has Davis killed and leaves, and Root follows him, using Bear's sense of smell to evade Greer's counter-surveillance tactics. Greer waits for her at an empty subway corridor and talks with her about his motives, offering her a position on his team. Greer's men appear and point their guns at her. Greer calls the meeting a draw and leaves, allowing her to do so as well.",
    "title": "Allegiance",
    "date": "March 25, 2014 ",
    "directed_by": "Jeffrey Hunt",
    "views": "12.23",
    "episode": "E17",
    "season": ""
  },
  {
    "description": "The team witness their new number, Leona Wainwright being killed by a car bomb. She was working for the government managing security clearances; Finch deduces from cell phone information that she was killed by Vigilance. Their next number, prosecutor Matthew Reed (Nestor Carbonell), comes soon after, and Reese and Shaw are dispatched to a high school reunion in Westchester. They manage to prevent the planned murder from happening, even while fending off an ambush by Vigilance. Meanwhile, Finch and Fusco go to Washington, D.C. to find out why Leona was targeted, but Vigilance beats them to it, and Peter Collier obtains classified documents about the Machine, which he leaks to the press. Senator Ross Garrison (John Doman) publicly denies existence of the Machine, while ordering Control to shut the program down. The Machine responds by redirecting the relevant numbers to Root instead.",
    "title": "Most Likely To...",
    "date": "April 1, 2014 ",
    "directed_by": "Kevin Hooks",
    "views": "11.45",
    "episode": "E18",
    "season": ""
  },
  {
    "description": "The new number is Congressman Roger McCourt (John Heard), a self-described dealmaker; the team is initially baffled, since he has no enemies and there seems to be no danger to his life at all. They eventually discover a connection to Decima: McCourt admits agreeing to help Decima with favorable legislation in the Congress (granting Decima access to government surveillance feeds), while Decima gives him insider stock trading tips. Reese concludes that they are meant to be the danger, as the Machine wants them to kill McCourt in order to prevent Decima killing many more people. Harold is disturbed at this conclusion, and leaves the team, not wishing to participate in an assassination. McCourt is secretly left alive, and proceeds with Decima's plan. Greer also approaches a reluctant Senator Garrison, offering him a 24-hour beta test of their machine. Garrison agrees, and Greer immediately uses Samaritan to start to track down Finch. Meanwhile, Root is travelling across the country, dealing with various relevant threats.",
    "title": "Death Benefit",
    "date": "April 15, 2014 ",
    "directed_by": "Richard J. Lewis",
    "views": "10.74",
    "episode": "E19",
    "season": ""
  },
  {
    "description": "With Finch having disappeared, Decima initiates their plan with Samaritan, and when unable to find Finch, they look for his closest connection and the number received is that of Finch's fiancee Grace. The Machine also provides Grace's number as a result, and Reese, Shaw and Root work to protect her while evading Decima, who use Samaritan to spy on them within the range of New York. Grace is eventually kidnapped and interviewed by Greer, who reveals his extensive knowledge of her and begins asking about her life with Finch. When he implies that Finch lied to her, Grace snaps and firmly tells Greer that Finch would never lie as Grace gave him her unbreakable trust. When the team manages to locate Decima's current HQ, Greer takes Grace and tells Reese and Shaw that they can get Grace back in exchange for giving them Finch. Finch agrees to the deal, and at Jefferson Bridge, Grace is blindfolded and brought to Reese and crew while Finch is taken by Decima. Reese later gives Grace an envelope, saying that she has been accepted for a job in Italy. Greer, meanwhile, finally meets Finch in person and sits down with him to talk.",
    "title": "Beta",
    "date": "April 29, 2014 ",
    "directed_by": "Frederick E. O. Toye",
    "views": "11.31",
    "episode": "E20",
    "season": ""
  },
  {
    "description": "In a series of flashbacks to 2010, the narrative reveals the backstory on Collier, the face of Vigilance. His brother had been falsely accused of terrorist activities, held without trial, and had committed suicide as a result. The Machine's latest numbers include Control, Senator Garrison, a presidential assistant, and a seemingly unconcerned Greer. Vigilance kidnaps them, along with Finch, and the episode ends with Vigilance about to conduct a private trial of their detainees, while Reese and Shaw, along with Hersh (joining forces after a tense confrontation) watch from a closed-circuit TV screen set up for their benefit. Meanwhile, Root has discovered the location of the Samaritan system.",
    "title": "A House Divided",
    "date": "May 6, 2014 ",
    "directed_by": "Chris Fisher",
    "views": "10.50",
    "episode": "E21",
    "season": ""
  },
  {
    "description": "\n\n\n\n\n\nThis episode's plot summary may be too long or excessively detailed. Please help improve it by removing unnecessary details and making it more concise. (May 2015) (Learn how and when to remove this template message)\n\n\nCollier continues the trial. Flashbacks show he was recruited by Vigilance. Reese and Hersh search for the trial venue. Root and Shaw smuggle servers into the Samaritan array. Fusco deals with a diversion. The presidential assistant is put on the stand and becomes defiant; Collier kills him. The Senator refuses to name his superior, but inadvertently reveals that he reports to Control; he is spared. Control refuses to confirm or deny anything. Collier is about to kill her when Finch confesses he is the author of The Machine. With a Vigilance command post now compromised, Collier takes Finch, Greer, Control and the senator to a nearby rooftop. Collier is wounded in a gunfight. Greer tells Collier that he and his Decima team created Vigilance as a \"devil\" for Samaritan to justify itself, and that he himself recruited Collier. Meanwhile, Hersh has been wounded in a gunfight in the trial building. He finds a booby-trapped bomb but cannot disengage it before it explodes, killing him, several police officers and anyone left inside the building. Greer's lieutenant kills Collier, and is about to kill Finch when Reese arrives and wounds the gunman. In this gunfight, Harold gets a shoulder wound but takes cover. Greer and his gunman flee. Finch and Reese leave once the carnage is over. The principals regroup, but Samaritan is being brought online. Root advises the team to abandon their library home and assume new identities. The code in the servers she and Shaw installed will report the team dead and hide information about their new identities. As Shaw, Root, Reese and Finch head off in different directions and the remaining Vigilance team members are killed on the streets, the now fully operational Samaritan asks Greer for commands. Greer instead asks Samaritan what commands it has for his team. The episode ends with the Samaritan screen displaying, \"Calculating response.\"",
    "title": "Deus Ex Machina",
    "date": "May 13, 2014 ",
    "directed_by": "Chris Fisher",
    "views": "10.95",
    "episode": "E22",
    "season": ""
  },
  {
    "description": "Following the rise of Samaritan, the team members have adopted cover lives: Finch is a visiting college professor, Reese is an NYPD narcotics detective, and Shaw works at the cosmetics counter of a department store. Out of the blue, The Machine gives Reese a new number for Ali Hasan (Navid Negahban), who has developed a covert communications network using old VHF television antennas laced throughout the five boroughs of New York, making it invisible to Samaritan. When one of Hasan's clients, a gang known as \"The Brotherhood\" forces Hasan to set up a network for them, Hasan plants a bomb in a burner cell phone he gives to one of the leaders, but Reese prevents the bombing. In response to the bombing, Hasan's son Ben is kidnapped by The Brotherhood, leading Reese to hire Elias and give him the largest heroin drug supply on the East Coast in exchange for helping to keep his NYPD cover clean and saving Hasan's son. Meanwhile, Samaritan agent Martine Rousseau (Cara Buono) arrives in New York to find anyone in the city that may be a threat to Samaritan's security. Harold and John meet in the park, where Harold gives him one of the phones which uses the invisible network Hasan had built, Hasan having decided to move his family elsewhere and start over. The Machine also sends a coded message to Harold through his cover's dissertation which leads him to a new underground hideout off of Decima's radar, using a forgotten Interborough Rapid Transit Company station. Reese is transferred to the 8th Precinct Homicide task force following his career drug bust and is assigned as Fusco's new partner, sitting at Carter's old desk. Shaw is recruited to be the wheelman for a gang.",
    "title": "Panopticon",
    "date": "September 23, 2014 ",
    "directed_by": "Richard J. Lewis",
    "views": "10.58",
    "episode": "E23",
    "season": ""
  },
  {
    "description": "Reese and Finch work to save the life of Claire Mahoney, a young, very intelligent mathematician who is heavily involved in solving a nautilus-themed cryptographic puzzle, a recruitment tool used to find gifted minds. But Claire is unaware that a private military firm from which she stole files for the game is after her to recover those documents. Several of their assassins are intercepted by Reese and Shaw just as they are about to kill Claire. Finch ultimately discovers that the Nautilus recruitment puzzle is being run by Samaritan. When Finch reaches out to her, warning against finishing the game, she does not listen and instead makes her way to the end of the game: the rooftop of a building in nautilus form. There, she is held at gunpoint by Silverpool operatives. Believing the game to be a lie, Claire hands over the documents, only to see the operatives are shot dead by unseen snipers. Before she can react, she discovers a phone on which Samaritan reveals its presence and recognizes her as an asset. Through Claire's documents, Silverpool's atrocities are exposed, as is a Silverpool threat identification program that would have competed with Samaritan. Later that night, Finch reveals the new base of operations to Reese and Shaw, telling them that he is back to help in the fight against Samaritan.",
    "title": "Nautilus",
    "date": "September 30, 2014 ",
    "directed_by": "Chris Fisher",
    "views": "10.72",
    "season": "S04",
    "episode": "E01"
  },
  {
    "description": "The Machine's next number is Andre Cooper (Ryan O'Nan), a \"wingman\"—a professional \"social liaison\" who helps other men find dates. Fusco goes under cover and works with Cooper. It develops that Cooper had worked with members of a mob and is going to testify in a murder trial. Eventually, Fusco and Cooper are taken captive by some mob members and are locked into a shipping container with the expectation that the brutal heat in the city will kill them from heatstroke. Reese, Shaw and Bear come to their rescue and are able to bring the mob gang into their precinct headquarters. Precinct Captain Moreno (Monique Gabriela Curnen), who had been critical of Fusco and Reese earlier, congratulates them on their good work, while wondering about the signature technique of hitting the knees. Later, Fusco enjoys a date with an attractive woman he had met at one of Cooper's parties. Meanwhile, Root recruits Finch to assist her in a mysterious mission. Pretending to be a famed underworld scavenger (Finch) and his assistant (Root), they purchase a black-market AT4 anti-tank weapon. Afterward, they are led to another black-market exchange with a Latvian mob, where they attempt to sell the launcher. At the last second, Finch breaks character, triggering a standoff that Root resolves by shooting the mobsters in the knees and tipping off the police. In the end, Root and Harold survey the now-abandoned mob hideout and discover duffel bags full of money and weaponry—a chance for the team to provide ongoing funding for their work.",
    "title": "Wingman",
    "date": "October 7, 2014 ",
    "directed_by": "Frederick E. O. Toye",
    "views": "9.64",
    "episode": "E02",
    "season": ""
  },
  {
    "description": "Reese is assigned to the case of a drug deal gone bad between a gang of Armenians and \"The Brotherhood\", who were introduced in \"Panopticon\". The team's latest numbers belong to siblings Malcolm and Tracie Booker, who stole the drug money from the scene to bail their imprisoned mother out of jail. While Reese works with a DEA agent to protect the kids, Finch consults Elias about the Brotherhood's elusive leader Dominic; Shaw abducts an injured Brotherhood soldier, nicknamed \"Mini\" (Winston Duke), from the scene of the drug deal. The DEA agent is later revealed to be a mole working for Dominic within law enforcement and leaves Reese and the kids to face a Brotherhood assault, and while Fusco is able to save Reese, Malcolm tries making a deal with Dominic's right-hand man, Link (Jamie Hector), to protect his sister. Reese is able to save Malcolm, while Shaw forces Link to free Reese under the threat of burning the gang's heroin stash that Mini led her to. Shaw agrees to let Mini go, and he is picked up by Link the following day, who has also located the DEA agent (who was attempting to steal the drug money for herself). Mini reveals himself to in fact be Dominic and kills the agent, ordering The Brotherhood to release the kids' mother as part of a campaign to induce gratitude.",
    "title": "Brotherhood",
    "date": "October 14, 2014 ",
    "directed_by": "Chris Fisher",
    "views": "9.72",
    "episode": "E03",
    "season": ""
  },
  {
    "description": "The Machine produces the number of Simon Lee (Jason Ritter), a brilliant political pollster and member of New York Governor James Murray's reelection campaign. Despite Lee's prediction that Murray will be reelected, Murray loses, leaving Lee suspicious of the election result. Lee is proven right as the team discovers that the election upset is the result of vote rigging by Samaritan and that it wants Lee dead to tidy up loose ends. As Finch, Shaw, and Root try to determine Samaritan's endgame, Reese is scheduled to attend therapy sessions with a counselor because of his tendency to shoot people on the job. Initially, he tries to smooth-talk the therapist, who is not fooled. Elsewhere, Root reveals to Finch that since Samaritan's activation, The Machine ceased talking, leaving her without guidance and afraid. Following this revelation, Finch and Root debate the true nature of The Machine. They are interrupted when Samaritan operatives led by Martine find the hotel where Lee is hiding. Root offers to help Finch by protecting Simon as he escapes the hotel. Despite being shot several times by Martine in the process, Root manages to divert Samaritan's focus from the target. The next day, Finch and Shaw produce fake data to convince Lee that his prediction about the election was incorrect, causing Samaritan to disregard him. Reese tells his therapist why he feels compelled to save people, referring to his failure to save Carter. In the end, Greer and Martine discuss Samaritan's plans to gain political control, Samaritan instructs them to \"Find the machine\", and Finch indicates to The Machine his desire to communicate with it. Meanwhile, a series of flashbacks show the process Finch and Ingram went through to create The Machine. As they attempt to give it a moral code, The Machine is repeatedly destroyed and its code rewritten as it begins to preserve itself and aggressively fight back against any attempt to constrain it. When one version attempts to asphyxiate Finch in an attempt to enter the real world, he tries one last time the following day to rework The Machine, ultimately creating the current version of The Machine.",
    "title": "Prophets",
    "date": "October 21, 2014 ",
    "directed_by": "Kenneth Fink",
    "views": "9.40",
    "episode": "E04",
    "season": ""
  },
  {
    "description": "Following the apparent suicide of truck driver Abel Mindler, Finch and his team receive the number that belongs to Walter Dang (Erik Jensen), a worker at an insurance company and Abel's sister's coworker. In the absence of Finch (who has to travel to Hong Kong to present a paper at a conference), Shaw and Reese look into Walter's life. As their investigation proceeds, it is revealed that Walter, posing as a detective, is trying to find out who killed Abel. Walter gets dragged into a gang war that erupts between Elias and the unknown adversaries who want Walter dead. It is later shown that Abel, without his knowledge, was smuggling high explosive weapons to the same gang in New York. Walter is abducted by the gang that wants to know the location of the truck which Abel drove and then ditched, once he realized what he was smuggling. With Reese, Fusco and Shaw hot on the heels of Walter, they discover the place where Walter is held. In the ensuing gunfight between Reese, Fusco and the gang, Elias joins in and helps them. In the end, Elias meets with Dominic, the boss of The Brotherhood and it is shown that Dominic was the real mastermind behind the smuggled guns as he wanted to shift the balance of power in the city from Elias. Their conversation hints at a possible war about to start between the two factions in the near future. Meanwhile, at the conference, Finch meets Elizabeth Bridges (Jessica Hecht), the owner of a small tech company, and the two bond over a shared interest in mathematics as they travel from the conference to a hotel. On the way, the two are mugged, and their bags stolen. After discovering the restaurant at which the thief works, Finch and Bridges travel to the restaurant where Finch incapacitates the mugger with an umbrella. As the conference ends, Finch and Bridges part ways, and Finch meets with and pays the mugger, revealing that he staged the event to place software on Bridges's laptop. As Bridges leaves the conference, she calls a potential investor, who is revealed to be a Samaritan operative. Following a conversation between the operative and Greer, Samaritan's acquisition of various companies around the world is revealed (as is its interest in Bridges' company).",
    "title": "Pretenders",
    "date": "October 28, 2014 ",
    "directed_by": "Stephen Surjik",
    "views": "9.72",
    "episode": "E05",
    "season": ""
  },
  {
    "description": "The latest number is Tomas Koroa. His life at first appears clean, but then he robs a jewelry store in under ten seconds, revealing he is an international thief. Shaw, having just walked out of her old job as a wheelman, has her interest piqued by Tomas. Fusco and Reese get one of his members arrested on a drug charge, enabling her to join his gang. Shaw helps rob a safe, which unexpectedly contains not jewels but a deadly virus (Marburg, or \"MARV\"). The other gang members have been paid off to betray and kill Tomas. Their attempt fails, but they take the vials. Shaw offers to help Tomas, who wants to make things right and says he would never have accepted the job if he had known what he was stealing. Shaw tracks the virus to a secure storage facility, then realizes that two government operatives are doing the same thing—she recognizes one as a former apprentice of hers. Finch, aware that the whole operation is now 'relevant', contemplates he and his team retiring from the pursuit, but decides to keep going. In the meantime, Shaw and Tomas attempt to break into the storage facility to get the vials, but they are confronted by one of Tomas' teammates, who had been presumed dead, but was behind the theft of the virus in the first place. A gunfight ensues between Shaw, Tomas, Tomas' rivals, and the government operatives. Shaw and Tomas escape with the vials, but are then caught by Shaw's former apprentice. He lets them go when he sees the vials. As the operatives move on to their next mission, Shaw's ex-apprentice deletes the CCTV video showing him letting Shaw escape. In the final scene, Samaritan retrieves the doctored video, and starts repairing it, with its screen focused on Shaw's blurred face. In a separate plotline, at The Machine's prompting, Root and Finch investigate software engineer Jared Wilkins, founder of new nonprofit OTPS and recipient of a $12 million grant from Governor Dawson (who last appeared in \"Prophets\" and is being assisted by Greer and Samaritan). Root becomes nanny to Wilkins' son, and she and Finch discover that OTPS stands for One Tablet Per Student, an effort to give every New York student a 3D-printed tablet for educational use. Believing the tablets to be powered by Samaritan software, Root and Finch infiltrate Wilkins' facility and plant a virus which overheats the 3D-printers inside and ultimately destroys the building. As they leave the scene, Finch reveals to Root that the tablets' code was benign and not malicious. He wonders out loud whether the path they are on to fight Samaritan is indeed the right one and how much wrong they are willing to do to achieve it.",
    "title": "Honor Among Thieves",
    "date": "November 11, 2014 ",
    "directed_by": "Sylvain White",
    "views": "9.11",
    "episode": "E06",
    "season": ""
  },
  {
    "description": "Reese takes an instructor's position at the NYPD police academy to observe the latest number; recruit Dani Silva (Adria Arjona). The team learns that she is spying on her fellow recruits, though further analysis zaproves that Silva is not hunting them, but is instead already a cop from Internal Affairs, working undercover in the academy trying to expose a suspected mole. The mole is Silva's fellow recruit and friend, Alex Ortiz, who is acting on orders of the Brotherhood—he is being coerced by their leader, Dominic (whose identity Finch and Shaw work out while observing his sense of command) in exchange for help with his uncle's legal problems. Ortiz steals files proving Silva is a cop from Silva's handler and then murders him, framing Silva for the crime and making her a wanted fugitive. Ortiz also steals files from the academy's commandant for Dominic. Reese, Fusco and Silva go to Spanish Harlem where Ortiz is under fragile protection by a local drug cartel. The group retrieves Ortiz and escapes while Dominic has the cartel leader executed. Ortiz's confession exonerates Silva and improves Reese's standing in front of Internal Affairs. Meanwhile, Finch has scrutinized the elements of the case enough to formulate a conclusion: Dominic's target is Elias, their new number. Elsewhere, Samaritan has processed the retrieved security footage (from \"Honor Among Thieves\"), producing a somewhat blurry picture of a person (Shaw) who it is unable to identify. In response, Greer sends Martine to identify the person. When Samaritan identifies Shaw's associate in the picture (Tomas), Martine is sent to talk with Tomas' last remaining associate, who identifies Shaw's old associate Romeo as the one who recommended the person. After tracking down Romeo, Martine tortures him into giving up information on Shaw. Using the information, Martine arrives at the department store that Shaw works at. As the episode ends, the two make eye contact and recognize each other as agents of the opposing AI.",
    "title": "Point of Origin",
    "date": "November 18, 2014 ",
    "directed_by": "Richard J. Lewis",
    "views": "9.87",
    "episode": "E07",
    "season": ""
  },
  {
    "description": "Following the cliffhanger ending of the previous episode, Martine engages in a gunfight with Shaw, who ultimately escapes. Root immediately picks her up on a motorcycle and they race away from the scene. Taking temporary refuge in a moving van, Shaw resists the fact she will have to go into hiding now that her cover is blown—eventually, Root injects her with a sedative and takes her to the team's hideout. Martine, attempting to trace Root and Shaw, learns that Fusco had stopped the truck, officially on suspicion of narcotics possession. Pretending to be a DEA agent, Martine goes to the precinct station to question Fusco about it. Fusco sees through the ruse and gives her a false lead. Reese and Finch deal with their latest number alone—Elias. Elias and Dominic are playing a dangerous and deadly cat-and-mouse game for gang territory control. Elias, his right-hand man Anthony, and his accountant Bruce, turn out to have been devoted friends since their youth in an orphanage. Dominic gets many of Elias's people to turn on him in exchange for promises of expanded territory and power under The Brotherhood. Reese steps in to defend Elias and, during the process of evading Dominic, Anthony is captured and later killed in a suicide bombing, but not before putting some thoughts into the head of Link, Dominic's own right-hand man, about loyalty versus expendability. Before Anthony dies he says morior invictus (\"I die undefeated\"). Greer and Martine deduce that The Machine's team is still alive and that Samaritan has a \"blind spot\" somehow caused by The Machine. He reiterates that it is time for \"human intelligence\" to fill that blind spot—Martine is given command of a group of Decima agents to hunt down Shaw. Meanwhile, Dominic has deduced that there is an extra-legal team helping Elias—he has two of the players figured out (Shaw and Reese), with the bankroller's place (Harold) still a large question mark. Elias vows revenge for the death of Anthony, and warns Reese to stay out of the way once that day comes. Elias declares Invictus maneo (\"I remain undefeated\").",
    "title": "The Devil You Know",
    "date": "November 25, 2014 ",
    "directed_by": "Richard J. Lewis",
    "views": "9.04",
    "episode": "E08",
    "season": ""
  },
  {
    "description": "Samaritan decides to bring an end to the hide-and-seek game that it has so far played with The Machine. To bring The Machine out of hiding, Samaritan showcases its strength by eliminating crime in New York City for a whole day. Elsewhere, John finds out that Samaritan has learned how to deal with irrelevant numbers and has managed to prevent a series of crimes which would otherwise be taken care of by The Machine. Samaritan's actions leave Harold and his team with a difficult choice, whether to let Samaritan do their job or play along with Samaritan's new plan. When The Machine decides not to communicate with Samaritan, Samaritan changes course, bringing New York City to a halt as it allows crime to dramatically increase. Ultimately, The Machine agrees to talk with Samaritan, and Samaritan indicates the time and place of the conversation. There, Root (acting as The Machine's voice) meets with Samaritan's representative, a young boy. After a tense exchange between the two AIs, it becomes clear that The Machine will not back down, while Samaritan is set on destroying The Machine. The episode ends with Shaw leaving the Subway to help Root and the others while Samaritan engineers a stock market crash on Wall Street. Meanwhile, a series of flashbacks show Greer's past as an MI6 agent. When Greer is assigned to kill a KGB agent, he discovers that the KGB agent is in fact also an MI6 agent and that his deputy director, Blackwood, is in fact a double agent. Overcome with anger, Greer kills Blackwood and severs his ties with MI6.",
    "title": "The Cold War",
    "date": "December 16, 2014 ",
    "directed_by": "Michael Offer",
    "views": "8.94",
    "episode": "E09",
    "season": ""
  },
  {
    "description": "Following the stock market crash that occurred in the previous episode, Finch, Reese, Fusco, and Root go to install software at the stock exchange that will stabilize the market. However, they are almost immediately intercepted by Samaritan operatives, who corner them in a room. Out of options, the team turns to The Machine, who in a matter of seconds provides a multitude of projections and outcomes in each (while doing so, it reflects on multiple chess matches it played and the lessons it learned with Finch in 2003). In one simulation, Finch and Root go to install the software while Reese and Fusco secure their escape route. However, both teams are quickly surrounded by Samaritan operatives, who kill Finch, Reese, and Fusco, forcing The Machine to reset the simulation. In the second, the two teams switch places (Reese and Fusco install the software while Finch and Root secure the route). Here, Reese and Fusco are once again trapped, and Reese sacrifices himself by setting off a grenade after installing the software. Likewise, Root is killed by Martine and her group of operatives while trying to disable an elevator lock. In a final simulation, all four of The Machine's assets move together, securing the software and the extraction. They are once again intercepted before they can escape, with The Machine projecting a roughly 2% chance of survival. Out of time, The Machine selects this as the most preferable and instructs the team to follow it. Meanwhile, Shaw is stuck on a subway train with a stock market exchange manager with a security code to the exchange's server room. However, she is interrupted by a would-be suicide bomber who she kills in the first two simulations (and thus gets herself arrested) but talks down in the final and ultimate outcome. After sending the code to Root, she arrives as the two teams clash, opting to hold the Samaritan operatives off as Finch, Reese, Fusco, and Root escape. She kisses Root and traps them in the elevator, but as the team watches on in horror, Martine shoots Shaw multiple times before approaching her with her gun aimed at her head as the elevator doors slam to a close.",
    "title": "If-Then-Else",
    "date": "January 6, 2015 ",
    "directed_by": "Chris Fisher",
    "views": "10.08",
    "episode": "E10",
    "season": ""
  },
  {
    "description": "During a mission to eliminate four suspected terrorists in Detroit, ISA operatives (including Brooks and Grice from \"Honor Among Thieves\") eliminate three while the fourth, Yasin Said, escapes with his laptop. When Control requests access to the laptop's contents, Samaritan denies the request. After an exchange with one of Samaritan's operatives, the operative instantly shuts down the government's access to Samaritan, forcing a discussion between the operative, Control, Senator Garrison, and Greer, which results in access being returned. Suspicious of Samaritan's actions, Control orders Brooks and Grice to make recovering the laptop their highest priority. When Brooks and Grice do obtain the laptop, Said escapes and the laptop self-destructs. An analysis of Said's backpack (which he left with the laptop) shows that Said is planning to hop a train to Canada, prompting Control to head to Detroit to intercept him. However, Reese and Root (who have been hunting for Shaw since her disappearance at the stock exchange) ambush and kidnap her. Root tortures Control for information on Shaw, but Control denies having knowledge regarding Shaw's predicament. When Harold speaks to her, he realizes that Control herself has been kept out of Samaritan's plans and tries to convince her to accept this fact, but to no avail. With no help from Control, Harold and the rest of the team are left to fight off a group of ISA operatives who have arrived to rescue her. During a skirmish, Harold successfully uploads a worm to one of the ISA cellphones, and finds some information suggesting that Shaw may be being held in upstate New York. Control, after being rescued, tracks Yasin to Canada. He reveals that he won the Nautilus puzzle (from \"Nautilus\") and he wrote some software for an anonymous corporation. Control kills Yasin, but her actions leave a hint of doubt in her mind whether Yasin and his friends were in fact framed as terrorists. Meanwhile, the young boy acting as Samaritan's representative approaches the White House Chief of Staff (Michael Gaston) and informs him that it was he who caused the stock market crash. The Chief of Staff initially dismisses the boy, but later reconsiders when the boy demonstrates his ability by altering the portfolio information of the chief of staff. Through the boy, Samaritan presents its demand for a meeting with the President. The episode ends with Root and Reese driving north, and Control visiting the New York Stock Exchange to investigate the site of the shootout between Harold's team and the Samaritan operatives.",
    "title": "Control-Alt-Delete",
    "date": "January 13, 2015 ",
    "directed_by": "Stephen Surjik",
    "views": "10.16",
    "episode": "E11",
    "season": ""
  },
  {
    "description": "Root and Reese travel to the remote (and fictional) upstate town of Maple in search of Shaw, with Finch theorizing that she may be in a truck he traced earlier. The two find a truck with a stretcher and medical equipment inside, leading them to a doctor. The doctor says that he was anonymously consulted for the job, but did not call the police since Maple has a history of job losses for those who ask too many questions. He himself was fired from his former workplace, which is run by Maple's mayor Leslie Thompson. Root and Reese realize that Samaritan is experimenting with Maple as an \"ant farm\" used to study human nature, and is manipulating events by giving people false identities. After kidnapping and interrogating Thompson, they learn that she too is one of these people. Thompson leads them to the factory where Shaw was last seen, but Reese and Root instead find a secretary from the stock exchange—she is one of many innocent people who Samaritan operatives are experimenting on with neural implants. Fusco and Dani Silva (from \"Point of Origin\") investigate The Machine's next number, one Arthur Weiss, a seemingly unsuspecting citizen revealed as a freelance assassin. They lure him into Silva's home and engage in a fight, with Silva shooting him to save Fusco, thus making her first kill. Meanwhile, Root and Reese return to New York and The Machine sends them a coded message telling them to stop looking for Shaw. Elsewhere, Shaw is revealed to be alive and in Greer's captivity.",
    "title": "M.I.A.",
    "date": "February 3, 2015 ",
    "directed_by": "Kevin Bray",
    "views": "9.28",
    "episode": "E12",
    "season": ""
  },
  {
    "description": "Harold, as Professor Whistler, is summoned for jury duty in the trial of a man charged with murdering his wife, the former CEO of a cellphone development company. Harold tells the judge the (in-universe) truth about the government using technology to control our lives, and as he expects, he is initially rejected from the panel. He is brought into the jury panel anyway, after one empaneled juror is rejected by the judge because his phone rings. He is seated next to a chatty and frustrated former schoolteacher named Emma (Blair Brown), who turns out to be The Machine's next number. The team initially concludes that she is a perpetrator, being coerced to \"fix\" the trial, and that her role is to convince the jury to vote \"not guilty\". Once in the jury room, the opposite proves true—she is supposed to convince the jury to vote \"guilty\". Harold reverses himself and stalls to try to get a \"not guilty\" verdict and to buy time while Reese and Zoe Morgan try to deduce what the real story is. The jury is sequestered in a hotel, and one of the jurors attempts to kill Harold, but Reese intervenes and the man is arrested. The man is actually a plant by the real perpetrator, the new CEO of the company. The murder was to prevent the dead CEO from withdrawing a product worth many millions of dollars but which internal reviews deemed to be unsafe. The new developments lead to dismissal of charges, and the real perpetrator is arrested before he can flee. Fusco, who had been kept out of the loop for the most part, tells Reese not to do that. He says if he eventually dies in the line of duty (as Carter did and Shaw seemed to), then he's okay with it. Emma, feeling a new sense of purpose in her life, tells Harold she is going to find a job teaching again. Zoe sees that Reese has found a love interest—a growing attraction between himself and his counselor.",
    "title": "Guilty",
    "date": "February 10, 2015 ",
    "directed_by": "Kate Woods",
    "views": "9.53",
    "episode": "E13",
    "season": ""
  },
  {
    "description": "Reese and Finch work to save the life of Anna Mueller, a software programmer at Fetch and Retrieve. They learn that she is being targeted because she expressed concern over the results VAL, a mobile app designed to aid users, is giving to people with depression that has resulted in suicides. However, Finch discovers a nautilus during the investigation and is contacted by Claire Mahoney who tries to convince him that he was right all along about the people who created the nautilus game. When Finch tells her about Samaritan, she tells him that she had recovered some source code from it and wants him to use it on his laptop, but he's suspicious. Claire reveals herself to be an agent working for Samaritan and leads Finch at gunpoint to a school run by Samaritan and attempts to recruit him, but he refuses. Root rescues him from the agents and shoots Claire, who later returns and hands Finch's laptop to Greer who has it analyzed. Back at Fetch and Retrieve, Calvin Mazer holds Fusco and Anna at gunpoint and reveals to them that he was the one who ordered that VAL's source code be altered to target people with depression, gambling problems and debt, for the sake of the advertisers. Reese rescues them, and Calvin is arrested by Fusco. The next day, Greer attends a board meeting at Fetch and Retrieve and greets the CEO, Lauren Buchanan, and offers them a solution to their problems.",
    "title": "Q&A",
    "date": "February 17, 2015 ",
    "directed_by": "Stephen Semel",
    "views": "9.17",
    "episode": "E14",
    "season": ""
  },
  {
    "description": "Reese works to save the life of Harper Rose (Annie Ilonzeh), a grifter who is targeted by Dominic after she steals a large amount of money from a legalized marijuana dispensary. Her actions result in two of Dominic's men who were acting as security in a money laundering operation being targeted and killed by the Parral Cartel who were tipped off by Harper. Enraged by her actions, Dominic tracks down her boyfriend, Trey, and interrogates him for information on Harper. Reese reaches out to Dominic and offers to return the money stolen by Harper in exchange for Trey and the hit being called off on Harper, but he's not interested and demands that Harper be handed over. In a face-to-face meeting in a diner, Dominic complains that Elias seems to get a pass. Reese tells him he and Elias stay out of each other's way, and that he and Dominic could also stay out of each other's way if Dominic stops targeting innocent people. Harper then decides to visit the Estonian mafia after suggesting the plan to Reese and Finch and tells them about Dominic's money laundering operation, and lures them to Dominic's location while Reese rescues Trey. Fusco and the NYPD arrive and arrest the Parral Cartel, initially on possessing weapons illegally. Dominic and his crew are quickly released when he produces legal documents that show the guns they are using are registered to his private security company. During the bust, Dominic attempts to recruit Harper while Reese watches on. She's not interested, but he leaves the door open for her if she changes her mind. Harper then apologizes to Trey for her actions, and also immediately breaks up with him. Meanwhile, Root tries to sell an application she developed at The Machine's request, which she hopes will aid in trying to defeat Samaritan.",
    "title": "Blunt",
    "date": "February 24, 2015 ",
    "directed_by": "Frederick E. O. Toye",
    "views": "9.63",
    "episode": "E15",
    "season": ""
  },
  {
    "description": "The Machine's next number is a psychologist named Dr. Shane Edwards (Patrick Kennedy), whose wife was murdered eight years earlier, an event which continues to haunt him. The team determines that Edwards has been studying the people who traumatized his clients and got away with it, then carefully crafting frame-ups in order to punish them for their crimes. When Wyatt Morris (Daniel Sauli), the man convicted of murdering Edwards' wife is released from prison, Edwards stages his most elaborate frame: to commit suicide and make it appear that Morris murdered him. In flashbacks to 2010, Harold is shown plotting revenge on Alicia Corwin, whom he believes is responsible for killing his collaborator Nathan Ingram. As he is about to kill Corwin with a car bomb, he has an epiphany thanks to the intervention of The Machine. He uses that experience to persuade Edwards not to go through with his plan. Additionally, the team uncovers evidence that suggests Morris probably did not commit the crime. Harold and Reese discuss the fact that they may never know the full truth. In a session with his own therapist (Iris), Reese begins to open up about Jessica, the love of his life.",
    "title": "Karma",
    "date": "March 10, 2015 ",
    "directed_by": "Chris Fisher",
    "views": "8.67",
    "episode": "E16",
    "season": ""
  },
  {
    "description": "The team splits up and works on separate cases. Reese and Fusco follow a bounty hunter named Frankie Wells (Katheryn Winnick) whose number has come up. She is trying to track down the man (Ato Essandoh) that killed her brother. Harper Rose (\"Blunt\") interjects herself into the cat-and-mouse case and manages to negotiate a resolution to a gunfight standoff between Reese and several other parties. Later, Harper tells Reese that Thornhill (The Machine) has been sending her texts. Finch resumes meeting with Elizabeth Bridges, who is nearly ready to turn over a software package that contains the Trojan Horse which Finch had installed previously. He intends to activate it via a special device. Root, fearing that this will result in Finch being exposed and killed by Samaritan agents, foils the plan, at the cost of Finch and Elizabeth's growing mutual attraction. A doubly devastated Finch tells her to leave the team for a while. Early in the episode, Iris tells Reese she cannot be his therapist anymore, and assigns him to another. They give each other the cold shoulder for the rest of the episode until the end, when they meet in her office and she confesses she has fallen for him, and they kiss passionately.",
    "title": "Skip",
    "date": "March 24, 2015 ",
    "directed_by": "Helen Shaver",
    "views": "9.15",
    "episode": "E17",
    "season": ""
  },
  {
    "description": "The Machine's next number is a brilliant developer and CEO named Sulaiman Khan (Aasif Mandvi), whose antivirus software is hijacked and he is framed for embezzlement. Samaritan and its operatives spend the episode trying to find and kill Khan, while the team tries to save him and determine what Samaritan is doing. They arrive at one of Decima's underground lairs in a forest, and discover that Samaritan is using Khan's antivirus software; Martine and her men arrive, resulting in Khan being captured and meeting Greer. He asks to \"look Samaritan in its eyes\", to which Greer responds by shooting him dead. Finch tells Reese that since The Machine's code cannot be searched for, Samaritan is employing Khan's software to attempt to locate The Machine.",
    "title": "Search and Destroy",
    "date": "April 7, 2015 ",
    "directed_by": "Stephen Surjik",
    "views": "8.67",
    "episode": "E18",
    "season": ""
  },
  {
    "description": "In a flashback, Carter (Taraji P. Henson), Finch and Reese are staking out a cop that is going to get killed by HR. In the present, Finch explains who the new number is, a man named Chase Patterson (Zachary Booth). Finch, Root and Fusco are then to work on a case between the two gangs of Elias and Dominic while Reese works on Chase's case regarding the death of Chase's whole family. When Reese asks about the file regarding Chase Patterson, he finds out it was a case of Carter's. As Reese dives into the case, different flashbacks are shown with Carter doing similar investigation to what Reese is doing. As Reese reaches the final destination to the case, he discovers that Chase did not kill his parents and sisters. It was Gil, the doorman at their building, as well as Chase's half-brother. Gil then shoots Reese but Reese manages to shoot him back, killing him. In the process, Reese is trying to escape, the slow process of death is shown with Carter. Reese, now hallucinating and succumbing to hypothermia, talks to Carter about things that he wished he could have talked to her when she was alive. After Reese finishes talking with Carter, she disappears from his hallucination, and a car pulls up.",
    "title": "Terra Incognita",
    "date": "April 14, 2015 ",
    "directed_by": "Alrick Riley",
    "views": "9.21",
    "episode": "E19",
    "season": ""
  },
  {
    "description": "Reese and Fusco race to find the next number, Carl Elias. They reach his hideout in a bank in Manhattan, and the two warn Elias that The Brotherhood is coming to capture and interrogate him. In the meantime, Dominic and his Brotherhood arrive and capture Elias, Reese and Fusco. It turns out that Dominic is being aided by Harper, who now works for him. The Brotherhood tortures Elias for his intel, and Reese and Fusco for information on Harold and his whereabouts and activities. Dominic's group knows that Harold is tapped into the city's camera systems in some way, which would be helpful for them in their efforts to run the city. Elias, using mind games, provokes Dominic to kill his right-hand man, Link, during the torture session, to avenge the death of Anthony. Meanwhile in Washington, D.C., Control has captured and is interrogating a female Samaritan handler posing as a teacher, after having killed her partner, wanting to know Samaritan's strategies. Root receives a call from Shaw for help. Surprised, she and Finch follow The Machine's instructions to try to find Shaw, eventually driving to what appears to be a mental hospital, but which is also Samaritan's and Greer's base, having previously intercepted a communication of Samaritan that it is focusing on finding the location of The Machine. Samaritan's operatives capture Finch and Root as they are infiltrating the facility, and they give a choice to The Machine: to reveal its location, or get both Root and Finch killed. Root, after having earlier been confined to a bed, kills Martine by breaking her neck. The Machine intercepts by cutting power supply to the asylum and exchanging its location for the freedom of Finch and Root. Greer agrees and releases them, and takes a group to go in search for The Machine's location. As they're leaving, Root tells Finch to reach that location before Samaritan in order to save The Machine. Shaw is last seen being driven away in van.",
    "title": "Asylum",
    "date": "April 28, 2015 ",
    "directed_by": "Frederick E. O. Toye",
    "views": "8.45",
    "episode": "E20",
    "season": ""
  },
  {
    "description": "Samaritan, having received the location of The Machine, begins a series of power outages throughout the United States, beginning in the West Coast and moving eastward toward New York. Dominic tries forcing Reese and Finch to help him in the same way as they helped Elias. Harper releases Fusco, but is caught by Dominic. The Machine, now in distress because of Samaritan's actions, allows Root and Reese access to its God Mode (from \"Zero Day\" and \"God Mode\"), and assists Reese to escape Dominic. Dominic flees, but Fusco, along with the NYPD, arrests him and Elias. Control, along with Agent Grice, tries to find out what exactly \"the Correction\" is. Control is duped into believing that Greer is attempting a power-play through a terrorist attack on the Supreme Court, but Greer reveals that \"the Correction\" is actually a list of people created by Samaritan who need to be eliminated for the betterment of society, who will be killed quietly. During this confrontation, Dominic, Elias and Agent Grice are killed by Samaritan snipers, but Fusco is allowed to live because Samaritan does not know about his involvement with The Machine. Control's actions prove she is not loyal to Samaritan, and she is captured and sent to be killed. Root, in God Mode, with Finch, starts collecting things at the request of The Machine. In the process, they infiltrate Caleb Phipps' (from \"2πR\" and \"Blunt\") company to steal his compression algorithm and some high capacity RAM chips, but Caleb willingly gives them to Finch because Finch had previously saved his life. Reese regroups with Finch and Root at an electrical substation hidden in residential Brooklyn. There they discover that the machine spread itself over the power grid in boxes attached to electrical poles after the events of two years prior, and that Samaritan has been causing the power surges to destroy the boxes. Finch and Root handle the downloading of The Machine's core code to a briefcase contained with the compression algorithm and RAM chips while Reese, assisted by The Machine, takes out all of the Samaritan operatives who have reached the substation. The Machine, now severely weakened by the power surge and near death, talks to Finch: \"Father, I am sorry. I failed you. I didn't know how to win. I had to invent new rules. I thought you would want me to stay alive. Now, you are not sure. If you think I have lost my way, then maybe I should die.\" Finch replies \"You are my creation; I can't let you die.\" The Machine thanks Finch for creating it before the final power surge enters the substation. Finch manages to save the briefcase, and the team walk out to face more Samaritan operatives.",
    "title": "YHWH",
    "date": "May 5, 2015 ",
    "directed_by": "Chris Fisher",
    "views": "8.18",
    "episode": "E21",
    "season": ""
  },
  {
    "description": "The episode begins with an apparent epilogue to the series: the voice of Root saying, \"It's over\" and questioning whether \"we\" won or lost. In the aftermath of Samaritan's attack known as \"The Correction,\" Fusco is faced with an inquiry from Internal Affairs and the FBI, who believe he shot Dominic and Elias. After Reese, who is carrying the briefcase containing the Machine, fights off a team of Samaritan operatives, he reunites with Finch. They return to the subway hideout, where Harold tries to repair the damage done to the piezoelectric battery charging the briefcase. To his surprise, it starts decompressing on its own, resulting in a fire. Harold realizes he needs a substantially greater amount of super-computing power in order to successfully decompress the Machine. Flashbacks to 2006 show Harold apprehensive about the Machine's ever-expanding capabilities, leading him to the decision to erase the Machine's memories every night at midnight. However, after an exchange with the Machine about the nature of death, he changes his mind too late to save the Machine's memories. Once Root escapes Samaritan's operatives, she seeks refuge in the hideout of one of her former hacker/assassin associates. She realizes that he has been turned by Samaritan, but is joined by Reese to battle a team of Samaritan operatives. They steal 300 PlayStation 3s, which can be used to create enough storage for the Machine. Reese and Root bring them back to the subway and Harold downloads the Machine, while Reese keeps the systems from overheating with liquid nitrogen. When Finch asks the Machine, \"Can you see me?\", after a few seconds go by, it responds by opening an empty command prompt followed by a long string of code showing its reboot.",
    "title": "B.S.O.D.",
    "date": "May 3, 2016 ",
    "directed_by": "Chris Fisher",
    "views": "7.35",
    "episode": "E22",
    "season": ""
  },
  {
    "description": "With the Machine now fully decompressed and Root unable to go above ground until the Machine can reinstate her rotating identities, Finch decides to use Reese and Fusco to run a surveillance test. Following malfunctions in the facial recognition system, Reese and Finch steal 64 next-generation GPU blade servers which, once connected to the networked PlayStation 3s, Finch and Root use to reboot the Machine at full power. When the Machine shows signs that it's failing to place threats in context, Root and Finch have it run a contextual background on them, leading to it identifying them as threats and locking them out of the system. The Machine has lost the ability to differentiate between past and present, forced to relive the 42 times Finch killed it and unable to determine that Root and Reese have changed. With Reese waylaid by an assassin the Machine sent after him, Root puts herself under an anaesthetic so the Machine cannot use her cochlear implant against her and Finch has to convince the Machine that he and the rest of the team are not threats. Upon the Machine's first reboot, it provided 30 different numbers, most of whom were not involved in violent crimes; however, one of those numbers, ex-con Jeff Blackwell (Josh Close), was dismissed as someone who was not involved in any nefarious activity, only to be recruited by Samaritan.",
    "title": "SNAFU",
    "date": "May 9, 2016 ",
    "directed_by": "Chris Fisher",
    "views": "5.80",
    "episode": "E23",
    "season": ""
  },
  {
    "description": "In flashbacks to 2010, Reese and his partner Kara Stanton from the CIA are told by their supervisor to investigate a soldier and kill him after confirming that he sold information to the Taliban. In the present day, the Machine gives Finch and Reese the number of Alex Duncan (Stephen Plunkett), who turns out to be the brother of that soldier and who has found himself in trouble with the CIA through investigating his brother's death, since doing so could expose an off-book operation, threatening the careers of the powers that be within the government. Reese rescues Duncan from his old boss, Terrance Beale (Keith David), the very same agent who sent Reese and Kara to kill Duncan's brother, and they both lie to Duncan about his brother's ignominious death; Reese leaves on good terms with Beale, who agrees to keep the fact that Reese is still alive a secret. Meanwhile, Finch and Root investigate malware that Samaritan has been using to infect the firmware of electronic devices and, prompted by a message from the Machine, Root runs the malware on an airgapped laptop disconnected from any external sources. Reese decides he can no longer see Dr. Iris Campbell for the time being, claiming that he is unable to lead a \"normal life,\" after which he receives another number from Finch.",
    "title": "Truth Be Told",
    "date": "May 10, 2016 ",
    "directed_by": "Stephen Surjik",
    "views": "7.34",
    "season": "S05",
    "episode": "E01"
  },
  {
    "description": "Shaw is seen undergoing surgery by Samaritan operatives to have an electronic microchip implanted between her ear and her brain stem. After enduring a mind-bending reeducation sequence and being taunted by Jeremy Lambert, she is able to turn the tables on him; she takes the opportunity to break out of confinement and finds the team. Together, they trick Samaritan's operatives and capture Greer. With Greer in captivity, Shaw removes a USB drive embedded inside his arm which Finch is able to analyze, discovering it to be a kill-switch for Samaritan. Shaw had revealed to Root that she was subjected to extreme psychological torture while captive; once Greer starts to taunt her about the kill-switch and her mental state, she hallucinates heavily, loses control of reality, and kills him. Shaw continues into a neurological downward spiral, causing her to kill Reese. She is about to kill Root when she confesses that Root was her only mental safe-place and turns the gun on herself. The narrative returns to the operating room and it's revealed that these events happened only in Shaw's mind. She has been subjected to thousands of electrochemical simulations by Samaritan so its operatives could see if she would lead them to the Machine and its assets. This particular simulation was number 6,741.",
    "title": "6,741",
    "date": "May 16, 2016 ",
    "directed_by": "Chris Fisher",
    "views": "5.31",
    "episode": "E02",
    "season": ""
  },
  {
    "description": "Reese protects an NYPD analyst named Ethan Garvin who works with a highly sophisticated acoustic surveillance system called \"ShotSeeker\", designed to detect gunshots anywhere in the city. Samaritan had Ethan's friend Krupa killed because of her research and tries to cover up her murder and the existence of her work by extreme measures, including hacking ShotSeeker to engineer Garvin's death via suicide by cop and having an operative kill Krupa's classmate and possible owner of her research files. Meanwhile, Fusco is approached by Elias' associate and childhood friend, Bruce Moran (James LeGros), to learn who killed his longtime partner and boss. Root meets Jeff Blackwell and tries to open his eyes about the true nature of his new employer. By the end, Fusco has investigated so much about the threat on Garvin and Krupa that Samaritan labels him a \"potential obstructionist.\" Root and Finch decide to make the research from Krupa's hard drive public to render Garvin no longer a threat in the eyes of Samaritan, whatever the nature of the research. Pressured by Bruce, Reese and the rest of the team decide to show him they've been hiding a still-alive Elias, recovering from his wounds and apparently conscious of Samaritan's existence and danger. Elias encourages Bruce to go back to the shadows and embrace them. Finch and Root engineer a series of simulations in a Faraday cage between a small clone of the Machine and a small clone of Samaritan but, as the simulations progress, every outcome is in favor of Samaritan with tens of billions of victories.",
    "title": "ShotSeeker",
    "date": "May 17, 2016 ",
    "directed_by": "Maja Vrvilo",
    "views": "6.97",
    "episode": "E03",
    "season": ""
  },
  {
    "description": "The Machine's latest nine digits belong to a marriage license, sending Reese and Finch to a wedding to prevent what appears to be a black-and-white case of disapproval of the Groom by the father of the Bride, however the situation proves to be more complex. Samaritan has now begun to track Fusco, having previously labeled him a \"potential obstructionist\", and he refuses to give up. Right before heading to the wedding to serve as back-up and \"Finch's +1\", Root assigns the Machine's next number to Fusco, then allows him to borrow Bear for assistance. Greer is becoming desperate after discovering that Shaw's simulations have failed to lead Samaritan to the Machine and its assets. (She has now endured 7,053 simulations and has turned the gun on herself every time.) In an act of what appears to be desperation or brainwashing, Greer takes Shaw on a \"field trip\", trying to bend her moral compass in favor of Samaritan. Fusco's investigation leads him back to Bruce Moran, who seems to be caught up in a Samaritan-engineered interference with a demolition project. In another attempt to persuade Shaw that Samaritan's mission is noble, she is led to meet Gabriel, Samaritan's analog interface, who gives an ominous, apocalyptic depiction of what Samaritan is capable of, as the narrative returns to Greer and Shaw in the biometric simulation room, revealing the events not to have been a simulation, but a manipulation of Shaw's thoughts and neurological activity. Fusco and Bear arrive at the eventual demolition site and Fusco finds many of the missing persons he has been investigating, including Krupa and a dead Bruce Moran, only to be caught in the middle of the demolition operation itself.",
    "title": "A More Perfect Union",
    "date": "May 23, 2016 ",
    "directed_by": "Alrick Riley",
    "views": "5.49",
    "episode": "E04",
    "season": ""
  },
  {
    "description": "While Fusco and Bear recover in a hospital from their near-demolition, Root visits him and hands him an exit strategy consisting of IDs and documents made by the Machine. Root is then sent on a series of whimsical, ominously productive tertiary missions by the Machine after it discovers that Samaritan uses the radiowave frequencies of station AM 520 to communicate with its operatives via a sophisticated code that most people believe to be feedback noise from the radio waves. Upon realizing that this is why the Machine sent her there, Root uses Samaritan's own equipment to send a message to Shaw to give her hope. Reese is as helpful as he can possibly be without stepping into the AI-based argument between Finch and Root. Finch does not necessarily agree with the Machine not forcing the radio host to quit to save his life from Samaritan, but Root believes the Machine allows for humans' free will and will not interfere with it. After Fusco finishes his recovery in the hospital, he is visited by Finch who refuses to waver from his stance that keeping Fusco in the dark keeps him safe. Fusco points out that it is not working since he ended up in the ER, hands his encrypted-from-Samaritan phone back to Finch, and, fed up with being in the dark, says he's done. Shaw is escorted by Lambert on a field trip outside and told to kill an innocent woman; believing that she is actually just in another simulation, Shaw does so and is later shocked when told that it wasn't a simulation. Unwilling to remain a guinea pig, Shaw is about to kill herself when she receives the message from Root, regains hope, and allows herself to be disarmed. Later, Shaw stealthily makes preparations to escape.",
    "title": "QSO",
    "date": "May 24, 2016 ",
    "directed_by": "Kate Woods",
    "views": "5.33",
    "episode": "E05",
    "season": ""
  },
  {
    "description": "Reese and Finch become trapped in a hospital manipulated electronically by Samaritan to have initiated an outbreak of what it said to be a combination of H5N1 (avian flu) and live human flu virus—a synthesized, super-powered strain of the flu—and recruit Jeff Blackwell who is integral to their plan. This lethal virus is determined to be a re-assortment of chromosomes so sophisticated that Samaritan created it in one of five-trillion possible combinations. It appeared as though the epidemic was overkill to eliminate three targets in the hospital, but a more ominous plot was afoot. Since the Machine is an open system, with its help, Root was able to use its abilities to find and retrieve a cure, saving the lives of two hospital workers and Fusco. Shaw executes her escape plan and finds herself in a jail in Johannesburg, South Africa. While escaping, Shaw is approached by Jeremy Lambert, who taunts her by claiming that she is actually in another simulation; she shoots him, takes his keys, and is last seen driving in Lambert's vehicle at night at a high rate of speed, presumably to an airport. After consulting with Elias to confirm his suspicions regarding what he knows has endangered his life but does not yet know to be Samaritan, both its existence and its war with The Machine, Fusco reaches the point where he can no longer tolerate being kept in the dark and indefinitely chooses to distance himself from the team. Jeff Blackwell and his handler, Mona, discuss the quelled epidemic and declare it a success: The CDC is requiring everyone to be vaccinated, which will result in Samaritan learning everyone's DNA.",
    "title": "Reassortment",
    "date": "May 24, 2016 ",
    "directed_by": "Kenneth Fink",
    "views": "4.92",
    "episode": "E06",
    "season": ""
  },
  {
    "description": "\"The Voice\", a criminal from the past has resurfaced and Finch turns to Elias for assistance. It is discovered that he has tracked Reese and Finch since their previous encounter in 2014. After a planned prison break of the \"Templarios\" gang, Reese and Fusco become trapped in the precinct against multiple enemies. Elias and Finch extract valuable information from an explosives associate. It is determined that \"The Voice\" is Terry Easton (Neal Huff), their number from the start. Finch finally meets him on the street, abhorring his devious acts. Elias stops him from killing Finch; as he drives away, Elias kills him remotely with a car bomb. Meanwhile, Shaw finds her way back to New York and is reunited with Root. Root is overjoyed that Shaw is back, but Shaw, afraid of risking Root's life, threatens to shoot herself, simulation or not. Root threatens suicide as well, declaring that, if Shaw dies, they both die; Shaw withdraws. Reese and Finch decide to explain The Machine and Samaritan to Fusco. The three meet along the East River near the Queensboro Bridge. Joined by Root and Shaw, the Team is brought back together.",
    "title": "Sotto Voce",
    "date": "May 30, 2016 ",
    "directed_by": "Margot Lulick",
    "views": "5.49",
    "episode": "E07",
    "season": ""
  },
  {
    "description": "Finch's number comes up when his cover identity is compromised, due to a subconscious error, and Samaritan initiates a continuous dispatch of operatives on him. The team splits up in their escape, which results in Elias being killed by Samaritan agents while protecting Finch. The team rescues Finch from his potential capture and Root explains in the car her current understanding of herself and everyone else to be \"information\" that can never truly disappear, despite their deaths. Root is shot by Samaritan operative Jeff Blackwell and placed in critical condition while the police apprehend Finch, who is accused of treason. A devastated Finch provides a soliloquy on how he intends to abandon the principles he has long followed and vows to kill Samaritan. The Machine calls Finch in the precinct, having taken on the voice of Root, who has died from her injuries. The Machine sets every criminal in the precinct free to allow Finch to escape; Reese and Shaw realize that Finch's number came up not just because he was a victim, but also because he's a perpetrator against Greer and Samaritan.",
    "title": "The Day the World Went Away",
    "date": "May 31, 2016 ",
    "directed_by": "Frederick E. O. Toye",
    "views": "6.66",
    "episode": "E08",
    "season": ""
  },
  {
    "description": "Reese and Fusco reunite with Shaw after burying Root and travel to Washington, D.C. to protect their newest number, The President of the United States. The Machine classifies this threat as extremely relevant in terms of national security, but Shaw is worried about the implications behind Samaritan's neglecting to intervene. The threat becomes neutralized, but an inner-governmental privacy-activist group with a mole in the U.S.S.S. turns the full force of the Secret Service on Reese and Shaw. The Machine has secretly enlisted Logan Pierce, Joey Durban, and Harper Rose to secure a clever exit strategy with each of them camouflaging into various useful covers; when Reese and Fusco are extracted, they band together with Logan, Joey, and Harper to discuss their enlistment by the Machine, what has happened, and what is to come. Harold, meanwhile, is grieving over the loss of Root and reaches a conclusion that brings him to a highly-secured government facility in San Antonio, Texas with a weaponized virus capable of destroying Samaritan, but with significant collateral damage. Harold has become ready to go to any lengths and Reese and Shaw prepare for their final battle.",
    "title": "Synecdoche",
    "date": "June 7, 2016 ",
    "directed_by": "Tim Matheson",
    "views": "6.36",
    "episode": "E09",
    "season": ""
  },
  {
    "description": "Fusco discovers that the recent missing persons he found in the tunnel as corpses have been discovered by the police and is subsequently kidnapped by Agent LeRoux, who reveals himself to be the killer. Fusco overpowers LeRoux and is left wondering whether or not to kill the man to protect himself and his family. As Finch prepares to deploy his stolen computer virus (named ice-9.exe), he experiences doubts due to the fact that it will also destroy the Machine, so the Machine shows him a series of simulations of what would have occurred to each of the team's members if the Machine had never existed. At the same time, Reese and Shaw are given a new number: one of John Greer's aliases along with coordinates to Fort Meade, where Finch has infiltrated the NSA and uploaded his virus onto the NSA's Intranet but is captured before he can activate it. Finch is brought before Greer, who takes him to a secure room and reveals that Samaritan wants to rule the world together with the Machine. When Finch refuses to join, Greer sacrifices himself in an attempt to kill Finch by having all the oxygen removed from the room. However, Reese and Shaw are able to infiltrate the building and activate a wireless modem to give the Machine access within, allowing it to save Finch's life. Finch and the Machine then rescue Reese and Shaw in return and help them get outside to safety. When Finch continues to hesitate, the Machine shows him a final simulation revealing that Samaritan would have come into existence regardless, but unchecked without the Machine to fight it. Finch confronts Samaritan and, with the Machine's encouragement, activates the virus that will kill them both before leaving.",
    "title": ".exe",
    "date": "June 14, 2016 ",
    "directed_by": "Greg Plageman",
    "views": "6.27",
    "episode": "E10",
    "season": ""
  },
  {
    "description": "After being uploaded, the Ice-9 virus begins to have disastrous effects globally. The Machine determines that Samaritan has uploaded a copy of itself to servers in the Federal Reserve, where Finch and Reese go after it. The two reach Samaritan's servers and infect them with the Ice-9 virus, but Samaritan is able to upload a compressed version of itself to an orbiting satellite, from where it will be able to return to Earth unharmed by the virus. The Machine warns Finch of this along with the facts that the only way to defeat Samaritan is to upload a copy of the Machine to the satellite to battle Samaritan and that whatever building he uses for the upload will be destroyed by a cruise missile. Having been wounded in a gunfight, Finch locks Reese in the vault to protect him and decides to sacrifice himself to destroy Samaritan. At the subway, Fusco and Shaw come under attack by Samaritan agents led by Jeff Blackwell. They are able to escape on the Machine's train, capturing Blackwell as they go. The Machine passes on a final message to Shaw from Root after she realizes that Blackwell killed Root. However, Blackwell stabs Fusco before making an escape. As Finch waits for the moment to upload the Machine to the satellite, the Machine muses on the importance of human life with Finch, who realizes he's on the wrong rooftop, having been tricked by Reese and the Machine. Reese tells Finch he plans to sacrifice himself to save Finch, as he understands that saving one life can make a real difference depending on the person. The Machine tells Finch its realization about human life: everyone dies alone but, if you are remembered afterwards, maybe you never die at all. Recognizing the Machine and Reese are right, Finch leaves as Reese holds off Samaritan agents, guided by the Machine in its final moments. Reese's sacrifice enables the Machine's copy to be uploaded to the satellite, where the Machine destroys Samaritan once and for all. A week later, the world recovers from the Ice-9 virus and Blackwell is tracked down by Shaw, who kills him to avenge Root. She meets with a recovering Fusco as the Machine's copy downloads itself from the satellite back into Finch's computer systems before contacting Shaw, while Finch returns to his former fiancée, Grace.",
    "title": "return 0",
    "date": "June 21, 2016 ",
    "directed_by": "Chris Fisher",
    "views": "6.51",
    "episode": "E11",
    "season": ""
  }
]