[
  {
    "description": "\nThe police investigate the deaths of a series of people who all appear to have committed suicide by taking a poisonous pill. They turn to their unofficial consultant, Sherlock Holmes, who deduces various elements pointing to a serial killer. Meanwhile, Holmes is introduced to John Watson, a former soldier who served in Afghanistan, and the pair immediately move into a flat in Baker Street. John Watson slowly gets to know and trust Sherlock despite police officer Sally Donovan (Vinette Robinson) warning him that Holmes is a psychopath and will one day be responsible for murder. Sherlock's brother Mycroft (Mark Gatiss), at first not revealing his identity, arranges a meeting with Watson and asks whether he'll spy on Sherlock for money, but John refuses. After a series of incidents, the person responsible for the deaths, a taxicab driver (Phil Davis), reveals that his victims took their own lives by playing a game of Russian roulette with two pills: one fatally poisonous, the other safe. Before Sherlock can play the cabbie's game, John shoots the cabbie from an opposite building. Before he dies, the taxicab driver reveals that \"Moriarty\" was his sponsor.\n\nLoosely based on the first Sherlock Holmes novel, A Study in Scarlet.",
    "title": "A Study in Pink",
    "date": "25 July 2010 ",
    "season": "S01",
    "episode": "E01"
  },
  {
    "description": "\nSherlock is hired by an old friend to investigate a mysterious break-in at a bank in the City. He discovers that symbols spray-painted onto an office wall are a coded message intended for an employee of the bank, who is later discovered dead in his flat. The next day, a journalist is killed and the same symbols are found nearby. Sherlock and John follow a trail of clues that link the two dead men to a Chinese smuggling ring, who are trying to retrieve a valuable item that one of the dead men stole. Sherlock eventually cracks the coded message based on Suzhou numerals and a book cipher, but not before John and Sarah (John's date) are kidnapped by the criminals, who believe that John is Sherlock. Sherlock rescues John and Sarah, but the leader of the gang escapes. Later, the leader of the gang is in communication with her superior, who is identified by the initial \"M\". She is then shot by a sniper.\n\nLoosely based on the short story \"The Adventure of the Dancing Men\", the storyline also incorporates elements from other Sherlock Holmes stories; the concept of coded messages, the markings on the feet of the Black Lotus members and the plot of escaping a secret society, then being tracked to and killed in England all feature in The Valley of Fear. A murder victim being found inside a locked room, accessible only by climbing, alludes to The Sign of the Four.",
    "title": "The Blind Banker",
    "date": "1 August 2010 ",
    "episode": "E02",
    "season": ""
  },
  {
    "description": "\nSherlock is commissioned by Mycroft to investigate the suspicious death of a government employee, who was working on a top-secret defence project: the Bruce-Partington Project. After rejecting the case and handing it over to John, Sherlock begins to be taunted by a criminal who puts his victims into explosive vests and sets Sherlock deadlines to solve the apparently unrelated cases, which include a twenty-year-old cold case involving the shoes of a drowned boy, the disappearance of a businessman, the death of a TV personality, and the assassination of a guard of an art gallery by the \"Golem\". As Sherlock solves the cases, he finds links between them. After clearing up the original case of the civil servant, Sherlock tries to force his unseen adversary to reveal himself. Near the end of the episode, Sherlock and \"Jim Moriarty\" reach a standoff, where Jim reveals that he is responsible for the crimes. In the final seconds, Sherlock Holmes points his gun at a bomb on the floor that had been strapped to John.\n\nThe episode's storyline is somewhat derived from The Adventure of the Bruce-Partington Plans and makes references to \"The Five Orange Pips\" at various points (as per the five bomb victims and electronic beeps on the phone) in addition to other works of Sir Arthur Conan Doyle.",
    "title": "The Great Game",
    "date": "8 August 2010 ",
    "episode": "E03",
    "season": ""
  },
  {
    "description": "\nMycroft hires Sherlock and John to retrieve compromising photos of a minor royal, which are held on the camera phone of Irene Adler (Lara Pulver), a ruthless and brilliant dominatrix who also trades in classified information extracted from her rich and powerful clients. Sherlock obtains Adler's phone, but discovers it is booby-trapped and requires a code to disarm it. When Adler discovers that the CIA are on her trail, she disappears and is then apparently killed, only to reappear to ask John to get her camera phone back from Sherlock. Weeks later when the coast is clear, Adler tricks Sherlock into deciphering a coded message on her phone which she obtained from another well-connected client. She sends the message to Moriarty, who in turn uses it to foil a British counter-terror operation. She almost succeeds in blackmailing Mycroft, but Sherlock finally cracks the password for the phone, leaving Adler without the protection she needs to survive. The episode concludes as Mycroft tells John that she has been killed by a terrorist group in Pakistan, while in fact she was secretly rescued by Sherlock.\n\nBased on the short story \"A Scandal in Bohemia\".",
    "title": "A Scandal in Belgravia",
    "date": "1 January 2012 ",
    "season": "S02",
    "episode": "E01"
  },
  {
    "description": "\nSherlock and John are contacted by Henry Knight (Russell Tovey), a man traumatised by the death of his father by a monstrous hound on Dartmoor years before. Investigating Dewer's Hollow, a local spot where the beast was allegedly seen, as well as the nearby Ministry of Defence testing site Baskerville, Sherlock and John uncover a conspiracy wherein one of the Baskerville scientists, Dr. Frankland (Clive Mantle), is continuing the work of H.O.U.N.D., an aborted project to create a hallucinogenic gas for military use. Sherlock and John discover that the legendary hound is an ordinary dog used for publicity that the hallucinogenic gas makes appear as a demonic monster. The \"hound\" that killed Henry's father was actually Frankland wearing a red-lensed gas mask and a T-shirt bearing the logo of the H.O.U.N.D. group. Confronting both the dog and Frankland at Dewer's Hollow, John and Lestrade shoot the dog. Frankland attempts to flee, but dies when he runs into a minefield. In the final scene, Mycroft releases a confined Jim Moriarty.\n\nBased on the novel The Hound of the Baskervilles.",
    "title": "The Hounds of Baskerville",
    "date": "8 January 2012 ",
    "episode": "E02",
    "season": ""
  },
  {
    "description": "\n\n\n\n\n\nThis episode's plot summary may be too long or excessively detailed. Please help improve it by removing unnecessary details and making it more concise. (April 2016) (Learn how and when to remove this template message)\n\n\nMoriarty launches a simultaneous heist on the Tower of London, Bank of England and Pentonville Prison using just a few lines of code that can break any security; crimes for which he allows himself to be captured and put on trial. He secures a not-guilty verdict through intimidating the jury and visits Sherlock, explaining he still intends to \"burn\" him, taunting him with a \"final problem\" for him to solve. Soon afterwards, Moriarty arranges for the kidnapping of the children of an American ambassador, who are terrified of Sherlock once he has them rescued. This leads to Sherlock becoming a suspect. Sherlock escapes arrest, and soon learns Moriarty is using the alias of an actor who claims to have been hired by Sherlock, and has seeded the press with a story of Sherlock being a fraud. The two meet on the roof of a hospital, where Moriarty explains that assassins will kill John, Mrs. Hudson and Lestrade if Sherlock does not commit suicide; he wants Sherlock to do this to cement his story after explaining that his \"god code\" was a myth. After a tense conversation, in which Moriarty realises the two are enough alike that Sherlock would be willing to do anything to Moriarty to get him to call off the assassins, Moriarty kills himself to force Sherlock to do the same. Sherlock calls John and \"confesses\" to being a fraud (which John refuses to believe). John pleads for him to come down. Sherlock states his final \"Goodbye\" and then steps off the roof.\n\nInspired by the short story \"The Final Problem\". The title alludes to the Reichenbach Falls, where Sherlock and Moriarty supposedly fall to their deaths in the original story.",
    "title": "The Reichenbach Fall",
    "date": "15 January 2012 ",
    "episode": "E03",
    "season": ""
  },
  {
    "description": "\nTwo years after his reported Reichenbach Fall demise, Sherlock, who has been cleared of all fraud charges against him, returns with Mycroft's help to a London under threat of terrorist attack. He tries to convince John - who has moved on and now has a girlfriend, Mary Morstan (Amanda Abbington) - to help; however, John is angry that Sherlock didn't tell him he was alive. Instead, Sherlock enlists Molly to assist him, but when John is kidnapped by unknown assailants and is rescued by Sherlock and Mary, John returns to help find the terrorists and an underground plot to blow up the Houses of Parliament during an all night sitting on Guy Fawkes Night.\n\nBased on the short story \"The Adventure of the Empty House\", and \"The Lost Special\" with numerous references to other works by Sir Arthur Conan Doyle, and other adaptations of the original stories.",
    "title": "The Empty Hearse",
    "date": "1 January 2014 ",
    "season": "S03",
    "episode": "E01"
  },
  {
    "description": "\nIt is John and Mary's wedding day and Sherlock is daunted by the task of delivering a Best Man's speech. As part of the speech, he recounts cases they have worked on including a soldier being stalked and somehow stabbed in a locked shower, a ghost dating women he dubs \"The Mayfly Man\", the last being part of John's disastrous stag night, among others. Before his speech ends, he realises that a murderer is present among the guests intent on killing John's old friend, Major Sholto. Sherlock saves the targeted guest, and then informs John and Mary of the meaning of the sign of three; namely that Mary is pregnant.\n\nThe title is based on the Holmes novel The Sign of the Four.",
    "title": "The Sign of Three",
    "date": "5 January 2014 ",
    "episode": "E02",
    "season": ""
  },
  {
    "description": "\nStolen letters lead Sherlock into conflict with Charles Augustus Magnussen, \"the Napoleon of blackmail\" who knows the personal weakness of every person of importance in the Western world. During the investigation Sherlock is shot and nearly killed by Mary, who is being blackmailed by Magnussen. After waking up from near-death, Sherlock escapes the hospital and lures Mary to an abandoned building, where he tricks her into revealing her false identity and attempted murder while John is listening nearby. Months later, Sherlock drugs everyone at the Holmes family Christmas party, steals Mycroft's laptop full of state secrets, and he and John take the laptop to Magnussen to trade for all of the files on 'Mary Morstan'. It's revealed that Magnussen keeps no files; it's all in his near-perfect photographic memory. To protect John, Mary, and their forthcoming child, Holmes kills Magnussen in front of Mycroft and several other witnesses, and as a result is sent off on a suicidal assignment overseas. However, he is brought back almost immediately because of a video being broadcast all over London with Jim Moriarty's face asking \"Did you miss me?\"\n\nThe title is based on Doyle's short story \"His Last Bow\", whereas the plot contains elements of two other short stories, \"The Adventure of Charles Augustus Milverton\" and \"The Man with the Twisted Lip\".",
    "title": "His Last Vow",
    "date": "12 January 2014 ",
    "episode": "E03",
    "season": ""
  },
  {
    "description": "\nSherlock, under the influence of drugs, enters his mind palace to solve a case from Victorian times about a bride shooting herself in the head and rising from the grave to kill her husband. If he can solve the murder it might lead him to how Moriarty has risen from the grave after similarly shooting himself in the head. He solves the case, and concludes that Moriarty is indeed dead, but \"is back\".\n\nA Victorian-themed episode, the title of which is based on the quote (\"Ricoletti of the club foot and his abominable wife\") from \"The Adventure of the Musgrave Ritual\", which refers to a case mentioned by Sherlock Holmes.",
    "title": "Douglas Mackinnon",
    "date": "11.64 ",
    "season": "S04",
    "episode": "E01"
  },
  {
    "description": "\nSherlock is asked to investigate the mysterious death of a young man, which he solves quickly but he is led into another mystery when a bust of Margaret Thatcher owned by the dead man's father is smashed. Further busts are smashed and Sherlock discovers that the mystery is linked to Mary and her past as a government agent. A figure from her past is bent on revenge in the belief that Mary betrayed him, but it is discovered that the traitor was the secretary of a British Parliamentary member. Mary is killed by the secretary when jumping in front of a bullet meant for Sherlock. John blames Sherlock for Mary's death, and their relationship is fractured.\n\nThe title is loosely based on the Doyle short story \"The Adventure of the Six Napoleons\". Whereas the plot contains element of other short stories, \"The Adventure of the Engineer's Thumb\" and \"The Adventure of the Yellow Face\".",
    "title": "The Six Thatchers",
    "date": "1 January 2017 ",
    "episode": "E02",
    "season": ""
  },
  {
    "description": "\nSherlock is contacted by the daughter of entrepreneur Culverton Smith, who she claims has confessed to a murder but she does not know who the victim was as her father has used a drug on her that inhibits memory. Sherlock deduces that her father is a serial killer and sets out to expose him, but he has returned to narcotics use since Mary's death and unable to clearly distinguish his own thoughts from reality. He confronts and attacks Smith, and John is forced to subdue him. While recovering in the hospital, Smith appears in Sherlock's room, confesses and then tries to kill him. John bursts in just in time to save Sherlock, who reveals that his behavior up to that point was not just an elaborate ploy to expose Smith, but also fulfilling Mary's last wish for him to \"Save John\". Later John's therapist reveals that she is actually Sherlock's secret sister, Eurus, and has been using disguises to manipulate both Sherlock and Watson. The episode ends with Eurus firing a shot at John.\n\nTitle and plot elements based loosely on the Doyle short story \"The Adventure of the Dying Detective\".",
    "title": "The Lying Detective",
    "date": "8 January 2017 ",
    "episode": "E03",
    "season": ""
  },
  {
    "description": "\nSherlock and Watson – who had been shot with a tranquilizer by Eurus – trick Mycroft into acknowledging her existence. Eurus steps up her attacks on Sherlock, culminating in the bombing of his Baker Street apartment. Sherlock, Watson and Mycroft venture forth to Sherrinford, a maximum-security psychiatric facility where Eurus is housed. Although Mycroft is sceptical at the suggestion that she has escaped, the trio discover that Eurus has compromised the staff and controls the entire Sherrinford asylum. She subjects the trio to a series of ordeals, testing their morals by forcing them to choose which of her victims live and die and ultimately forcing Sherlock to confront the memory of \"Redbeard\", a childhood friend whose death set in motion events that saw Eurus incarcerated. Realising that she will continue to test him until someone he cares for dies, Sherlock tries to connect with her on an emotional level, offering her the love and relationship with a brother that she never had, and Eurus stands down. Sherlock and Watson return to the Baker Street apartment, where they find another message from Mary imploring them to stay together. A time lapse montage shows them rebuilding the Baker Street flat to its original lived in form before meeting a series of unusual clients.\n\nTitle matches the Doyle short story \"The Final Problem\", whereas the plot contains elements from the short stories \"The Adventure of the Musgrave Ritual\", \"The Adventure of the Three Garridebs\" and \"The Adventure of the Gloria Scott\".",
    "title": "The Final Problem",
    "date": "15 January 2017 ",
    "season": "S05",
    "episode": "E01"
  }
]