[
  {
    "description": "In the small town of Laketop, New Zealand, a young girl named Tui Mitcham tries to drown herself in a lake. After she is rescued, a school nurse notices that Tui is pregnant. Robin Griffin, a police inspector from Sydney who specializes in working with children, is called to interview Tui at the police station.",
    "title": "Episode 1",
    "date": "March 18, 2013 (2013-03-18)",
    "directed_by": "Jane Campion",
    "season": "S01",
    "episode": "E01"
  },
  {
    "description": "Robin encounters two women from Paradise. They tell her Tui was with them the day before she disappeared but was gone in the morning. Robin organizes the local authorities to search for Tui. During the search, Robin walks into the lake and has a vision of Tui doing the same, the latter clenching her fists in the water.",
    "title": "Episode 2",
    "date": "March 18, 2013 (2013-03-18)",
    "directed_by": "Garth Davis with Jane Campion",
    "season": "",
    "episode": "E02"
  },
  {
    "description": "Matt Mitcham goes to Paradise and sits in on a session with GJ, the enigmatic leader of the camp. In a mocking tone, Matt asks the group about the human mind. GJ tells Matt that the human mind schemes. Later, Al meets Matt in the middle of the lake for a secret meeting.",
    "title": "Episode 3",
    "date": "March 25, 2013 (2013-03-25)",
    "directed_by": "Garth Davis",
    "season": "",
    "episode": "E03"
  },
  {
    "description": "Robin has dinner at Al's ultramodern, immaculate, lakeside house. Robin tells Al she thinks Tui's note, that said 'No One', meant there were multiple rapists. Al counsels Robin she is getting too involved in Tui's case, likely because of Robin's own history of having been gang raped, at age 15.",
    "title": "Episode 4",
    "date": "April 1, 2013 (2002-04-01)",
    "directed_by": "Garth Davis with Jane Campion",
    "season": "",
    "episode": "E04"
  },
  {
    "description": "Robin asks Johnno what he wanted to tell her about the night she was raped. Johnno describes how he heard Robin screaming and he peed himself. He says he found a latch to get out of the dog cage in the back of the truck but was too afraid to persist in trying to stop the men from raping her.",
    "title": "Episode 5",
    "date": "April 8, 2013 (2013-04-08)",
    "directed_by": "Jane Campion with Garth Davis",
    "season": "",
    "episode": "E05"
  },
  {
    "description": "Robin reveals to Johnno that she plans to make a case against Matt Mitcham, in hopes of encouraging Tui to come home. Robin shares that she caught Jamie attempting to take Tui with rohypnol, a 'date rape' drug that Robin suspects Matt manufactures. Johnno warns Robin against bringing a case against Matt, as Matt's drug business provides much of the town with a livelihood.",
    "title": "Episode 6",
    "date": "April 15, 2013 (2013-04-15)",
    "directed_by": "Garth Davis with Jane Campion",
    "season": "",
    "episode": "E06"
  },
  {
    "description": "Robin goes to work at the police station the next day and tells Al that Matt said he was her father. Matt, certain that Tui could not be pregnant, searches for and finds her with her newborn baby. As he is about to kill the baby, Tui appears and kills Matt. As the final twist, Robin discovers Sgt Parker has been pimping young boys and girls from the barista training, including Tui, to other men for sex.",
    "title": "Episode 7",
    "date": "April 15, 2013 (2013-04-15)",
    "directed_by": "Jane Campion",
    "season": "",
    "episode": "E07"
  }
]
