[
  {
    "description": "Con artist, master forger, and criminal extraordinaire Neal Caffrey (Matt Bomer) escapes from prison to find Kate Moreau (Alexandra Daddario), the woman he loves, only to end up behind bars again. He strikes up a deal with Federal Agent Peter Burke (Tim DeKay), the FBI agent who put him there, and together they take an unconventional route in tracking down a criminal known as \"The Dutchman\" (Mark Sheppard). Also introduced is Neal's trusted friend and partner in crime, Mozzie (Willie Garson), a fellow conman with extensive knowledge about everything. Neal uses his new position in the FBI to find clues that will eventually lead him to Kate, the man with the ring, and the truth.",
    "title": "Pilot",
    "date": "October 23, 2009 ",
    "directed_by": "Bronwen Hughes",
    "views": "5.40",
    "season": "S01",
    "episode": "E01"
  },
  {
    "description": "Neal and Peter infiltrate New York's Fashion Week as they try to prevent an international criminal from selling sensitive data hidden in one of the runway dresses.",
    "title": "Threads",
    "date": "October 30, 2009 ",
    "directed_by": "Dennie Gordon",
    "views": "5.08",
    "episode": "E02",
    "season": ""
  },
  {
    "description": "A New York mobster enlists the help of the FBI to recover a precious stolen Bible—a mission that tests Neal's loyalties with the FBI.",
    "title": "Book of Hours",
    "date": "November 6, 2009 ",
    "directed_by": "John T. Kretchmer",
    "views": "3.85",
    "episode": "E03",
    "season": ""
  },
  {
    "description": "Peter and Neal try to locate smuggled Iraqi artifacts where the lead suspect is a U.S. soldier and an acquaintance of Peter, but anomalies in the evidence suggest other forces at work.",
    "title": "Flip of the Coin",
    "date": "November 13, 2009 ",
    "directed_by": "Timothy Busfield",
    "views": "4.28",
    "episode": "E04",
    "season": ""
  },
  {
    "description": "Peter and Neal set up a sting to recover a valuable stolen portrait, but strain is put on their uneasy partnership when Peter suspects Neal will succumb to temptation. Neal finds out the truth about the stolen portrait, and returns it to its rightful owner.",
    "title": "The Portrait",
    "date": "November 20, 2009 ",
    "directed_by": "Allan Arkush",
    "views": "4.56",
    "episode": "E05",
    "season": ""
  },
  {
    "description": "Immersed in a dangerous case in Chinatown involving one of his aliases and a crafty Interpol agent, Neal is forced to decide between his loyalties to Peter and the FBI or his desire to find Kate. The interpol agent reveals that the man with the ring is in the FBI.",
    "title": "All In",
    "date": "November 27, 2009 ",
    "directed_by": "John T. Kretchmer",
    "views": "4.40",
    "episode": "E06",
    "season": ""
  },
  {
    "description": "Peter must determine if Neal's lying when Neal becomes a suspect in a jewelry heist. Meanwhile, Neal closes in on the man with the ring and discovers that he may be closer than he imagined. Introduced in the episode is FBI special agent Garrett Fowler (Noah Emmerich), an OPR agent bent on discrediting Peter and Neal with whatever means possible.",
    "title": "Free Fall",
    "date": "December 4, 2009 ",
    "directed_by": "Kevin Bray",
    "views": "5.55",
    "episode": "E07",
    "season": ""
  },
  {
    "description": "Neal infiltrates a corrupt Wall Street brokerage firm and Peter must go undercover alongside him. Neal suspects Peter as the man with the ring and confronts Peter about it. Peter initially denies but after the case is closed, Peter tells Neal that he had spoken with Kate. Peter tells Neal that Kate mentioned wanting a music box that Neal had stolen. Peter also tells Neal that it does not seem Kate was acting under the control of Fowler. Neal refuses to believe Peter and sets out to find the music box that Fowler wants.",
    "title": "Hard Sell",
    "date": "January 19, 2010 ",
    "directed_by": "John T. Kretchmer",
    "views": "4.70",
    "episode": "E08",
    "season": ""
  },
  {
    "description": "Peter and Neal discover a corrupt judge working with Fowler, and devise a plan to take them down. Meanwhile, Neal asks Peter to get a message to Kate as Mozzie sweeps Peter's house for bugs. At the end of the episode, Neal retrieves a paper flower from the grave of Kate's father, Robert, another cryptic message from Kate.",
    "title": "Bad Judgment",
    "date": "January 26, 2010 ",
    "directed_by": "John T. Kretchmer",
    "views": "4.30",
    "episode": "E09",
    "season": ""
  },
  {
    "description": "June is approached by a sketchy charity when her granddaughter is removed from the waiting list for a kidney transplant. Neal and Peter decide to investigate the charity, suspecting that transplants are being bought with \"donations\".",
    "title": "Vital Signs",
    "date": "February 2, 2010 ",
    "directed_by": "Dennie Gordon",
    "views": "2.89",
    "episode": "E10",
    "season": ""
  },
  {
    "description": "The FBI investigates a murder and a mysterious coded list and Neal catches up with Alex Hunter (Gloria Votsis), an old friend who might know something about the music box, but isn't too keen on Neal's connection with the FBI.",
    "title": "Home Invasion",
    "date": "February 9, 2010 ",
    "directed_by": "Ken Girotti",
    "views": "3.83",
    "episode": "E11",
    "season": ""
  },
  {
    "description": "When Neal is confronted by his blue-collar counterpart Matthew Keller (Ross McCall), he must revive a decades-old competition to create an impossible forgery of a bottle of wine. However, things aren't exactly as they seem.",
    "title": "Bottlenecked",
    "date": "February 23, 2010 ",
    "directed_by": "Phil Abraham",
    "views": "3.57",
    "episode": "E12",
    "season": ""
  },
  {
    "description": "When trying to resolve a kidnapping, Neal is apprehended by an old friend and is forced to play his game to save the one who was kidnapped. Alex finally reveals the location of the music box to Neal, and teams up to steal it. Peter tells Neal that he knows Neal is planning to steal it, and tells him that he has the option to stop looking for Kate and do something good with his life.",
    "title": "Front Man",
    "date": "March 2, 2010 ",
    "directed_by": "Michael Smith",
    "views": "3.48",
    "episode": "E13",
    "season": ""
  },
  {
    "description": "After discovering the music box in Manhattan, Neal and his friends plan a party heist to steal it. Things come to a head as Fowler and Peter square off, while Neal demands Kate in exchange for the box. Peter makes it to the airstrip before Neal takes off with Kate, and tries to stop him. Neal turns around, and admits that Peter is the only one who can change his mind. Before he can join Kate, Neal looks back at Peter, and the jet explodes.",
    "title": "Out of the Box",
    "date": "March 9, 2010 ",
    "directed_by": "Kevin Bray",
    "views": "4.04",
    "episode": "E14",
    "season": ""
  },
  {
    "description": "In the aftermath of Kate's death, Neal's deal and Peter's job are in jeopardy. To prove themselves, they must catch The Architect (Tim Matheson), a high-profile bank robber.",
    "title": "Withdrawal",
    "date": "July 13, 2010 ",
    "directed_by": "Tim Matheson",
    "views": "4.29",
    "season": "S02",
    "episode": "E01"
  },
  {
    "description": "Neal goes undercover as a political \"fixer\" in order to bring down a corrupt politician. Diana and Peter's lead brings them to an unidentified man who escapes their pursuit. It is also revealed that Peter had Diana keep the music box's location hidden even from Peter himself. Neal begins to suspect that Peter is investigating the plane explosion behind his back.",
    "title": "Need to Know",
    "date": "July 20, 2010 ",
    "directed_by": "Sanford Bookstaver",
    "views": "3.96",
    "episode": "E02",
    "season": ""
  },
  {
    "description": "Peter sends Neal back to school after someone copycats one of his old schemes. Alex returns with some bad news. Diana discovers the music box is hiding something. Peter and Diana set out to find the missing key, which is the last piece of the music box that Alex gives Neal before leaving for Italy.",
    "title": "Copycat Caffrey",
    "date": "July 27, 2010 ",
    "directed_by": "Paul Holahan",
    "views": "3.72",
    "episode": "E03",
    "season": ""
  },
  {
    "description": "For the first time in his life, Mozzie must turn to the FBI for help when the person of his affection, a waitress from a local diner (Diane Farr) disappears. Mozzie uses cryptic clues, often references to book texts, left by Gina to find and rescue her, which evolves to a case involving a man on the FBI's radar for quite some time.",
    "title": "By the Book",
    "date": "August 3, 2010 ",
    "directed_by": "Michael Smith",
    "views": "4.10",
    "episode": "E04",
    "season": ""
  },
  {
    "description": "A routine bond theft escalates into an attempted murder when Neal is unknowingly hired to kill the assigned insurance investigator, Sara Ellis (Hilarie Burton), the same woman who had testified against him regarding his alleged theft of a Raphael painting a few years earlier. Meanwhile, Neal and Mozzie investigate the jet's wreckage, concluding that the jet was rigged to explode midair, but was detonated early by someone. They manage to have the cockpit's voice recorder sent to the insurance company Sterling Bosch, under the care of Sara Ellis. After taking the impostor who ordered the hit on Sara, Neal tries to recover the package from her apartment, but is interrupted by an assassination attempt by the real assassin, who is subsequently captured by Peter and his team.",
    "title": "Unfinished Business",
    "date": "August 10, 2010 ",
    "directed_by": "Tricia Brock",
    "views": "4.00",
    "episode": "E05",
    "season": ""
  },
  {
    "description": "The arrest of a jewel thief leads Peter and Neal toward a much more heinous extortion case against adoptive parents. Mozzie breaks into Sara's apartment and recovers the recording, only to have it taken back by Sara and her detectives in a search of Neal's apartment. After teaming up with the mob, Peter and Neal take the adoption lawyer (John Larroquette) into custody. Sara returns to Neal's apartment after finding out what happened to Kate, and promises to help Neal with his investigation. The recording reveals that Kate called an unidentified person shortly before the jet exploded, which prompts Neal and friends to hunt down who was on the other end of the phone.",
    "title": "In the Red",
    "date": "August 17, 2010 ",
    "directed_by": "David Straiton",
    "views": "4.48",
    "episode": "E06",
    "season": ""
  },
  {
    "description": "An FBI Agent is accused of selling witness locations during criminal trials, and the U.S. Marshals ask Peter and Neal for help tracking down the suspect. Peter winds up befriending the suspect upon discovering that the U.S. Marshal in charge of the investigation is actually selling the locations, and goes on the run with him trying to clear his name. Moz discovers that the mystery voice on the black box recording belongs to the still-in-hiding Garrett Fowler.",
    "title": "Prisoner's Dilemma",
    "date": "August 24, 2010 ",
    "directed_by": "Vincent Misiano",
    "views": "4.60",
    "episode": "E07",
    "season": ""
  },
  {
    "description": "Neal and Peter must go undercover into the world of corporate espionage after a tech company's head researcher is murdered. Mozzie and Diana are put together to look over Kate's murder, and Mozzie realizes that Diana has the music box and Peter knows where it is. Peter then shows the music box to Neal, and Neal reveals the key Alex gave him. Neal tells Peter, \"No more secrets\", before opening the box.",
    "title": "Company Man",
    "date": "August 31, 2010 ",
    "directed_by": "Rosemary Rodriguez",
    "views": "4.44",
    "episode": "E08",
    "season": ""
  },
  {
    "description": "The gang finds Fowler (Noah Emmerich) and finds out he is innocent. He is being blackmailed by the same person Peter has a patchwork picture of. Mozzie cracks the code inside of the musicbox. Before he can tell anyone, he is shot by an unidentified man (Paul Blackthorne) who steals the code.",
    "title": "Point Blank",
    "date": "September 7, 2010 ",
    "directed_by": "Kevin Bray",
    "views": "4.72",
    "episode": "E09",
    "season": ""
  },
  {
    "description": "Peter is framed for a crime he did not commit, and is subsequently suspended from the FBI. Neal helps him organize a con in order to catch the real criminal (Paul Blackthorne), find who shot Mozzie, and clear Peter's name.",
    "title": "Burke's Seven",
    "date": "January 18, 2011 ",
    "directed_by": "Michael Smith",
    "views": "3.81",
    "episode": "E10",
    "season": ""
  },
  {
    "description": "After Peter and Neal realize that Vincent Adler (Andrew McCarthy) is behind Kate's murder, Peter has a talk with Neal where he reveals everything from the time he met Mozzie to when he was caught by the FBI.",
    "title": "Forging Bonds",
    "date": "January 25, 2011 ",
    "directed_by": "John T. Kretchmer",
    "views": "3.90",
    "episode": "E11",
    "season": ""
  },
  {
    "description": "Peter and Neal must set foot on Burmese soil when they visit its embassy in order to prove the innocence of the son of an American diplomat.",
    "title": "What Happens in Burma...",
    "date": "February 1, 2011 ",
    "directed_by": "John T. Kretchmer",
    "views": "3.46",
    "episode": "E12",
    "season": ""
  },
  {
    "description": "Neal is approached by an old friend of June's (Billy Dee Williams) and believes that he has some ulterior motives.",
    "title": "Countermeasures",
    "date": "February 8, 2011 ",
    "directed_by": "Michael Smith",
    "views": "3.46",
    "episode": "E13",
    "season": ""
  },
  {
    "description": "Matthew Keller (Ross McCall) returns when he contacts Neal and Peter from prison asking for a favor. Over the course of their investigation, Peter is kidnapped and must be found before he is killed which inadvertently forces Neal to deal with his feelings from losing Kate .",
    "title": "Payback",
    "date": "February 22, 2011 ",
    "directed_by": "Russell Lee Fine",
    "views": "3.27",
    "episode": "E14",
    "season": ""
  },
  {
    "description": "Neal and Peter switch identities after they are approached by a woman (Cody Horn) who claims that her boss (Richard Schiff) is behind a collusion scheme.",
    "title": "Power Play",
    "date": "March 1, 2011 ",
    "directed_by": "Jeff F. King",
    "views": "3.30",
    "season": "S03",
    "episode": "E01"
  },
  {
    "description": "Neal and Peter are abducted by Adler (Andrew McCarthy), and Neal gets closer to uncovering the secret behind Kate's death.",
    "title": "Under the Radar",
    "date": "March 8, 2011 ",
    "directed_by": "John T. Kretchmer",
    "views": "3.81",
    "episode": "E02",
    "season": ""
  },
  {
    "description": "Despite their newly-arisen trust issues, Neal and Peter have to work together to catch a thief who took his stash out of the Federal Reserve.",
    "title": "On Guard",
    "date": "June 7, 2011 ",
    "directed_by": "Russell Lee Fine",
    "views": "3.90",
    "episode": "E03",
    "season": ""
  },
  {
    "description": "Peter and Neal find a treasure map on a forged will, and soon enter a race to locate the treasure and save the daughter of the beneficiary.",
    "title": "Where There's a Will",
    "date": "June 14, 2011 ",
    "directed_by": "Sanford Bookstaver",
    "views": "3.71",
    "episode": "E04",
    "season": ""
  },
  {
    "description": "When a magazine journalist's (Jayne Atkinson) life is threatened, Diana goes undercover as her assistant to protect her while Peter and Neal investigate the subject of the journalist's story. Meanwhile, Neal and Sara have a date with Diana and Christie (Moran Atias).",
    "title": "Deadline",
    "date": "June 21, 2011 ",
    "directed_by": "Michael Smith",
    "views": "3.67",
    "episode": "E05",
    "season": ""
  },
  {
    "description": "When a mobster (Al Sapienza) from Mozzie's Detroit childhood surfaces in Manhattan, Neal and Peter must help their friend rework a scam from his past to take down the ruthless gangster and prevent a mob war.",
    "title": "The Dentist of Detroit",
    "date": "June 28, 2011 ",
    "directed_by": "Dennie Gordon",
    "views": "3.72",
    "episode": "E06",
    "season": ""
  },
  {
    "description": "When a black widow (Mädchen Amick) arrives in New York, Neal and Peter go undercover as wealthy bachelors to find her next target.",
    "title": "Veiled Threat",
    "date": "July 5, 2011 ",
    "directed_by": "Paul Holahan",
    "views": "4.19",
    "episode": "E07",
    "season": ""
  },
  {
    "description": "When a teenage conman (Hutch Dano) goes on a wild crime spree in New York, Peter realizes he has a new Neal Caffrey on his hands.",
    "title": "Scott Free",
    "date": "July 12, 2011 ",
    "directed_by": "Tricia Brock",
    "views": "3.84",
    "episode": "E08",
    "season": ""
  },
  {
    "description": "When an expert hacker drains a prominent New York bank, Neal assumes the criminal's identity in order to spend the pilfered fortune and draw him out of hiding. Mozzie finds himself in an unfamiliar situation when the hacker's former accomplice (Lena Headey) switches sides. Meanwhile, Sara temporarily moves in with Neal and discovers the surveillance camera footage of Neal and Mozzie's treasure.",
    "title": "Taking Account",
    "date": "July 19, 2011 ",
    "directed_by": "Michael Smith",
    "views": "4.18",
    "episode": "E09",
    "season": ""
  },
  {
    "description": "When an old Naval Academy buddy of Agent Jones goes missing, Peter and Neal delve into the dangerous world of international private security to find him. While Jones deals with realizing his friend might not be who he remembers and meeting an old flame, Mozzie convinces Neal to break into Peter and Elizabeth's house to go after the manifest.",
    "title": "As You Were",
    "date": "July 26, 2011 ",
    "directed_by": "David Straiton",
    "views": "3.89",
    "episode": "E10",
    "season": ""
  },
  {
    "description": "When Neal and Peter discover wanted fugitive Matthew Keller (Ross McCall) is smuggling priceless Egyptian antiquities into the city, Neal must go undercover with an exotic and beautiful Egyptologist (Eliza Dushku) to locate and capture his foe.",
    "title": "On the Fence",
    "date": "August 2, 2011 ",
    "directed_by": "Paul Holahan",
    "views": "3.71",
    "episode": "E11",
    "season": ""
  },
  {
    "description": "Neal and Mozzie must stay one step ahead of the FBI while appearing to work with them in order to keep them from discovering that they possess the treasure. Later, Peter returns home to discover that Elizabeth has been kidnapped by Matthew Keller.",
    "title": "Countdown",
    "date": "August 9, 2011 ",
    "directed_by": "John Kretchmer",
    "views": "4.30",
    "episode": "E12",
    "season": ""
  },
  {
    "description": "Elizabeth escapes from Keller through a combination of FBI diligence and her own cleverness. Meanwhile, as a delaying tactic, Peter, Neal and Mozzie arrange to have the treasure surrounded by an unsuspecting NYPD, and must work with Keller to get it away from them.",
    "title": "Checkmate",
    "date": "January 17, 2012 ",
    "directed_by": "John Kretchmer",
    "views": "3.23",
    "episode": "E13",
    "season": ""
  },
  {
    "description": "A student (Graham Phillips) at a prestigious prep school asks Neal and Peter to look into the disappearance of scholarship funds, which he believes was orchestrated by the father (Dylan Baker) of his crush (Elizabeth Gillies). In order to investigate, Neal must go undercover as a substitute teacher.",
    "title": "Upper West Side Story",
    "date": "January 24, 2012 ",
    "directed_by": "Russell Lee Fine",
    "views": "3.47",
    "episode": "E14",
    "season": ""
  },
  {
    "description": "Neal and Peter investigate a robbery plot at a hotel after Elizabeth overhears a neighbor (Joe Manganiello) having a suspicious conversation. When Neal suggests Peter ask Mozzie to keep an eye on her, he may switch from a babysitter to her accomplice when Elizabeth tries to help.",
    "title": "Neighborhood Watch",
    "date": "January 31, 2012 ",
    "directed_by": "Andrew McCarthy",
    "views": "3.04",
    "season": "S04",
    "episode": "E01"
  },
  {
    "description": "While Peter is tied up hosting Elizabeth's parents (Tom Skerritt and Debra Monk), Neal is assigned to help Sara search for a missing Stradivarius.",
    "title": "Pulling Strings",
    "date": "February 7, 2012 ",
    "directed_by": "Anton Cropper",
    "views": "2.47",
    "episode": "E02",
    "season": ""
  },
  {
    "description": "Neal goes undercover with a gang of cons in order to steal valuable memorabilia from Yankee stadium.",
    "title": "Stealing Home",
    "date": "February 21, 2012 ",
    "directed_by": "Tim DeKay",
    "views": "2.31",
    "episode": "E03",
    "season": ""
  },
  {
    "description": "Agent Kramer (Beau Bridges) tries to sabotage Neal's commutation while Neal tries to fix a mistake from his past. Peter must make a difficult decision. With Peter's help, Neal is able to get away with his theft of the painting and faces the committee, telling them and later Peter that whether he is released or not, he plans to continue working for the FBI because he now has a purpose and a life. Unfortunately, Agent Kramer refuses to back down, wishing to take Neal back to D.C. by any means necessary. Peter is able to secretly warn Neal about Kramer's plan to 'steal' Neal and make him work for him. This gives Neal time to escape, so he cuts off his anklet and flees the country with Mozzie before the committee can make its decision.",
    "title": "Judgment Day",
    "date": "February 28, 2012 ",
    "directed_by": "Russell Lee Fine",
    "views": "2.55",
    "episode": "E04",
    "season": ""
  },
  {
    "description": "After Neal and Mozzie fled, Kyle Collins (Mekhi Phifer) of the Office of International Affairs tries to find Neal after the FBI fails for six weeks. Peter finally manages to talk to Neal, and background sounds help Peter, Jones, and Diana deduce that Neal's in Cape Verde. Peter heads there to try to find Neal first. Unfortunately, Collins searches Peter's home after he leaves and finds his map with Cape Verde circled. Collins and Peter meet in a cafe where Collins announces a $500,000 bounty on Neal's head. Collins purposely does not specify \"alive\". Neal, Mozzie, and Peter look for a way out and turn to different sources for help. Peter and Mozzie go to one of Mozzie's friends, while Neal goes to the island's richest man, a very private person named Dobbs (Gregg Henry). Dobbs soon reveals that he is aware of Neal's true identity, and Collins arrives to capture Neal.",
    "title": "Wanted",
    "date": "July 10, 2012 ",
    "directed_by": "Paul Holahan",
    "views": "3.21",
    "episode": "E05",
    "season": ""
  },
  {
    "description": "Collins holds Neal prisoner on Dobbs' estate, and shoots Neal in the leg when he discovers Neal has broken loose from his restraints. Peter and Mozzie covertly help Neal get away from Collins, and upon planning their escape, discover Dobbs is really one of the FBI's most wanted men. Together, they set up a con for Neal to help capture Dobbs and return to New York under his original deal. In the end Peter gets reassigned.",
    "title": "Most Wanted",
    "date": "July 17, 2012 ",
    "directed_by": "Paul Holahan",
    "views": "2.98",
    "episode": "E06",
    "season": ""
  },
  {
    "description": "With Peter reassigned to the Evidence room, he and Neal go up against David Cook (Michael Weston), a criminal mastermind whom Peter has been tracking since joining the FBI.",
    "title": "Diminishing Returns",
    "date": "July 24, 2012 ",
    "directed_by": "Stefan Schwartz",
    "views": "3.01",
    "episode": "E07",
    "season": ""
  },
  {
    "description": "While helping Sara (Hilarie Burton) resolve an insider trading scandal, Neal saves the life of the alleged perpetrator's widow (Laura Vandervoort), but he has to stay undercover with her to help prevent the theft of her insurance settlement. Meanwhile, Peter gets reassigned back to the White Collar division, and Ellen is shot after being recalled into Witness Protection, leaving Neal with unanswered questions.",
    "title": "Parting Shots",
    "date": "July 31, 2012 ",
    "directed_by": "Robert Duncan McNeill",
    "views": "2.82",
    "episode": "E08",
    "season": ""
  },
  {
    "description": "When Ellen is murdered, Neal leaves himself open to being blackmailed by the art thief they're after in exchange for information, which may lead to a breach of trust between him and Peter.",
    "title": "Honor Among Thieves",
    "date": "August 14, 2012 ",
    "directed_by": "Arlene Sanford",
    "views": "2.93",
    "episode": "E09",
    "season": ""
  },
  {
    "description": "Mozzie's purchase of a storage unit leads him to finding a number of clues about a spy organization from the Revolutionary War that may still be operating today.",
    "title": "Identity Crisis",
    "date": "August 21, 2012 ",
    "directed_by": "David Straiton",
    "views": "3.89",
    "episode": "E10",
    "season": ""
  },
  {
    "description": "With help from Mozzie and Sara (Hilarie Burton), Peter and Neal attempt to ensure the conviction of a corrupt developer. Their main obstacle is a clever woman who acts as a no-questions-asked fixer for a variety of clients including Sara's company. Meanwhile, Neal meets with Ellen's friend Sam, who tells him of a conspiracy including highly placed law enforcement officials.",
    "title": "Compromising Positions",
    "date": "August 28, 2012 ",
    "directed_by": "Paul Holahan",
    "views": "3.36",
    "episode": "E11",
    "season": ""
  },
  {
    "description": "Neal is contacted again by his old acquaintance and fellow thief Alex (Gloria Votsis), who is being investigated by the FBI in relation to a heist for which Neal is arrested. Peter furthers his covert investigation of \"Sam\" behind Neal's back when Neal receives a suspicious package from Ellen delivered by the Marshals. Alex is in town on more business, which causes some rifts between Peter, Neal, and Mozzie.",
    "title": "Ancient History",
    "date": "September 4, 2012 ",
    "directed_by": "Russell Lee Fine",
    "views": "3.38",
    "episode": "E12",
    "season": ""
  },
  {
    "description": "Peter sends Neal undercover as a Wall Street stock trader. Neal discovers a White Collar boxing ring where traders fight for insider information. In order to take down the corrupt CEO, Peter and Neal must step out of the office and step in to the ring. Peter makes a huge mistake that sends Sam into hiding.",
    "title": "Gloves Off",
    "date": "September 11, 2012 ",
    "directed_by": "Renny Harlin",
    "views": "3.80",
    "episode": "E13",
    "season": ""
  },
  {
    "description": "Peter and Neal attend an FBI conference where someone is trying to steal high valued defense technology, but discover the thief's plan to kidnap the designer instead. After Peter learns the real Sam is dead, a DNA test shows the man they believe to be Sam is actually Neal's father.",
    "title": "Vested Interest",
    "date": "September 18, 2012 ",
    "directed_by": "Russell Lee Fine",
    "views": "3.41",
    "episode": "E14",
    "season": ""
  },
  {
    "description": "Neal's father James explains how as a young cop he began working for a gangster named Dennis Flynn, now deceased. When he tried to end his employment Flynn framed him for the murder of his superior, and he confessed when some unknown person with high law enforcement connections threatened his wife, Neal, and Ellen. Believing him guilty, Neal's mother refused further contact. In the present, Neal and Peter infiltrate the operations of Flynn's son, also named Dennis. They pose as the maker and potential buyer, respectively, of counterfeit whisky, and are able to prove that the younger Dennis killed Ellen. But Dennis is killed in custody, showing that the law enforcement conspiracy is still in operation. James is sent to a safe house while Neal and Peter plan their next move.",
    "title": "Family Business",
    "date": "January 22, 2013 ",
    "directed_by": "Paul Holahan",
    "views": "2.77",
    "season": "S05",
    "episode": "E01"
  },
  {
    "description": "Neal and Peter discover that Dennis Flynn's fatal prisoner transfer was ordered by U.S. Senator Terrence Pratt (Titus Welliver) who was once James' Captain in the Washington police. They plan to bring him down by proving fraud charges against his associate, land developer Cole Edwards (Reed Diamond). But Edwards remains loyal to the Senator, who retaliates by ending the FBI career of Peter's boss. Meanwhile Mozzie is paired up with Jones to search for the meaning of a key left to Neal in Ellen's personal effects. Elizabeth asks Neal to lie to Peter about the key to protect him after an attempted assassination, but Peter learns the truth from Jones and, greatly offended, continues to investigate on his own.",
    "title": "Brass Tacks",
    "date": "January 29, 2013 ",
    "directed_by": "Anton Cropper",
    "views": "2.61",
    "episode": "E02",
    "season": ""
  },
  {
    "description": "Two brothers are attempting to revive the famous Cotton Club, but one is also involved in fraudulent sales of taxi medallions. To investigate, Neal and Peter pose as promoters and book June as a singer for the club's opening. Meanwhile, Peter and Neal each independently discover the NYC location indicated by the key: the Empire State Building.",
    "title": "Empire City",
    "date": "February 5, 2013 ",
    "directed_by": "Tim DeKay",
    "views": "2.28",
    "episode": "E03",
    "season": ""
  },
  {
    "description": "A couple on a romantic crime spree take two hostages who turn out to be Peter and Elizabeth. Neal must anticipate their next crime to effect a rescue. Sara has a potential new position in London. Neal and Mozzie determine that Ellen's evidence about James is stored in an office on the 50th floor of the Empire State Building.",
    "title": "Shoot the Moon",
    "date": "February 19, 2013 ",
    "directed_by": "Russell Lee Fine",
    "views": "2.42",
    "episode": "E04",
    "season": ""
  },
  {
    "description": "The former assistant to a dead master sculptor has \"found\" a new work which Neal thinks is a forgery. With a high-tech scanner diverted from the forgery investigation, Neal, Mozzie and James determine the exact location of Ellen's evidence box. But Peter's new FBI boss Amanda Calloway (Emily Procter) is on to them, and she is reporting to Senator Pratt.",
    "title": "The Original",
    "date": "February 26, 2013 ",
    "directed_by": "John Kretchmer",
    "views": "2.12",
    "episode": "E05",
    "season": ""
  },
  {
    "description": "Neal concocts an elaborate plan to get the evidence box out of the Empire State Building even though Pratt and Calloway are also searching for it. Pratt's man stops an escaping James, who is carrying what he thinks is the box but is actually a decoy given to him by Mozzie. In the ensuing confrontation, James kills Pratt with Peter's gun and escapes, leaving Peter to be arrested for the murder with all the physical evidence against him. Neal learns from the real evidence box that James was actually guilty of the murder for which he was imprisoned. Neal begs James to go to the FBI and tell the truth to free Peter, but James coldly refuses and leaves Neal with the realization that his father used him.",
    "title": "In the Wind",
    "date": "March 5, 2013 ",
    "directed_by": "Russell Lee Fine",
    "views": "2.36",
    "episode": "E06",
    "season": ""
  },
  {
    "description": "Peter is about to be prosecuted for murder, which could end his FBI career even if he were acquitted. Elizabeth urges Neal to save him at any cost. Neal is contacted by the Dutchman, Curtis Hagan (Mark Sheppard), the man he helped Peter convict of forgery in their first case together. Hagan has influence over Peter's prosecutor, and can get the charges dismissed if Neal can make a convincing fake audio confession from James. Neal and Mozzie do this and learn Hagan's price: Neal must steal a collection of gold coins from a secure building. Neal does this with the aid of a device Mozzie has built to spoof the anklet's signal to make him appear to be at home. Neal then learns that the Dutchman has filmed the heist and plans to blackmail him into committing further crimes for him. Peter is promoted to be head of the NYC White Collar Crime office. He gives Neal a new anklet and promises him a new handler from outside the office. Their last case together is to investigate the coin robbery.",
    "title": "At What Price",
    "date": "October 17, 2013 ",
    "directed_by": "Stefan Schwartz",
    "views": "2.53",
    "episode": "E07",
    "season": ""
  },
  {
    "description": "Neal meets his new handler David Siegel (Warren Kole), a young star agent. The FBI have arrested the proprietor of a website for stolen goods, and they plan to arrest his contacts while a very pregnant Diana works hard to make the website appear to continue operating. Neal and Siegel are sent to the warehouse of an art dealer involved with the website, who turns out to be Mozzie. He escapes, but Siegel sees him; though Neal is able to keep Peter from learning that the dealer is Mozzie, Siegel uncovers the \"Teddy\" identity behind Mozzie's vast holdings. This is actually what Mozzie believes to be his true identity, that of a baby who disappeared shortly before Mozzie was found. Mozzie returns to the warehouse, sets fire to it, and vanishes into a hideout beneath it. The FBI believe Teddy is dead, but Diana is not fooled, goes to the warehouse, and finds the hideout. She tries to arrest Mozzie but suddenly goes into labor. Mozzie delivers the baby, whom she names \"Theo\", and she so far keeps his secret. Neal breaks into the FBI evidence room and destroys evidence against Hagan, which will give him a chance in his retrial.",
    "title": "Out of the Frying Pan",
    "date": "October 24, 2013 ",
    "directed_by": "Roger Kumble",
    "views": "2.13",
    "episode": "E08",
    "season": ""
  },
  {
    "description": "Hagan is free, and he gives Neal 48 hours to steal one chapter of a mysterious book on display at a museum. Neal and Mozzie plan to fool another criminal, Zev, into breaking into the museum to steal a painting, with Neal taking the book chapter at the same time and then catching Zev. To get access, he befriends a museum worker named Rebecca (Bridget Regan) and steals her key. Neal tells Siegel he has heard chatter indicating that the museum is about to be robbed, and Peter authorizes a stakeout. Mozzie disables the security cameras of the museum and Zev enters. Neal is delayed when Peter, nostalgic about his former partnership, joins the stakeout. However, he is able to enter the building and replace the chapter with a forgery Mozzie has created. Zev trips the alarms but still escapes; Neal leaves prints behind when he escapes himself. Neal and Peter find Zev's prints at the crime scene, allowing the FBI to arrest Zev and recover the painting. Neal gives the book chapter to Hagan after making a copy; he and Mozzie will try to figure out why Hagan wanted it. Siegel secretly witnesses the meeting between Neal and Hagan. Rebecca is fired for the security breach, after learning that Neal works with the FBI. Siegel is found murdered on the street.",
    "title": "One Last Stakeout",
    "date": "October 31, 2013 ",
    "directed_by": "Russell Lee Fine",
    "views": "2.38",
    "episode": "E09",
    "season": ""
  },
  {
    "description": "The now-destitute Mozzie has moved into Neal's apartment. With the investigation of Siegel's death stalled, Peter joins Neal for a new field assignment. A disoriented man named Nate Griffith (David Call) walks into the Bureau, carrying a packet of cash, confessing that he broke into a vault and stole $2 million. Peter and Neal trace Griffith to Dr. Mara Summers, his psychiatrist. Peter decides to examine the vault with Neal. The bank claims ignorance of any break-in. Neal checks their records for details on the vault, and traces it back to \"Niteowl Holdings\". Peter and Neal suspect Dr. Summers has something to do with the robbery. Peter traces Niteowl Holdings to Shane Jacobi, an ex-con, and confronts him. He denies any connection to Niteowl Holdings, but appears surprised to learn that the vault was robbed. Meanwhile, Neal approaches Dr. Summers as a patient, hoping to glean some information from her. But she drugs him, and gets information on the ongoing investigation from him. Moz identifies the drug as \"Good Night Cinderella\", used by Asian prostitutes to rob their johns. He suggests that the best way to recall what he told Dr. Summers would be to go back under the drug again. Moz makes the drug, Neal drinks it, and Peter and Moz help Neal recall the entire conversation. The next day, Peter and Jones visit Griffith's house, and on discovering Jacobi there, they arrest him. They realize that Summers manipulated Griffith into robbing Jacobi's vault. Neal gets a confession from Dr. Summers by putting her under the drug. The FBI arrest Dr. Summers but do not recover the money, because Neal has diverted it and given it to Mozzie to start afresh. He tells Mozzie that he plans to free himself from all constraints, including both Hagan's and Peter's.",
    "title": "Controlling Interest",
    "date": "November 7, 2013 ",
    "directed_by": "Kevin Bray",
    "views": "2.24",
    "episode": "E10",
    "season": ""
  },
  {
    "description": "A wealthy man (Richard Thomas) hires Elizabeth to choose art presents for his son, who has recently resurfaced long after disappearing as a teenager. She was a tutor for the real son before he vanished, and in talking to the alleged son about art she begins to suspect that he is an impostor. Neal takes a job as butler to the household to investigate. Elizabeth is fired after she voices her suspicions and the alleged son passes a DNA test. However, Neal and Peter are able to prove that he faked the test and to find the location where he is holding the real son prisoner, in order to get the information he needs for his deception. Meanwhile, Peter battles a flu-like illness which is relieved by a concoction that Mozzie prepares from the honey of the beehives he has introduced to Neal's apartment.",
    "title": "Master Plan",
    "date": "November 14, 2013 ",
    "directed_by": "Jeff F. King",
    "views": "2.21",
    "episode": "E11",
    "season": ""
  },
  {
    "description": "Peter and Neal search for a Russian forger of U.S. passports and find Sergei, the cousin of a notorious Russian gangster and sponsor of a figure skater named Katya (Annet Mahendru). They go undercover as a skating coach and sports agent respectively, and are able to arrest Sergei and several Russian criminals to whom he had provided passports. Meanwhile, Neal and Mozzie enlist the still unemployed Rebecca's help in decoding the book chapter by posing as FBI agents. Peter and Jones know they are up to something, and Peter finds evidence of the fake FBI office they created to deceive her. Rebecca tells them that Mosconi, the 19th-century author of the book, never included a chapter 13 in his books, the same chapter that Neal believed he removed from the book and gave to Hagan.",
    "title": "Ice Breaker",
    "date": "November 21, 2013 ",
    "directed_by": "Eric Stoltz",
    "views": "2.49",
    "episode": "E12",
    "season": ""
  },
  {
    "description": "Peter's anniversary dinner with Elizabeth is interrupted by an attractive woman named Jill (Kim Dickens), his ex-girlfriend and former classmate at the FBI academy. Jill now works for a secretive division of the FBI and wants Peter's help in buying a computer chip, potentially of great use to enemy nations, from a hacker now living in Manhattan. Jill insists that no one else know anything about the mission, which makes Elizabeth suspicious and later interferes with Peter's efforts to conduct the buy safely. Peter and Jill notice and identify two mercenaries that are also following the hacker, but when they go to the hotel room for the buy, they are unaware that the mercenaries have evaded Jones' surveillance. Elizabeth and Neal come to the same hotel at the same time, suspecting Jill's intentions toward Peter. When the mercenaries capture everyone, only Elizabeth and Neal's initiative saves the day. Meanwhile, Neal and Jones recover Siegel's gun and FBI badge; though the petty criminal who was using them in carjackings appears to be a dead end, but Peter finds a possible clue in the badge. Also, Neal and Rebecca are able to decipher a picture of a stained glass window from the book chapter, and Rebecca believes the window might be in New York, where Mosconi briefly lived in 1886. Later, he is able to show her the window, and they kiss.",
    "title": "Quantico Closure",
    "date": "December 5, 2013 ",
    "directed_by": "Willie Garson",
    "views": "2.12",
    "episode": "E13",
    "season": ""
  },
  {
    "description": "Peter learns of the recovery of a stolen dinosaur egg, but the companion skeleton of an adult female Tyrannosaurus rex is still missing. He and Neal foil a thief's attempt to steal the egg back; he identifies a financier (Željko Ivanek) as his employer but does not know where the skeleton is. Neal and Mozzie build a forgery of the egg containing a tracker, leading them to the skeleton. Meanwhile, a suspicious Peter discovers that Neal is seeing Rebecca, and when he and Elizabeth crash their romantic dinner he learns that Rebecca thinks Neal is an FBI agent. Neal tells him he lied to her so she would not know of his criminal past, and Peter urges him to come clean to her. He does so and Rebecca accepts him; they have sex. Hagan correctly deduces that Neal plans to steal the stained-glass window, and with an implicit threat to June he tells Neal to steal it for him.",
    "title": "Digging Deeper",
    "date": "December 12, 2013 ",
    "directed_by": "Sanford Bookstaver",
    "views": "2.09",
    "episode": "E14",
    "season": ""
  },
  {
    "description": "In bed, Neal tells Rebecca a limited version of the truth but says he can't involve her in the theft of the window for her own safety. She convinces him to let her help, and the next day she distracts the men repairing the window while Neal and Mozzie steal it. They discover that one of the panels allows secret messages in Chapter 13 to be read, but only in the real Chapter 13, not their copy. They plan to trade this panel to Hagan for the evidence that Hagan has of Neal's earlier coin theft. At the same time, an FBI watch of pawnshops turns up one of the gold coins that Neal stole for Hagan, and that Hagan used to bribe Peter's prosecutor Dawson. Peter's investigation leads him to Decker, the man who fenced them for Dawson, but Mozzie tips off Decker and allows him to escape. Peter goes to Neal's apartment and claims that he has captured Decker, and Neal confesses to the coin theft, implying that he rather than Hagan was the one who bribed Dawson to save Peter. Peter feels obligated to arrest Neal and thus reopen his own case, probably ending his career, but Elizabeth counsels him against this. The next morning, Jones actually arrests Decker, and Peter does not question him about the coins; there are enough weapons and other contraband coins in Decker's store to ensure his conviction on other charges. Peter then goes to Dawson and offers not to reveal the bribe if Dawson resigns his position and returns the coins, which he does. Peter tells Neal that there will be \"changes\" in their working relationship, as he now realizes that Neal cannot fully change his criminal ways. Neal agrees.",
    "title": "No Good Deed",
    "date": "December 19, 2013 ",
    "directed_by": "Charlotte Sieling",
    "views": "2.52",
    "season": "S06",
    "episode": "E01"
  },
  {
    "description": "Peter is offered a promotion and reassignment to DC, but he is reluctant to take it until he resolves the mystery of Siegel's murder. Neal brings the panel to a meeting with Hagan intending to bargain, but Hagan shows him that he is holding Rebecca hostage and forces him and Mozzie to solve the puzzle hidden in the Codex. Peter is called to investigate an apparent forgery of a painting by William Blake. He calls in Neal despite the tension between them, and Neal finds Hagan's hidden signature in the painting. By offering to buy the painting and then tracking the resulting computer activity, Peter finds the seller's location, which is the very building where Neal and Mozzie are working with Hagan. Neal forces Hagan to release Rebecca by threatening to destroy the Codex chapter, then does it anyway after Mozzie has memorized their results. He finds Rebecca on a Brooklyn street and they embrace; Rebecca tells Neal that the hidden treasure is a twin to the Hope Diamond. The FBI arrive at that building and arrest Hagan, who says he has information that Peter should consider if he values his freedom. They go to Hagan's house to look at it, but Hagan is killed by a sniper before he can reveal anything. On Hagan's body is information that leads Neal and Peter to a Brooklyn apartment, which both Hagan and Siegel were watching on the day Siegel died. They enter the apartment and find three things: extensive files on Neal, Peter, and their associates, preparations to make both the Blake forgery and Hagan's signature, and evidence that the apartment's occupant is actually Rebecca.",
    "title": "Live Feed",
    "date": "January 9, 2014 ",
    "directed_by": "John Kretchmer",
    "views": "2.81",
    "episode": "E02",
    "season": ""
  },
  {
    "description": "While Neal distracts Rebecca, the FBI search her apartment. Peter concludes that she is actually in love with Neal, and as a ruse calls her in and tells her that Neal is the prime suspect in Hagan's murder. She asks Neal to meet in a park; Neal tells her he will have to run and she offers to go with him. Just as she is about to say that she is not really a mild-mannered book expert, she detects the FBI stakeout and flees. From evidence in the apartment, Peter determines that she is really Rachel Turner, a disgraced former MI5 agent. He also figures out where she hid the gun with which she killed Siegel. Against Peter's instructions, Neal arranges another meeting with her, offering to trade the location of the diamond for Hagan's blackmail information. Once he has the information he handcuffs her and tells her the FBI are on the way. She shoots the handcuff instead of him but she has been delayed long enough for the FBI to catch her. With Siegel's murder solved, Peter and Elizabeth prepare to move to Washington, where he has accepted the FBI promotion and she has accepted a job with the National Gallery. Neal and Mozzie are preparing to use Mozzie's memorized information to find the diamond when \"Rebecca\" phones from prison to say she will see Neal soon.",
    "title": "Shot Through the Heart",
    "date": "January 16, 2014 ",
    "directed_by": "Doug Hannah",
    "views": "2.65",
    "episode": "E03",
    "season": ""
  },
  {
    "description": "Neal asks Peter to support his request to have his sentence set aside, assuring him that he can truly go straight. As they are packing up evidence from Rebecca's case, a phone rings with a request to hire Rebecca for a job. Peter asks Diana to impersonate Rebecca and meet with the client. Rebecca is brought to the FBI office, where she helps Diana authenticate herself in return for being allowed to talk to Neal. The client wants Rebecca to steal a thumb drive from a financier's office, and Jones deduces that the drive contains an algorithm that could cause a financial crash. The financier takes the drive to his house, and while Peter is still applying for a warrant, Diana and Neal plan to break in and steal it. When Diana is called away for a child-care emergency, Neal does so; the emergency is revealed to have been the work of Mozzie, who has driven away her son Theo's nanny, forcing Diana to have Mozzie care for his namesake during the case. Diana gives a fake drive to the client, who incriminates himself and is arrested, with a slight hitch when the real Rebecca texts him that she is in custody. Theo inspires Mozzie to a breakthrough on the Mosconi puzzle, but as he calls Neal to tell him about it, he is shown being watched by Rebecca, who has escaped from prison.",
    "title": "Taking Stock",
    "date": "January 23, 2014 ",
    "directed_by": "Tim DeKay",
    "views": "2.75",
    "episode": "E04",
    "season": ""
  },
  {
    "description": "Peter and Neal find Mozzie, who has been injected with something. Rebecca then tells them she has poisoned him and will trade the antidote for the diamond. Interpreting Mozzie's symbols as geographical coordinates leads them to Fort Totten in Queens, where Mozzie is able to guide them near the diamond's location before collapsing. Mozzie is hospitalized and successfully treated for belladonna poisoning after Jones and Diana determine where Rebecca got her poison. Peter and Neal find the diamond and call Rebecca, who has been following them and immediately takes them prisoner at gunpoint. She locks them in a cell and prepares to leave by helicopter, but they escape and Neal reveals that he switched the diamond with a similar-sized piece of brick before giving it to her. He convinces her to surrender rather than shoot him. Peter asks the FBI for Neal's release and believes they will agree; Neal tells Mozzie he plans to go straight. But the FBI director refuses to sign off – perhaps, Peter speculates, because Neal is so useful to them. Disillusioned, Peter tells Elizabeth he wants to stay in his current position closer to field work; she agrees but wants to keep the job in DC. A bitter Neal asks Mozzie to circumvent the new anklet. After Mozzie leaves, Neal recognizes and confronts a man who has been following him. He is then grabbed from behind and thrown in a van, without his anklet.",
    "title": "Diamond Exchange",
    "date": "January 30, 2014 ",
    "directed_by": "Russell Lee Fine",
    "views": "2.99",
    "episode": "E05",
    "season": ""
  },
  {
    "description": "Peter brings Rebecca in to help locate Neal, who is being held captive by one of her former associates, Jim Boothe. Meanwhile, Jim wastes no time letting Neal know that if he doesn't comply with his demands he'll be pushed down an elevator shaft. Jim has lofty aspirations of joining an exclusive group of thieves, The Pink Panthers, and his entry ticket is the diamond currently held by the FBI. He needs Neal to steal it back. But Neal has a better plan - he thinks the situation calls for a grander gesture, and, for his trouble, he expects something in return. Elizabeth tells Peter that she is pregnant. Rebecca, upon leaving white collar, takes an agent's gun which leaves the second agent no choice but to shoot her, killing her in the end. As Neal says, \"She made a choice. For Her, it was better to risk almost certain death than go back to jail.\"",
    "title": "Borrowed Time",
    "date": "November 6, 2014 ",
    "directed_by": "John Kretchmer",
    "views": "1.54",
    "episode": "E06",
    "season": ""
  },
  {
    "description": "The U.S. Attorney General signs off on a contract, written by Mozzie, guaranteeing Neal's freedom if he helps take down the Panthers. Neal goes to his first meeting with them, without his anklet, and is surprised to meet Keller, who according to Russian authorities is still in one of their prisons. The Panthers assign Neal to steal a stamp about to be auctioned by an Argentine woman. Neal and Peter obtain admission to the auction by posing as a reclusive father and son, and Neal successfully takes the stamp in spite of a sophisticated security system. But the FBI will not release the stamp, so Neal makes a forgery which Keller vouches for. Neal deduces that Keller is an undercover Interpol informant, and confirms this with him, agreeing that neither can afford to expose the other. The Panthers tell Neal that the purpose of his theft of the stamp was to test the security system in preparation for a bigger job. Mozzie deduces that Elizabeth is pregnant, and Peter later tells Neal.",
    "title": "Return to Sender",
    "date": "November 13, 2014 ",
    "directed_by": "Martha Mitchell",
    "views": "1.36",
    "episode": "E07",
    "season": ""
  },
  {
    "description": "The Panthers assign Keller and Neal to copy a data disk from a safe in a security firm's office. Neal cultivates Amy, the assistant to the firm's head, and gets Mozzie into the safe, but the disk uses 1970's technology and Mozzie must take it home to read it. Before they can get it back to the safe, Amy's boss returns early from a trip and discovers it missing. Neal suggests that Amy confess to taking it to expose the security weakness, then ask for a promotion. Instead she quits her job in disgust and Neal is broken-hearted at having betrayed her. Keller and his Interpol handler Luc give the disk to the Panthers, and the FBI are able to interpret it as instructions to route some high-value cargo randomly through US airports.",
    "title": "Uncontrolled Variables",
    "date": "November 20, 2014 ",
    "directed_by": "Sanford Bookstaver",
    "views": "1.38",
    "episode": "E08",
    "season": ""
  },
  {
    "description": "Five years ago, while Neal was in prison, Mozzie met, worked with, and married a con artist named Eva before she swindled and abandoned him. Now Eva is back, asking for a divorce so she can marry Jack, a wealthy man who has recently devoted his life to charity. Neal and Peter determine that Eva and Jack are working together and plan to steal a Faberge egg, leaving Mozzie as the fall guy. They stop the theft, but Mozzie allows Eva to escape, without signing the divorce papers. Meanwhile, the FBI figure out that the Panthers' target is a plane bringing hundreds of millions in cash back from Europe, to a random airport determined by the stolen algorithm. Peter has the San Francisco FBI stake out the latest plane, but the Panthers don't show because, as Woodford tells Neal at June's house, they know that they have a mole.",
    "title": "All is Fair",
    "date": "December 4, 2014 ",
    "directed_by": "Paul Holahan",
    "views": "1.59 ",
    "episode": "E09",
    "season": ""
  },
  {
    "description": "Woodford does not know who the mole is, but he is sure it is not Neal since a spy bug was found before Neal joined the group. Neal refuses to help find the mole, making Woodford trust him even more and reveal the plan to steal the cash from the airport via a massive armed assault. Peter finds that the spy bug was planted by Luc to spy on Keller, and he asks Luc to pull Keller off of the operation. Peter, Mozzie and Neal brainstorm ways the Panthers could steal the cash less dangerously, until Peter hits on the idea of using pneumatic tubes built decades ago to move mail out of the airport. Luc finds out Neal is hiding something and decides to disobey Peter and leave Keller on the operation. Keller kills Luc and puts his own tracking chip on Woodford's deputy, who is then killed by Woodford. The FBI and Interpol agree to keep the operation going so Luc's death won't be in vain. Peter misses the appointment with Elizabeth to view the first sonogram of their son, and vows to her that he will never let anything else be a priority. Mozzie begs Neal to be introduced to the Pink Panthers, but Neal refuses, telling him it's not the right time. Since the Panthers are now one man short, Neal brings Peter to the meeting stating he's the one who's been helping him. Woodford responds by aiming his gun at Peter.",
    "title": "Whack a Mole",
    "date": "December 11, 2014 ",
    "directed_by": "Jeff F. King",
    "views": "1.57 ",
    "episode": "E10",
    "season": ""
  },
  {
    "description": "The Panthers' plan proceeds as planned except for two things: Mozzie intercepts a portion of the cash by opening the pneumatic tube in a tunnel, and the FBI arrest everyone at the end. Neal and Keller sneak away from Peter and meet Mozzie in the tunnel, where Keller betrays their arrangement and apparently shoots Neal in a struggle. Peter arrives, kills the fleeing Keller, and finds Neal being taken away in an ambulance. Later, at the hospital, he and Mozzie view what appears to be Neal's lifeless body. Some time later, after Peter and El's son Neal is born, a mysterious delivery of a bottle of fine wine inspires Peter to search out a storage container, which contains the evidence that Neal faked his death. The series ends with Neal Caffrey in Paris, seeking out some new adventure.",
    "title": "Au Revoir",
    "date": "December 18, 2014 ",
    "directed_by": "Sanford Bookstaver",
    "views": "1.86 ",
    "episode": "E11",
    "season": ""
  }
]